FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX700_RX72N_EnvisionKit_IAR_e2studio_EWRX/src/smc_gen/r_bsp/mcu/rx72n/register_access/iccrx/iodefine.h
#define IS_DPFPU_DPFPUEX        IS0
#define IS_CAN0_ERS0            IS0
#define IS_CAN1_ERS1            IS1
#define IS_CAN2_ERS2            IS2
#define IS_SCI0_TEI0            IS0
#define IS_SCI0_ERI0            IS1
#define IS_SCI1_TEI1            IS2
#define IS_SCI1_ERI1            IS3
#define IS_SCI2_TEI2            IS4
#define IS_SCI2_ERI2            IS5
#define IS_SCI3_TEI3            IS6
#define IS_SCI3_ERI3            IS7
#define IS_SCI4_TEI4            IS8
#define IS_SCI4_ERI4            IS9
#define IS_SCI5_TEI5            IS10
#define IS_SCI5_ERI5            IS11
#define IS_SCI6_TEI6            IS12
#define IS_SCI6_ERI6            IS13
#define IS_SCI12_TEI12          IS16
#define IS_SCI12_ERI12          IS17
#define IS_SCI12_SCIX0          IS18
#define IS_SCI12_SCIX1          IS19
#define IS_SCI12_SCIX2          IS20
#define IS_SCI12_SCIX3          IS21
#define IS_QSPI_QSPSSLI         IS24
#define IS_CAC_FERRI            IS26
#define IS_CAC_MENDI            IS27
#define IS_CAC_OVFI             IS28
#define IS_DOC_DOPCI            IS29
#define IS_PDC_PCFEI            IS30
#define IS_PDC_PCERI            IS31
#define IS_SDHI_CDETI           IS3
#define IS_SDHI_CACI            IS4
#define IS_SDHI_SDACI           IS5
#define IS_MMCIF_CDETIO         IS6
#define IS_MMCIF_ERRIO          IS7
#define IS_MMCIF_ACCIO          IS8
#define IS_POE3_OEI1            IS9
#define IS_POE3_OEI2            IS10
#define IS_POE3_OEI3            IS11
#define IS_POE3_OEI4            IS12
#define IS_RIIC0_TEI0           IS13
#define IS_RIIC0_EEI0           IS14
#define IS_RIIC2_TEI2           IS15
#define IS_RIIC2_EEI2           IS16
#define IS_SSIE0_SSIF0          IS17
#define IS_SSIE1_SSIF1          IS18
#define IS_S12AD_S12CMPAI       IS20
#define IS_S12AD_S12CMPBI       IS21
#define IS_S12AD1_S12CMPAI1     IS22
#define IS_S12AD1_S12CMPBI1     IS23
#define IS_RIIC1_TEI1           IS28
#define IS_RIIC1_EEI1           IS29
#define IS_POEG_POEGGAI         IS7
#define IS_POEG_POEGGBI         IS8
#define IS_POEG_POEGGCI         IS9
#define IS_POEG_POEGGDI         IS10
#define IS_SCI8_TEI8            IS0
#define IS_SCI8_ERI8            IS1
#define IS_SCI9_TEI9            IS4
#define IS_SCI9_ERI9            IS5
#define IS_SCI10_TEI10          IS8
#define IS_SCI10_ERI10          IS9
#define IS_SCI11_TEI11          IS12
#define IS_SCI11_ERI11          IS13
#define IS_RSPI0_SPII0          IS16
#define IS_RSPI0_SPEI0          IS17
#define IS_RSPI1_SPII1          IS18
#define IS_RSPI1_SPEI1          IS19
#define IS_RSPI2_SPII2          IS20
#define IS_RSPI2_SPEI2          IS21
#define IS_SCI7_TEI7            IS22
#define IS_SCI7_ERI7            IS23
#define IS_EPTPC_MINT           IS0
#define IS_PTPEDMAC_PINT        IS1
#define IS_EDMAC0_EINT0         IS4
#define IS_EDMAC1_EINT1         IS5
#define IS_GLCDC_VPOS           IS8
#define IS_GLCDC_GR1UF          IS9
#define IS_GLCDC_GR2UF          IS10
#define IS_DRW2D_DRWIRQ         IS11

#define EN_DPFPU_DPFPUEX        EN0
#define EN_CAN0_ERS0            EN0
#define EN_CAN1_ERS1            EN1
#define EN_CAN2_ERS2            EN2
#define EN_SCI0_TEI0            EN0
#define EN_SCI0_ERI0            EN1
#define EN_SCI1_TEI1            EN2
#define EN_SCI1_ERI1            EN3
#define EN_SCI2_TEI2            EN4
#define EN_SCI2_ERI2            EN5
#define EN_SCI3_TEI3            EN6
#define EN_SCI3_ERI3            EN7
#define EN_SCI4_TEI4            EN8
#define EN_SCI4_ERI4            EN9
#define EN_SCI5_TEI5            EN10
#define EN_SCI5_ERI5            EN11
#define EN_SCI6_TEI6            EN12
#define EN_SCI6_ERI6            EN13
#define EN_SCI12_TEI12          EN16
#define EN_SCI12_ERI12          EN17
#define EN_SCI12_SCIX0          EN18
#define EN_SCI12_SCIX1          EN19
#define EN_SCI12_SCIX2          EN20
#define EN_SCI12_SCIX3          EN21
#define EN_QSPI_QSPSSLI         EN24
#define EN_CAC_FERRI            EN26
#define EN_CAC_MENDI            EN27
#define EN_CAC_OVFI             EN28
#define EN_DOC_DOPCI            EN29
#define EN_PDC_PCFEI            EN30
#define EN_PDC_PCERI            EN31
#define EN_SDHI_CDETI           EN3
#define EN_SDHI_CACI            EN4
#define EN_SDHI_SDACI           EN5
#define EN_MMCIF_CDETIO         EN6
#define EN_MMCIF_ERRIO          EN7
#define EN_MMCIF_ACCIO          EN8
#define EN_POE3_OEI1            EN9
#define EN_POE3_OEI2            EN10
#define EN_POE3_OEI3            EN11
#define EN_POE3_OEI4            EN12
#define EN_RIIC0_TEI0           EN13
#define EN_RIIC0_EEI0           EN14
#define EN_RIIC2_TEI2           EN15
#define EN_RIIC2_EEI2           EN16
#define EN_SSIE0_SSIF0          EN17
#define EN_SSIE1_SSIF1          EN18
#define EN_S12AD_S12CMPAI       EN20
#define EN_S12AD_S12CMPBI       EN21
#define EN_S12AD1_S12CMPAI1     EN22
#define EN_S12AD1_S12CMPBI1     EN23
#define EN_RIIC1_TEI1           EN28
#define EN_RIIC1_EEI1           EN29
#define EN_POEG_POEGGAI         EN7
#define EN_POEG_POEGGBI         EN8
#define EN_POEG_POEGGCI         EN9
#define EN_POEG_POEGGDI         EN10
#define EN_SCI8_TEI8            EN0
#define EN_SCI8_ERI8            EN1
#define EN_SCI9_TEI9            EN4
#define EN_SCI9_ERI9            EN5
#define EN_SCI10_TEI10          EN8
#define EN_SCI10_ERI10          EN9
#define EN_SCI11_TEI11          EN12
#define EN_SCI11_ERI11          EN13
#define EN_RSPI0_SPII0          EN16
#define EN_RSPI0_SPEI0          EN17
#define EN_RSPI1_SPII1          EN18
#define EN_RSPI1_SPEI1          EN19
#define EN_RSPI2_SPII2          EN20
#define EN_RSPI2_SPEI2          EN21
#define EN_SCI7_TEI7            EN22
#define EN_SCI7_ERI7            EN23
#define EN_EPTPC_MINT           EN0
#define EN_PTPEDMAC_PINT        EN1
#define EN_EDMAC0_EINT0         EN4
#define EN_EDMAC1_EINT1         EN5
#define EN_GLCDC_VPOS           EN8
#define EN_GLCDC_GR1UF          EN9
#define EN_GLCDC_GR2UF          EN10
#define EN_DRW2D_DRWIRQ         EN11

#define CLR_DPFPU_DPFPUEX       CLR0
#define CLR_CAN0_ERS0           CLR0
#define CLR_CAN1_ERS1           CLR1
#define CLR_CAN2_ERS2           CLR2

#define GEN_DPFPU_DPFPUEX       GENIE0
#define GEN_CAN0_ERS0           GENBE0
#define GEN_CAN1_ERS1           GENBE0
#define GEN_CAN2_ERS2           GENBE0
#define GEN_SCI0_TEI0           GENBL0
#define GEN_SCI0_ERI0           GENBL0
#define GEN_SCI1_TEI1           GENBL0
#define GEN_SCI1_ERI1           GENBL0
#define GEN_SCI2_TEI2           GENBL0
#define GEN_SCI2_ERI2           GENBL0
#define GEN_SCI3_TEI3           GENBL0
#define GEN_SCI3_ERI3           GENBL0
#define GEN_SCI4_TEI4           GENBL0
#define GEN_SCI4_ERI4           GENBL0
#define GEN_SCI5_TEI5           GENBL0
#define GEN_SCI5_ERI5           GENBL0
#define GEN_SCI6_TEI6           GENBL0
#define GEN_SCI6_ERI6           GENBL0
#define GEN_SCI12_TEI12         GENBL0
#define GEN_SCI12_ERI12         GENBL0
#define GEN_SCI12_SCIX0         GENBL0
#define GEN_SCI12_SCIX1         GENBL0
#define GEN_SCI12_SCIX2         GENBL0
#define GEN_SCI12_SCIX3         GENBL0
#define GEN_QSPI_QSPSSLI        GENBL0
#define GEN_CAC_FERRI           GENBL0
#define GEN_CAC_MENDI           GENBL0
#define GEN_CAC_OVFI            GENBL0
#define GEN_DOC_DOPCI           GENBL0
#define GEN_PDC_PCFEI           GENBL0
#define GEN_PDC_PCERI           GENBL0
#define GEN_SDHI_CDETI          GENBL1
#define GEN_SDHI_CACI           GENBL1
#define GEN_SDHI_SDACI          GENBL1
#define GEN_MMCIF_CDETIO        GENBL1
#define GEN_MMCIF_ERRIO         GENBL1
#define GEN_MMCIF_ACCIO         GENBL1
#define GEN_POE3_OEI1           GENBL1
#define GEN_POE3_OEI2           GENBL1
#define GEN_POE3_OEI3           GENBL1
#define GEN_POE3_OEI4           GENBL1
#define GEN_RIIC0_TEI0          GENBL1
#define GEN_RIIC0_EEI0          GENBL1
#define GEN_RIIC2_TEI2          GENBL1
#define GEN_RIIC2_EEI2          GENBL1
#define GEN_SSIE0_SSIF0         GENBL1
#define GEN_SSIE1_SSIF1         GENBL1
#define GEN_S12AD_S12CMPAI      GENBL1
#define GEN_S12AD_S12CMPBI      GENBL1
#define GEN_S12AD1_S12CMPAI1    GENBL1
#define GEN_S12AD1_S12CMPBI1    GENBL1
#define GEN_RIIC1_TEI1          GENBL1
#define GEN_RIIC1_EEI1          GENBL1
#define GEN_POEG_POEGGAI        GENBL2
#define GEN_POEG_POEGGBI        GENBL2
#define GEN_POEG_POEGGCI        GENBL2
#define GEN_POEG_POEGGDI        GENBL2
#define GEN_SCI8_TEI8           GENAL0
#define GEN_SCI8_ERI8           GENAL0
#define GEN_SCI9_TEI9           GENAL0
#define GEN_SCI9_ERI9           GENAL0
#define GEN_SCI10_TEI10         GENAL0
#define GEN_SCI10_ERI10         GENAL0
#define GEN_SCI11_TEI11         GENAL0
#define GEN_SCI11_ERI11         GENAL0
#define GEN_RSPI0_SPII0         GENAL0
#define GEN_RSPI0_SPEI0         GENAL0
#define GEN_RSPI1_SPII1         GENAL0
#define GEN_RSPI1_SPEI1         GENAL0
#define GEN_RSPI2_SPII2         GENAL0
#define GEN_RSPI2_SPEI2         GENAL0
#define GEN_SCI7_TEI7           GENAL0
#define GEN_SCI7_ERI7           GENAL0
#define GEN_EPTPC_MINT          GENAL1
#define GEN_PTPEDMAC_PINT       GENAL1
#define GEN_EDMAC0_EINT0        GENAL1
#define GEN_EDMAC1_EINT1        GENAL1
#define GEN_GLCDC_VPOS          GENAL1
#define GEN_GLCDC_GR1UF         GENAL1
#define GEN_GLCDC_GR2UF         GENAL1
#define GEN_DRW2D_DRWIRQ        GENAL1

#define GRP_DPFPU_DPFPUEX       GRPIE0
#define GRP_CAN0_ERS0           GRPBE0
#define GRP_CAN1_ERS1           GRPBE0
#define GRP_CAN2_ERS2           GRPBE0
#define GRP_SCI0_TEI0           GRPBL0
#define GRP_SCI0_ERI0           GRPBL0
#define GRP_SCI1_TEI1           GRPBL0
#define GRP_SCI1_ERI1           GRPBL0
#define GRP_SCI2_TEI2           GRPBL0
#define GRP_SCI2_ERI2           GRPBL0
#define GRP_SCI3_TEI3           GRPBL0
#define GRP_SCI3_ERI3           GRPBL0
#define GRP_SCI4_TEI4           GRPBL0
#define GRP_SCI4_ERI4           GRPBL0
#define GRP_SCI5_TEI5           GRPBL0
#define GRP_SCI5_ERI5           GRPBL0
#define GRP_SCI6_TEI6           GRPBL0
#define GRP_SCI6_ERI6           GRPBL0
#define GRP_SCI12_TEI12         GRPBL0
#define GRP_SCI12_ERI12         GRPBL0
#define GRP_SCI12_SCIX0         GRPBL0
#define GRP_SCI12_SCIX1         GRPBL0
#define GRP_SCI12_SCIX2         GRPBL0
#define GRP_SCI12_SCIX3         GRPBL0
#define GRP_QSPI_QSPSSLI        GRPBL0
#define GRP_CAC_FERRI           GRPBL0
#define GRP_CAC_MENDI           GRPBL0
#define GRP_CAC_OVFI            GRPBL0
#define GRP_DOC_DOPCI           GRPBL0
#define GRP_PDC_PCFEI           GRPBL0
#define GRP_PDC_PCERI           GRPBL0
#define GRP_SDHI_CDETI          GRPBL1
#define GRP_SDHI_CACI           GRPBL1
#define GRP_SDHI_SDACI          GRPBL1
#define GRP_MMCIF_CDETIO        GRPBL1
#define GRP_MMCIF_ERRIO         GRPBL1
#define GRP_MMCIF_ACCIO         GRPBL1
#define GRP_POE3_OEI1           GRPBL1
#define GRP_POE3_OEI2           GRPBL1
#define GRP_POE3_OEI3           GRPBL1
#define GRP_POE3_OEI4           GRPBL1
#define GRP_RIIC0_TEI0          GRPBL1
#define GRP_RIIC0_EEI0          GRPBL1
#define GRP_RIIC2_TEI2          GRPBL1
#define GRP_RIIC2_EEI2          GRPBL1
#define GRP_SSIE0_SSIF0         GRPBL1
#define GRP_SSIE1_SSIF1         GRPBL1
#define GRP_S12AD_S12CMPAI      GRPBL1
#define GRP_S12AD_S12CMPBI      GRPBL1
#define GRP_S12AD1_S12CMPAI1    GRPBL1
#define GRP_S12AD1_S12CMPBI1    GRPBL1
#define GRP_RIIC1_TEI1          GRPBL1
#define GRP_RIIC1_EEI1          GRPBL1
#define GRP_POEG_POEGGAI        GRPBL2
#define GRP_POEG_POEGGBI        GRPBL2
#define GRP_POEG_POEGGCI        GRPBL2
#define GRP_POEG_POEGGDI        GRPBL2
#define GRP_SCI8_TEI8           GRPAL0
#define GRP_SCI8_ERI8           GRPAL0
#define GRP_SCI9_TEI9           GRPAL0
#define GRP_SCI9_ERI9           GRPAL0
#define GRP_SCI10_TEI10         GRPAL0
#define GRP_SCI10_ERI10         GRPAL0
#define GRP_SCI11_TEI11         GRPAL0
#define GRP_SCI11_ERI11         GRPAL0
#define GRP_RSPI0_SPII0         GRPAL0
#define GRP_RSPI0_SPEI0         GRPAL0
#define GRP_RSPI1_SPII1         GRPAL0
#define GRP_RSPI1_SPEI1         GRPAL0
#define GRP_RSPI2_SPII2         GRPAL0
#define GRP_RSPI2_SPEI2         GRPAL0
#define GRP_SCI7_TEI7           GRPAL0
#define GRP_SCI7_ERI7           GRPAL0
#define GRP_EPTPC_MINT          GRPAL1
#define GRP_PTPEDMAC_PINT       GRPAL1
#define GRP_EDMAC0_EINT0        GRPAL1
#define GRP_EDMAC1_EINT1        GRPAL1
#define GRP_GLCDC_VPOS          GRPAL1
#define GRP_GLCDC_GR1UF         GRPAL1
#define GRP_GLCDC_GR2UF         GRPAL1
#define GRP_DRW2D_DRWIRQ        GRPAL1

