FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX700_RX72N_EnvisionKit_IAR_e2studio_EWRX/src/smc_gen/r_bsp/mcu/rx72n/register_access/iccrx/iodefine.h
#define GCR_DPFPU_DPFPUEX       GCRIE0
#define GCR_CAN0_ERS0           GCRBE0
#define GCR_CAN1_ERS1           GCRBE0
#define GCR_CAN2_ERS2           GCRBE0

#define __IR( x )         ICU.IR[ IR ## x ].BIT.IR
#define  _IR( x )         __IR( x )
#define   IR( x, y )      _IR( _ ## x ## _ ## y )
#define __DTCE( x )       ICU.DTCER[ DTCE ## x ].BIT.DTCE
#define  _DTCE( x )       __DTCE( x )
#define   DTCE( x, y )    _DTCE( _ ## x ## _ ## y )
#define __IEN( x )        ICU.IER[ IER ## x ].BIT.IEN ## x
#define  _IEN( x )        __IEN( x )
#define   IEN( x, y )     _IEN( _ ## x ## _ ## y )
#define __IPR( x )        ICU.IPR[ IPR ## x ].BIT.IPR
#define  _IPR( x )        __IPR( x )
#define   IPR( x, y )     _IPR( _ ## x ## _ ## y )
#define __VECT( x )       VECT ## x
#define  _VECT( x )       __VECT( x )
#define   VECT( x, y )    _VECT( _ ## x ## _ ## y )
#define __MSTP( x )       MSTP ## x
#define  _MSTP( x )       __MSTP( x )
#define   MSTP( x )       _MSTP( _ ## x )

#define __IS( x )         ICU.GRP ## x.BIT.IS ## x
#define  _IS( x )         __IS( x )
#define   IS( x, y )      _IS( _ ## x ## _ ## y )
#define __EN( x )         ICU.GEN ## x.BIT.EN ## x
#define  _EN( x )         __EN( x )
#define   EN( x, y )      _EN( _ ## x ## _ ## y )
#define __CLR( x )        ICU.GCR ## x.BIT.CLR ## x
#define  _CLR( x )        __CLR( x )
#define   CLR( x, y )     _CLR( _ ## x ## _ ## y )

#define BSC           ( *( volatile struct st_bsc __sfr __evenaccess * ) 0x81300 )
#define CAC           ( *( volatile struct st_cac __sfr __evenaccess * ) 0x8B000 )
#define CAN0          ( *( volatile struct st_can __sfr __evenaccess * ) 0x90200 )
#define CAN1          ( *( volatile struct st_can __sfr __evenaccess * ) 0x91200 )
#define CAN2          ( *( volatile struct st_can __sfr __evenaccess * ) 0x92200 )
#define CMT           ( *( volatile struct st_cmt __sfr __evenaccess * ) 0x88000 )
#define CMT0          ( *( volatile struct st_cmt0 __sfr __evenaccess * ) 0x88002 )
#define CMT1          ( *( volatile struct st_cmt0 __sfr __evenaccess * ) 0x88008 )
#define CMT2          ( *( volatile struct st_cmt0 __sfr __evenaccess * ) 0x88012 )
#define CMT3          ( *( volatile struct st_cmt0 __sfr __evenaccess * ) 0x88018 )
#define CMTW0         ( *( volatile struct st_cmtw __sfr __evenaccess * ) 0x94200 )
#define CMTW1         ( *( volatile struct st_cmtw __sfr __evenaccess * ) 0x94280 )
#define CRC           ( *( volatile struct st_crc __sfr __evenaccess * ) 0x88280 )
#define DA            ( *( volatile struct st_da __sfr __evenaccess * ) 0x88040 )
#define DMAC          ( *( volatile struct st_dmac __sfr __evenaccess * ) 0x82200 )
#define DMAC0         ( *( volatile struct st_dmac0 __sfr __evenaccess * ) 0x82000 )
#define DMAC1         ( *( volatile struct st_dmac1 __sfr __evenaccess * ) 0x82040 )
#define DMAC2         ( *( volatile struct st_dmac1 __sfr __evenaccess * ) 0x82080 )
#define DMAC3         ( *( volatile struct st_dmac1 __sfr __evenaccess * ) 0x820C0 )
#define DMAC4         ( *( volatile struct st_dmac1 __sfr __evenaccess * ) 0x82100 )
#define DMAC5         ( *( volatile struct st_dmac1 __sfr __evenaccess * ) 0x82140 )
#define DMAC6         ( *( volatile struct st_dmac1 __sfr __evenaccess * ) 0x82180 )
#define DMAC7         ( *( volatile struct st_dmac1 __sfr __evenaccess * ) 0x821C0 )
#define DOC           ( *( volatile struct st_doc __sfr __evenaccess * ) 0x8B080 )
#define DRW2D         ( *( volatile struct st_drw2d __sfr __evenaccess * ) 0xE3000 )
#define DTC           ( *( volatile struct st_dtc __sfr __evenaccess * ) 0x82400 )
#define ECCRAM        ( *( volatile struct st_eccram __sfr __evenaccess * ) 0x812C0 )
#define EDMAC0        ( *( volatile struct st_edmac __sfr __evenaccess * ) 0xC0000 )
#define EDMAC1        ( *( volatile struct st_edmac __sfr __evenaccess * ) 0xC0200 )
#define ELC           ( *( volatile struct st_elc __sfr __evenaccess * ) 0x8B100 )
#define EPTPC         ( *( volatile struct st_eptpc __sfr __evenaccess * ) 0xC0500 )
#define EPTPC0        ( *( volatile struct st_eptpc0 __sfr __evenaccess * ) 0xC4800 )
#define EPTPC1        ( *( volatile struct st_eptpc0 __sfr __evenaccess * ) 0xC4C00 )
#define ETHERC0       ( *( volatile struct st_etherc __sfr __evenaccess * ) 0xC0100 )
#define ETHERC1       ( *( volatile struct st_etherc __sfr __evenaccess * ) 0xC0300 )
#define EXDMAC        ( *( volatile struct st_exdmac __sfr __evenaccess * ) 0x82A00 )
#define EXDMAC0       ( *( volatile struct st_exdmac0 __sfr __evenaccess * ) 0x82800 )
#define EXDMAC1       ( *( volatile struct st_exdmac1 __sfr __evenaccess * ) 0x82840 )
#define FLASH         ( *( volatile struct st_flash __sfr __evenaccess * ) 0x81000 )
#define GLCDC         ( *( volatile struct st_glcdc __sfr __evenaccess * ) 0xE0000 )
#define GPTW0         ( *( volatile struct st_gptw __sfr __evenaccess * ) 0xC2000 )
#define GPTW1         ( *( volatile struct st_gptw __sfr __evenaccess * ) 0xC2100 )
#define GPTW2         ( *( volatile struct st_gptw __sfr __evenaccess * ) 0xC2200 )
#define GPTW3         ( *( volatile struct st_gptw __sfr __evenaccess * ) 0xC2300 )
#define ICU           ( *( volatile struct st_icu __sfr __evenaccess * ) 0x87000 )
#define IWDT          ( *( volatile struct st_iwdt __sfr __evenaccess * ) 0x88030 )
#define MMCIF         ( *( volatile struct st_mmcif __sfr __evenaccess * ) 0x88500 )
#define MPC           ( *( volatile struct st_mpc __sfr __evenaccess * ) 0x8C100 )
#define MPU           ( *( volatile struct st_mpu __sfr __evenaccess * ) 0x86400 )
#define MTU           ( *( volatile struct st_mtu __sfr __evenaccess * ) 0xC120A )
#define MTU0          ( *( volatile struct st_mtu0 __sfr __evenaccess * ) 0xC1290 )
#define MTU1          ( *( volatile struct st_mtu1 __sfr __evenaccess * ) 0xC1290 )
#define MTU2          ( *( volatile struct st_mtu2 __sfr __evenaccess * ) 0xC1292 )
#define MTU3          ( *( volatile struct st_mtu3 __sfr __evenaccess * ) 0xC1200 )
#define MTU4          ( *( volatile struct st_mtu4 __sfr __evenaccess * ) 0xC1200 )
#define MTU5          ( *( volatile struct st_mtu5 __sfr __evenaccess * ) 0xC1A94 )
#define MTU6          ( *( volatile struct st_mtu6 __sfr __evenaccess * ) 0xC1A00 )
#define MTU7          ( *( volatile struct st_mtu7 __sfr __evenaccess * ) 0xC1A00 )
#define MTU8          ( *( volatile struct st_mtu8 __sfr __evenaccess * ) 0xC1298 )
#define OFSM          ( *( volatile struct st_ofsm __sfr __evenaccess * ) 0xFE7F5D00 )
#define PDC           ( *( volatile struct st_pdc __sfr __evenaccess * ) 0xA0500 )
#define PMGI0         ( *( volatile struct st_pmgi __sfr __evenaccess * ) 0xC5880 )
#define PMGI1         ( *( volatile struct st_pmgi __sfr __evenaccess * ) 0xC5890 )
#define POE3          ( *( volatile struct st_poe __sfr __evenaccess * ) 0x8C4C0 )
#define POEG          ( *( volatile struct st_poeg __sfr __evenaccess * ) 0x9E000 )
#define PORT0         ( *( volatile struct st_port0 __sfr __evenaccess * ) 0x8C000 )
#define PORT1         ( *( volatile struct st_port1 __sfr __evenaccess * ) 0x8C001 )
#define PORT2         ( *( volatile struct st_port2 __sfr __evenaccess * ) 0x8C002 )
#define PORT3         ( *( volatile struct st_port3 __sfr __evenaccess * ) 0x8C003 )
#define PORT4         ( *( volatile struct st_port4 __sfr __evenaccess * ) 0x8C004 )
#define PORT5         ( *( volatile struct st_port5 __sfr __evenaccess * ) 0x8C005 )
#define PORT6         ( *( volatile struct st_port6 __sfr __evenaccess * ) 0x8C006 )
#define PORT7         ( *( volatile struct st_port7 __sfr __evenaccess * ) 0x8C007 )
#define PORT8         ( *( volatile struct st_port8 __sfr __evenaccess * ) 0x8C008 )
#define PORT9         ( *( volatile struct st_port9 __sfr __evenaccess * ) 0x8C009 )
#define PORTA         ( *( volatile struct st_porta __sfr __evenaccess * ) 0x8C00A )
#define PORTB         ( *( volatile struct st_portb __sfr __evenaccess * ) 0x8C00B )
#define PORTC         ( *( volatile struct st_portc __sfr __evenaccess * ) 0x8C00C )
#define PORTD         ( *( volatile struct st_portd __sfr __evenaccess * ) 0x8C00D )
#define PORTE         ( *( volatile struct st_porte __sfr __evenaccess * ) 0x8C00E )
#define PORTF         ( *( volatile struct st_portf __sfr __evenaccess * ) 0x8C00F )
#define PORTG         ( *( volatile struct st_portg __sfr __evenaccess * ) 0x8C010 )
#define PORTH         ( *( volatile struct st_porth __sfr __evenaccess * ) 0x8C011 )
#define PORTJ         ( *( volatile struct st_portj __sfr __evenaccess * ) 0x8C012 )
#define PORTK         ( *( volatile struct st_portk __sfr __evenaccess * ) 0x8C013 )
#define PORTL         ( *( volatile struct st_portl __sfr __evenaccess * ) 0x8C014 )
#define PORTM         ( *( volatile struct st_portm __sfr __evenaccess * ) 0x8C015 )
#define PORTN         ( *( volatile struct st_portn __sfr __evenaccess * ) 0x8C016 )
#define PORTQ         ( *( volatile struct st_portq __sfr __evenaccess * ) 0x8C017 )
#define PPG0          ( *( volatile struct st_ppg0 __sfr __evenaccess * ) 0x881E6 )
#define PPG1          ( *( volatile struct st_ppg1 __sfr __evenaccess * ) 0x881F0 )
#define PTPEDMAC      ( *( volatile struct st_ptpedmac __sfr __evenaccess * ) 0xC0400 )
#define QSPI          ( *( volatile struct st_qspi __sfr __evenaccess * ) 0x89E00 )
#define RAM           ( *( volatile struct st_ram __sfr __evenaccess * ) 0x81200 )
#define RIIC0         ( *( volatile struct st_riic __sfr __evenaccess * ) 0x88300 )
#define RIIC1         ( *( volatile struct st_riic __sfr __evenaccess * ) 0x88320 )
#define RIIC2         ( *( volatile struct st_riic __sfr __evenaccess * ) 0x88340 )
#define RSPI0         ( *( volatile struct st_rspi __sfr __evenaccess * ) 0xD0100 )
#define RSPI1         ( *( volatile struct st_rspi __sfr __evenaccess * ) 0xD0140 )
#define RSPI2         ( *( volatile struct st_rspi __sfr __evenaccess * ) 0xD0300 )
#define RTC           ( *( volatile struct st_rtc __sfr __evenaccess * ) 0x8C400 )
#define S12AD         ( *( volatile struct st_s12ad __sfr __evenaccess * ) 0x89000 )
#define S12AD1        ( *( volatile struct st_s12ad1 __sfr __evenaccess * ) 0x89100 )
#define SCI0          ( *( volatile struct st_sci0 __sfr __evenaccess * ) 0x8A000 )
#define SCI1          ( *( volatile struct st_sci0 __sfr __evenaccess * ) 0x8A020 )
#define SCI2          ( *( volatile struct st_sci0 __sfr __evenaccess * ) 0x8A040 )
#define SCI3          ( *( volatile struct st_sci0 __sfr __evenaccess * ) 0x8A060 )
#define SCI4          ( *( volatile struct st_sci0 __sfr __evenaccess * ) 0x8A080 )
#define SCI5          ( *( volatile struct st_sci0 __sfr __evenaccess * ) 0x8A0A0 )
#define SCI6          ( *( volatile struct st_sci0 __sfr __evenaccess * ) 0x8A0C0 )
#define SCI7          ( *( volatile struct st_sci7 __sfr __evenaccess * ) 0xD00E0 )
#define SCI8          ( *( volatile struct st_sci7 __sfr __evenaccess * ) 0xD0000 )
#define SCI9          ( *( volatile struct st_sci7 __sfr __evenaccess * ) 0xD0020 )
#define SCI10         ( *( volatile struct st_sci7 __sfr __evenaccess * ) 0xD0040 )
#define SCI11         ( *( volatile struct st_sci7 __sfr __evenaccess * ) 0xD0060 )
#define SCI12         ( *( volatile struct st_sci12 __sfr __evenaccess * ) 0x8B300 )
#define SDHI          ( *( volatile struct st_sdhi __sfr __evenaccess * ) 0x8AC00 )
#define SMCI0         ( *( volatile struct st_smci __sfr __evenaccess * ) 0x8A000 )
#define SMCI1         ( *( volatile struct st_smci __sfr __evenaccess * ) 0x8A020 )
#define SMCI2         ( *( volatile struct st_smci __sfr __evenaccess * ) 0x8A040 )
#define SMCI3         ( *( volatile struct st_smci __sfr __evenaccess * ) 0x8A060 )
#define SMCI4         ( *( volatile struct st_smci __sfr __evenaccess * ) 0x8A080 )
#define SMCI5         ( *( volatile struct st_smci __sfr __evenaccess * ) 0x8A0A0 )
#define SMCI6         ( *( volatile struct st_smci __sfr __evenaccess * ) 0x8A0C0 )
#define SMCI7         ( *( volatile struct st_smci __sfr __evenaccess * ) 0xD00E0 )
#define SMCI8         ( *( volatile struct st_smci __sfr __evenaccess * ) 0xD0000 )
#define SMCI9         ( *( volatile struct st_smci __sfr __evenaccess * ) 0xD0020 )
#define SMCI10        ( *( volatile struct st_smci __sfr __evenaccess * ) 0xD0040 )
#define SMCI11        ( *( volatile struct st_smci __sfr __evenaccess * ) 0xD0060 )
#define SMCI12        ( *( volatile struct st_smci __sfr __evenaccess * ) 0x8B300 )
#define SSIE0         ( *( volatile struct st_ssie __sfr __evenaccess * ) 0x8A500 )
#define SSIE1         ( *( volatile struct st_ssie __sfr __evenaccess * ) 0x8A540 )
#define SYSTEM        ( *( volatile struct st_system __sfr __evenaccess * ) 0x80000 )
#define TEMPS         ( *( volatile struct st_temps __sfr __evenaccess * ) 0x8C500 )
#define TMR0          ( *( volatile struct st_tmr0 __sfr __evenaccess * ) 0x88200 )
#define TMR1          ( *( volatile struct st_tmr1 __sfr __evenaccess * ) 0x88201 )
#define TMR2          ( *( volatile struct st_tmr0 __sfr __evenaccess * ) 0x88210 )
#define TMR3          ( *( volatile struct st_tmr1 __sfr __evenaccess * ) 0x88211 )
#define TMR01         ( *( volatile struct st_tmr01 __sfr __evenaccess * ) 0x88204 )
#define TMR23         ( *( volatile struct st_tmr01 __sfr __evenaccess * ) 0x88214 )
#define TPU0          ( *( volatile struct st_tpu0 __sfr __evenaccess * ) 0x88108 )
#define TPU1          ( *( volatile struct st_tpu1 __sfr __evenaccess * ) 0x88108 )
#define TPU2          ( *( volatile struct st_tpu2 __sfr __evenaccess * ) 0x8810A )
#define TPU3          ( *( volatile struct st_tpu3 __sfr __evenaccess * ) 0x8810A )
#define TPU4          ( *( volatile struct st_tpu4 __sfr __evenaccess * ) 0x8810C )
#define TPU5          ( *( volatile struct st_tpu5 __sfr __evenaccess * ) 0x8810C )
#define TPUA          ( *( volatile struct st_tpua __sfr __evenaccess * ) 0x88100 )
#define USB           ( *( volatile struct st_usb __sfr __evenaccess * ) 0xA0400 )
#define USB0          ( *( volatile struct st_usb0 __sfr __evenaccess * ) 0xA0000 )
#define WDT           ( *( volatile struct st_wdt __sfr __evenaccess * ) 0x88020 )
#define FLASHCONST    ( *( volatile struct st_flashconst __sfr __evenaccess * ) 0xFE7F7D90 )
#define TEMPSCONST    ( *( volatile struct st_tempsconst __sfr __evenaccess * ) 0xFE7F7D7C )

typedef enum enum_ir
{
    IR_BSC_BUSERR = 16, IR_ICU_GROUPIE0 = 17,
    IR_RAM_RAMERR,
    IR_FCU_FIFERR = 21, IR_FCU_FRDYI = 23,
    IR_ICU_SWINT2 = 26, IR_ICU_SWINT,
    IR_CMT0_CMI0,
    IR_CMT1_CMI1,
    IR_CMTW0_CMWI0,
    IR_CMTW1_CMWI1,
    IR_USB0_D0FIFO0 = 34, IR_USB0_D1FIFO0,
    IR_RSPI0_SPRI0 = 38, IR_RSPI0_SPTI0,
    IR_RSPI1_SPRI1, IR_RSPI1_SPTI1,
    IR_QSPI_SPRI, IR_QSPI_SPTI,
    IR_SDHI_SBFAI,
    IR_MMCIF_MBFAI,
    IR_SSIE0_SSITXI0, IR_SSIE0_SSIRXI0,
    IR_SSIE1_SSIRTI1,
    IR_RIIC1_RXI1 = 50, IR_RIIC1_TXI1,
    IR_RIIC0_RXI0, IR_RIIC0_TXI0,
    IR_RIIC2_RXI2, IR_RIIC2_TXI2,
    IR_SCI0_RXI0 = 58, IR_SCI0_TXI0,
    IR_SCI1_RXI1, IR_SCI1_TXI1,
    IR_SCI2_RXI2, IR_SCI2_TXI2,
    IR_ICU_IRQ0, IR_ICU_IRQ1, IR_ICU_IRQ2, IR_ICU_IRQ3, IR_ICU_IRQ4, IR_ICU_IRQ5, IR_ICU_IRQ6, IR_ICU_IRQ7,
    IR_ICU_IRQ8, IR_ICU_IRQ9, IR_ICU_IRQ10, IR_ICU_IRQ11, IR_ICU_IRQ12, IR_ICU_IRQ13, IR_ICU_IRQ14, IR_ICU_IRQ15,
    IR_SCI3_RXI3, IR_SCI3_TXI3,
    IR_SCI4_RXI4, IR_SCI4_TXI4,
    IR_SCI5_RXI5, IR_SCI5_TXI5,
    IR_SCI6_RXI6, IR_SCI6_TXI6,
    IR_LVD1_LVD1,
    IR_LVD2_LVD2,
    IR_USB0_USBR0,
    IR_RTC_ALM = 92, IR_RTC_PRD,
    IR_IWDT_IWUNI = 95,
    IR_WDT_WUNI,
    IR_PDC_PCDFI,
    IR_SCI7_RXI7, IR_SCI7_TXI7,
    IR_SCI8_RXI8, IR_SCI8_TXI8,
    IR_SCI9_RXI9, IR_SCI9_TXI9,
    IR_SCI10_RXI10, IR_SCI10_TXI10,
    IR_ICU_GROUPBE0, IR_ICU_GROUPBL2,
    IR_RSPI2_SPRI2, IR_RSPI2_SPTI2,
    IR_ICU_GROUPBL0, IR_ICU_GROUPBL1, IR_ICU_GROUPAL0, IR_ICU_GROUPAL1,
    IR_SCI11_RXI11, IR_SCI11_TXI11,
    IR_SCI12_RXI12, IR_SCI12_TXI12,
    IR_DMAC_DMAC0I = 120, IR_DMAC_DMAC1I, IR_DMAC_DMAC2I, IR_DMAC_DMAC3I, IR_DMAC_DMAC74I,
    IR_OST_OSTDI,
    IR_EXDMAC_EXDMAC0I, IR_EXDMAC_EXDMAC1I,
    IR_PERIB_INTB128, IR_PERIB_INTB129, IR_PERIB_INTB130, IR_PERIB_INTB131, IR_PERIB_INTB132,
    IR_PERIB_INTB133, IR_PERIB_INTB134, IR_PERIB_INTB135, IR_PERIB_INTB136, IR_PERIB_INTB137,
    IR_PERIB_INTB138, IR_PERIB_INTB139, IR_PERIB_INTB140, IR_PERIB_INTB141, IR_PERIB_INTB142,
    IR_PERIB_INTB143, IR_PERIB_INTB144, IR_PERIB_INTB145, IR_PERIB_INTB146, IR_PERIB_INTB147,
    IR_PERIB_INTB148, IR_PERIB_INTB149, IR_PERIB_INTB150, IR_PERIB_INTB151, IR_PERIB_INTB152,
    IR_PERIB_INTB153, IR_PERIB_INTB154, IR_PERIB_INTB155, IR_PERIB_INTB156, IR_PERIB_INTB157,
    IR_PERIB_INTB158, IR_PERIB_INTB159, IR_PERIB_INTB160, IR_PERIB_INTB161, IR_PERIB_INTB162,
    IR_PERIB_INTB163, IR_PERIB_INTB164, IR_PERIB_INTB165, IR_PERIB_INTB166, IR_PERIB_INTB167,
    IR_PERIB_INTB168, IR_PERIB_INTB169, IR_PERIB_INTB170, IR_PERIB_INTB171, IR_PERIB_INTB172,
    IR_PERIB_INTB173, IR_PERIB_INTB174, IR_PERIB_INTB175, IR_PERIB_INTB176, IR_PERIB_INTB177,
    IR_PERIB_INTB178, IR_PERIB_INTB179, IR_PERIB_INTB180, IR_PERIB_INTB181, IR_PERIB_INTB182,
    IR_PERIB_INTB183, IR_PERIB_INTB184, IR_PERIB_INTB185, IR_PERIB_INTB186, IR_PERIB_INTB187,
    IR_PERIB_INTB188, IR_PERIB_INTB189, IR_PERIB_INTB190, IR_PERIB_INTB191, IR_PERIB_INTB192,
    IR_PERIB_INTB193, IR_PERIB_INTB194, IR_PERIB_INTB195, IR_PERIB_INTB196, IR_PERIB_INTB197,
    IR_PERIB_INTB198, IR_PERIB_INTB199, IR_PERIB_INTB200, IR_PERIB_INTB201, IR_PERIB_INTB202,
    IR_PERIB_INTB203, IR_PERIB_INTB204, IR_PERIB_INTB205, IR_PERIB_INTB206, IR_PERIB_INTB207,
    IR_PERIA_INTA208, IR_PERIA_INTA209, IR_PERIA_INTA210, IR_PERIA_INTA211, IR_PERIA_INTA212,
    IR_PERIA_INTA213, IR_PERIA_INTA214, IR_PERIA_INTA215, IR_PERIA_INTA216, IR_PERIA_INTA217,
    IR_PERIA_INTA218, IR_PERIA_INTA219, IR_PERIA_INTA220, IR_PERIA_INTA221, IR_PERIA_INTA222,
    IR_PERIA_INTA223, IR_PERIA_INTA224, IR_PERIA_INTA225, IR_PERIA_INTA226, IR_PERIA_INTA227,
    IR_PERIA_INTA228, IR_PERIA_INTA229, IR_PERIA_INTA230, IR_PERIA_INTA231, IR_PERIA_INTA232,
    IR_PERIA_INTA233, IR_PERIA_INTA234, IR_PERIA_INTA235, IR_PERIA_INTA236, IR_PERIA_INTA237,
    IR_PERIA_INTA238, IR_PERIA_INTA239, IR_PERIA_INTA240, IR_PERIA_INTA241, IR_PERIA_INTA242,
    IR_PERIA_INTA243, IR_PERIA_INTA244, IR_PERIA_INTA245, IR_PERIA_INTA246, IR_PERIA_INTA247,
    IR_PERIA_INTA248, IR_PERIA_INTA249, IR_PERIA_INTA250, IR_PERIA_INTA251, IR_PERIA_INTA252,
    IR_PERIA_INTA253, IR_PERIA_INTA254, IR_PERIA_INTA255
} enum_ir_t;

typedef enum enum_dtce
{
    DTCE_ICU_SWINT2 = 26, DTCE_ICU_SWINT,
    DTCE_CMT0_CMI0,
    DTCE_CMT1_CMI1,
    DTCE_CMTW0_CMWI0,
    DTCE_CMTW1_CMWI1,
    DTCE_USB0_D0FIFO0 = 34, DTCE_USB0_D1FIFO0,
    DTCE_RSPI0_SPRI0 = 38, DTCE_RSPI0_SPTI0,
    DTCE_RSPI1_SPRI1, DTCE_RSPI1_SPTI1,
    DTCE_QSPI_SPRI, DTCE_QSPI_SPTI,
    DTCE_SDHI_SBFAI,
    DTCE_MMCIF_MBFAI,
    DTCE_SSIE0_SSITXI0, DTCE_SSIE0_SSIRXI0,
    DTCE_SSIE1_SSIRTI1,
    DTCE_RIIC1_RXI1 = 50, DTCE_RIIC1_TXI1,
    DTCE_RIIC0_RXI0, DTCE_RIIC0_TXI0,
    DTCE_RIIC2_RXI2, DTCE_RIIC2_TXI2,
    DTCE_SCI0_RXI0 = 58, DTCE_SCI0_TXI0,
    DTCE_SCI1_RXI1, DTCE_SCI1_TXI1,
    DTCE_SCI2_RXI2, DTCE_SCI2_TXI2,
    DTCE_ICU_IRQ0, DTCE_ICU_IRQ1, DTCE_ICU_IRQ2, DTCE_ICU_IRQ3, DTCE_ICU_IRQ4, DTCE_ICU_IRQ5, DTCE_ICU_IRQ6, DTCE_ICU_IRQ7,
    DTCE_ICU_IRQ8, DTCE_ICU_IRQ9, DTCE_ICU_IRQ10, DTCE_ICU_IRQ11, DTCE_ICU_IRQ12, DTCE_ICU_IRQ13, DTCE_ICU_IRQ14, DTCE_ICU_IRQ15,
    DTCE_SCI3_RXI3, DTCE_SCI3_TXI3,
    DTCE_SCI4_RXI4, DTCE_SCI4_TXI4,
    DTCE_SCI5_RXI5, DTCE_SCI5_TXI5,
    DTCE_SCI6_RXI6, DTCE_SCI6_TXI6,
    DTCE_PDC_PCDFI = 97,
    DTCE_SCI7_RXI7, DTCE_SCI7_TXI7,
    DTCE_SCI8_RXI8, DTCE_SCI8_TXI8,
    DTCE_SCI9_RXI9, DTCE_SCI9_TXI9,
    DTCE_SCI10_RXI10, DTCE_SCI10_TXI10,
    DTCE_RSPI2_SPRI2 = 108, DTCE_RSPI2_SPTI2,
    DTCE_SCI11_RXI11 = 114, DTCE_SCI11_TXI11,
    DTCE_SCI12_RXI12, DTCE_SCI12_TXI12,
    DTCE_DMAC_DMAC0I = 120, DTCE_DMAC_DMAC1I, DTCE_DMAC_DMAC2I, DTCE_DMAC_DMAC3I,
    DTCE_EXDMAC_EXDMAC0I = 126, DTCE_EXDMAC_EXDMAC1I,
    DTCE_PERIB_INTB128, DTCE_PERIB_INTB129, DTCE_PERIB_INTB130, DTCE_PERIB_INTB131, DTCE_PERIB_INTB132,
    DTCE_PERIB_INTB133, DTCE_PERIB_INTB134, DTCE_PERIB_INTB135, DTCE_PERIB_INTB136, DTCE_PERIB_INTB137,
    DTCE_PERIB_INTB138, DTCE_PERIB_INTB139, DTCE_PERIB_INTB140, DTCE_PERIB_INTB141, DTCE_PERIB_INTB142,
    DTCE_PERIB_INTB143, DTCE_PERIB_INTB144, DTCE_PERIB_INTB145, DTCE_PERIB_INTB146, DTCE_PERIB_INTB147,
    DTCE_PERIB_INTB148, DTCE_PERIB_INTB149, DTCE_PERIB_INTB150, DTCE_PERIB_INTB151, DTCE_PERIB_INTB152,
    DTCE_PERIB_INTB153, DTCE_PERIB_INTB154, DTCE_PERIB_INTB155, DTCE_PERIB_INTB156, DTCE_PERIB_INTB157,
    DTCE_PERIB_INTB158, DTCE_PERIB_INTB159, DTCE_PERIB_INTB160, DTCE_PERIB_INTB161, DTCE_PERIB_INTB162,
    DTCE_PERIB_INTB163, DTCE_PERIB_INTB164, DTCE_PERIB_INTB165, DTCE_PERIB_INTB166, DTCE_PERIB_INTB167,
    DTCE_PERIB_INTB168, DTCE_PERIB_INTB169, DTCE_PERIB_INTB170, DTCE_PERIB_INTB171, DTCE_PERIB_INTB172,
    DTCE_PERIB_INTB173, DTCE_PERIB_INTB174, DTCE_PERIB_INTB175, DTCE_PERIB_INTB176, DTCE_PERIB_INTB177,
    DTCE_PERIB_INTB178, DTCE_PERIB_INTB179, DTCE_PERIB_INTB180, DTCE_PERIB_INTB181, DTCE_PERIB_INTB182,
    DTCE_PERIB_INTB183, DTCE_PERIB_INTB184, DTCE_PERIB_INTB185, DTCE_PERIB_INTB186, DTCE_PERIB_INTB187,
    DTCE_PERIB_INTB188, DTCE_PERIB_INTB189, DTCE_PERIB_INTB190, DTCE_PERIB_INTB191, DTCE_PERIB_INTB192,
    DTCE_PERIB_INTB193, DTCE_PERIB_INTB194, DTCE_PERIB_INTB195, DTCE_PERIB_INTB196, DTCE_PERIB_INTB197,
    DTCE_PERIB_INTB198, DTCE_PERIB_INTB199, DTCE_PERIB_INTB200, DTCE_PERIB_INTB201, DTCE_PERIB_INTB202,
    DTCE_PERIB_INTB203, DTCE_PERIB_INTB204, DTCE_PERIB_INTB205, DTCE_PERIB_INTB206, DTCE_PERIB_INTB207,
    DTCE_PERIA_INTA208, DTCE_PERIA_INTA209, DTCE_PERIA_INTA210, DTCE_PERIA_INTA211, DTCE_PERIA_INTA212,
    DTCE_PERIA_INTA213, DTCE_PERIA_INTA214, DTCE_PERIA_INTA215, DTCE_PERIA_INTA216, DTCE_PERIA_INTA217,
    DTCE_PERIA_INTA218, DTCE_PERIA_INTA219, DTCE_PERIA_INTA220, DTCE_PERIA_INTA221, DTCE_PERIA_INTA222,
    DTCE_PERIA_INTA223, DTCE_PERIA_INTA224, DTCE_PERIA_INTA225, DTCE_PERIA_INTA226, DTCE_PERIA_INTA227,
    DTCE_PERIA_INTA228, DTCE_PERIA_INTA229, DTCE_PERIA_INTA230, DTCE_PERIA_INTA231, DTCE_PERIA_INTA232,
    DTCE_PERIA_INTA233, DTCE_PERIA_INTA234, DTCE_PERIA_INTA235, DTCE_PERIA_INTA236, DTCE_PERIA_INTA237,
    DTCE_PERIA_INTA238, DTCE_PERIA_INTA239, DTCE_PERIA_INTA240, DTCE_PERIA_INTA241, DTCE_PERIA_INTA242,
    DTCE_PERIA_INTA243, DTCE_PERIA_INTA244, DTCE_PERIA_INTA245, DTCE_PERIA_INTA246, DTCE_PERIA_INTA247,
    DTCE_PERIA_INTA248, DTCE_PERIA_INTA249, DTCE_PERIA_INTA250, DTCE_PERIA_INTA251, DTCE_PERIA_INTA252,
    DTCE_PERIA_INTA253, DTCE_PERIA_INTA254, DTCE_PERIA_INTA255
} enum_dtce_t;

