FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX700_RX72N_EnvisionKit_IAR_e2studio_EWRX/src/smc_gen/r_bsp/mcu/rx72n/register_access/iccrx/iodefine.h
typedef enum enum_ier
{
    IER_BSC_BUSERR = 0x02,
    IER_ICU_GROUPIE0 = 0x02,
    IER_RAM_RAMERR = 0x02,
    IER_FCU_FIFERR = 0x02, IER_FCU_FRDYI = 0x02,
    IER_ICU_SWINT2 = 0x03, IER_ICU_SWINT = 0x03,
    IER_CMT0_CMI0 = 0x03,
    IER_CMT1_CMI1 = 0x03,
    IER_CMTW0_CMWI0 = 0x03,
    IER_CMTW1_CMWI1 = 0x03,
    IER_USB0_D0FIFO0 = 0x04, IER_USB0_D1FIFO0 = 0x04,
    IER_RSPI0_SPRI0 = 0x04, IER_RSPI0_SPTI0 = 0x04,
    IER_RSPI1_SPRI1 = 0x05, IER_RSPI1_SPTI1 = 0x05,
    IER_QSPI_SPRI = 0x05, IER_QSPI_SPTI = 0x05,
    IER_SDHI_SBFAI = 0x05,
    IER_MMCIF_MBFAI = 0x05,
    IER_SSIE0_SSITXI0 = 0x05, IER_SSIE0_SSIRXI0 = 0x05,
    IER_SSIE1_SSIRTI1 = 0x06,
    IER_RIIC1_RXI1 = 0x06, IER_RIIC1_TXI1 = 0x06,
    IER_RIIC0_RXI0 = 0x06, IER_RIIC0_TXI0 = 0x06,
    IER_RIIC2_RXI2 = 0x06, IER_RIIC2_TXI2 = 0x06,
    IER_SCI0_RXI0 = 0x07, IER_SCI0_TXI0 = 0x07,
    IER_SCI1_RXI1 = 0x07, IER_SCI1_TXI1 = 0x07,
    IER_SCI2_RXI2 = 0x07, IER_SCI2_TXI2 = 0x07,
    IER_ICU_IRQ0 = 0x08, IER_ICU_IRQ1 = 0x08, IER_ICU_IRQ2 = 0x08, IER_ICU_IRQ3 = 0x08, IER_ICU_IRQ4 = 0x08, IER_ICU_IRQ5 = 0x08, IER_ICU_IRQ6 = 0x08, IER_ICU_IRQ7 = 0x08,
    IER_ICU_IRQ8 = 0x09, IER_ICU_IRQ9 = 0x09, IER_ICU_IRQ10 = 0x09, IER_ICU_IRQ11 = 0x09, IER_ICU_IRQ12 = 0x09, IER_ICU_IRQ13 = 0x09, IER_ICU_IRQ14 = 0x09, IER_ICU_IRQ15 = 0x09,
    IER_SCI3_RXI3 = 0x0A, IER_SCI3_TXI3 = 0x0A,
    IER_SCI4_RXI4 = 0x0A, IER_SCI4_TXI4 = 0x0A,
    IER_SCI5_RXI5 = 0x0A, IER_SCI5_TXI5 = 0x0A,
    IER_SCI6_RXI6 = 0x0A, IER_SCI6_TXI6 = 0x0A,
    IER_LVD1_LVD1 = 0x0B,
    IER_LVD2_LVD2 = 0x0B,
    IER_USB0_USBR0 = 0x0B,
    IER_RTC_ALM = 0x0B, IER_RTC_PRD = 0x0B,
    IER_IWDT_IWUNI = 0x0B,
    IER_WDT_WUNI = 0x0C,
    IER_PDC_PCDFI = 0x0C,
    IER_SCI7_RXI7 = 0x0C, IER_SCI7_TXI7 = 0x0C,
    IER_SCI8_RXI8 = 0x0C, IER_SCI8_TXI8 = 0x0C,
    IER_SCI9_RXI9 = 0x0C, IER_SCI9_TXI9 = 0x0C,
    IER_SCI10_RXI10 = 0x0D, IER_SCI10_TXI10 = 0x0D,
    IER_ICU_GROUPBE0 = 0x0D, IER_ICU_GROUPBL2 = 0x0D,
    IER_RSPI2_SPRI2 = 0x0D, IER_RSPI2_SPTI2 = 0x0D,
    IER_ICU_GROUPBL0 = 0x0D, IER_ICU_GROUPBL1 = 0x0D, IER_ICU_GROUPAL0 = 0x0E, IER_ICU_GROUPAL1 = 0x0E,
    IER_SCI11_RXI11 = 0x0E, IER_SCI11_TXI11 = 0x0E,
    IER_SCI12_RXI12 = 0x0E, IER_SCI12_TXI12 = 0x0E,
    IER_DMAC_DMAC0I = 0x0F, IER_DMAC_DMAC1I = 0x0F, IER_DMAC_DMAC2I = 0x0F, IER_DMAC_DMAC3I = 0x0F, IER_DMAC_DMAC74I = 0x0F,
    IER_OST_OSTDI = 0x0F,
    IER_EXDMAC_EXDMAC0I = 0x0F, IER_EXDMAC_EXDMAC1I = 0x0F,
    IER_PERIB_INTB128 = 0x10, IER_PERIB_INTB129 = 0x10, IER_PERIB_INTB130 = 0x10, IER_PERIB_INTB131 = 0x10, IER_PERIB_INTB132 = 0x10,
    IER_PERIB_INTB133 = 0x10, IER_PERIB_INTB134 = 0x10, IER_PERIB_INTB135 = 0x10, IER_PERIB_INTB136 = 0x11, IER_PERIB_INTB137 = 0x11,
    IER_PERIB_INTB138 = 0x11, IER_PERIB_INTB139 = 0x11, IER_PERIB_INTB140 = 0x11, IER_PERIB_INTB141 = 0x11, IER_PERIB_INTB142 = 0x11,
    IER_PERIB_INTB143 = 0x11, IER_PERIB_INTB144 = 0x12, IER_PERIB_INTB145 = 0x12, IER_PERIB_INTB146 = 0x12, IER_PERIB_INTB147 = 0x12,
    IER_PERIB_INTB148 = 0x12, IER_PERIB_INTB149 = 0x12, IER_PERIB_INTB150 = 0x12, IER_PERIB_INTB151 = 0x12, IER_PERIB_INTB152 = 0x13,
    IER_PERIB_INTB153 = 0x13, IER_PERIB_INTB154 = 0x13, IER_PERIB_INTB155 = 0x13, IER_PERIB_INTB156 = 0x13, IER_PERIB_INTB157 = 0x13,
    IER_PERIB_INTB158 = 0x13, IER_PERIB_INTB159 = 0x13, IER_PERIB_INTB160 = 0x14, IER_PERIB_INTB161 = 0x14, IER_PERIB_INTB162 = 0x14,
    IER_PERIB_INTB163 = 0x14, IER_PERIB_INTB164 = 0x14, IER_PERIB_INTB165 = 0x14, IER_PERIB_INTB166 = 0x14, IER_PERIB_INTB167 = 0x14,
    IER_PERIB_INTB168 = 0x15, IER_PERIB_INTB169 = 0x15, IER_PERIB_INTB170 = 0x15, IER_PERIB_INTB171 = 0x15, IER_PERIB_INTB172 = 0x15,
    IER_PERIB_INTB173 = 0x15, IER_PERIB_INTB174 = 0x15, IER_PERIB_INTB175 = 0x15, IER_PERIB_INTB176 = 0x16, IER_PERIB_INTB177 = 0x16,
    IER_PERIB_INTB178 = 0x16, IER_PERIB_INTB179 = 0x16, IER_PERIB_INTB180 = 0x16, IER_PERIB_INTB181 = 0x16, IER_PERIB_INTB182 = 0x16,
    IER_PERIB_INTB183 = 0x16, IER_PERIB_INTB184 = 0x17, IER_PERIB_INTB185 = 0x17, IER_PERIB_INTB186 = 0x17, IER_PERIB_INTB187 = 0x17,
    IER_PERIB_INTB188 = 0x17, IER_PERIB_INTB189 = 0x17, IER_PERIB_INTB190 = 0x17, IER_PERIB_INTB191 = 0x17, IER_PERIB_INTB192 = 0x18,
    IER_PERIB_INTB193 = 0x18, IER_PERIB_INTB194 = 0x18, IER_PERIB_INTB195 = 0x18, IER_PERIB_INTB196 = 0x18, IER_PERIB_INTB197 = 0x18,
    IER_PERIB_INTB198 = 0x18, IER_PERIB_INTB199 = 0x18, IER_PERIB_INTB200 = 0x19, IER_PERIB_INTB201 = 0x19, IER_PERIB_INTB202 = 0x19,
    IER_PERIB_INTB203 = 0x19, IER_PERIB_INTB204 = 0x19, IER_PERIB_INTB205 = 0x19, IER_PERIB_INTB206 = 0x19, IER_PERIB_INTB207 = 0x19,
    IER_PERIA_INTA208 = 0x1A, IER_PERIA_INTA209 = 0x1A, IER_PERIA_INTA210 = 0x1A, IER_PERIA_INTA211 = 0x1A, IER_PERIA_INTA212 = 0x1A,
    IER_PERIA_INTA213 = 0x1A, IER_PERIA_INTA214 = 0x1A, IER_PERIA_INTA215 = 0x1A, IER_PERIA_INTA216 = 0x1B, IER_PERIA_INTA217 = 0x1B,
    IER_PERIA_INTA218 = 0x1B, IER_PERIA_INTA219 = 0x1B, IER_PERIA_INTA220 = 0x1B, IER_PERIA_INTA221 = 0x1B, IER_PERIA_INTA222 = 0x1B,
    IER_PERIA_INTA223 = 0x1B, IER_PERIA_INTA224 = 0x1C, IER_PERIA_INTA225 = 0x1C, IER_PERIA_INTA226 = 0x1C, IER_PERIA_INTA227 = 0x1C,
    IER_PERIA_INTA228 = 0x1C, IER_PERIA_INTA229 = 0x1C, IER_PERIA_INTA230 = 0x1C, IER_PERIA_INTA231 = 0x1C, IER_PERIA_INTA232 = 0x1D,
    IER_PERIA_INTA233 = 0x1D, IER_PERIA_INTA234 = 0x1D, IER_PERIA_INTA235 = 0x1D, IER_PERIA_INTA236 = 0x1D, IER_PERIA_INTA237 = 0x1D,
    IER_PERIA_INTA238 = 0x1D, IER_PERIA_INTA239 = 0x1D, IER_PERIA_INTA240 = 0x1E, IER_PERIA_INTA241 = 0x1E, IER_PERIA_INTA242 = 0x1E,
    IER_PERIA_INTA243 = 0x1E, IER_PERIA_INTA244 = 0x1E, IER_PERIA_INTA245 = 0x1E, IER_PERIA_INTA246 = 0x1E, IER_PERIA_INTA247 = 0x1E,
    IER_PERIA_INTA248 = 0x1F, IER_PERIA_INTA249 = 0x1F, IER_PERIA_INTA250 = 0x1F, IER_PERIA_INTA251 = 0x1F, IER_PERIA_INTA252 = 0x1F,
    IER_PERIA_INTA253 = 0x1F, IER_PERIA_INTA254 = 0x1F, IER_PERIA_INTA255 = 0x1F
} enum_ier_t;

typedef enum enum_ipr
{
    IPR_BSC_BUSERR = 0,
    IPR_ICU_GROUPIE0 = 0,
    IPR_RAM_RAMERR = 0,
    IPR_FCU_FIFERR = 1, IPR_FCU_FRDYI = 2,
    IPR_ICU_SWINT2 = 3, IPR_ICU_SWINT = 3,
    IPR_CMT0_CMI0 = 4,
    IPR_CMT1_CMI1 = 5,
    IPR_CMTW0_CMWI0 = 6,
    IPR_CMTW1_CMWI1 = 7,
    IPR_USB0_D0FIFO0 = 34, IPR_USB0_D1FIFO0 = 35,
    IPR_RSPI0_SPRI0 = 38, IPR_RSPI0_SPTI0 = 39,
    IPR_RSPI1_SPRI1 = 40, IPR_RSPI1_SPTI1 = 41,
    IPR_QSPI_SPRI = 42, IPR_QSPI_SPTI = 43,
    IPR_SDHI_SBFAI = 44,
    IPR_MMCIF_MBFAI = 45,
    IPR_SSIE0_SSITXI0 = 46, IPR_SSIE0_SSIRXI0 = 47,
    IPR_SSIE1_SSIRTI1 = 48,
    IPR_RIIC1_RXI1 = 50, IPR_RIIC1_TXI1 = 51,
    IPR_RIIC0_RXI0 = 52, IPR_RIIC0_TXI0 = 53,
    IPR_RIIC2_RXI2 = 54, IPR_RIIC2_TXI2 = 55,
    IPR_SCI0_RXI0 = 58, IPR_SCI0_TXI0 = 59,
    IPR_SCI1_RXI1 = 60, IPR_SCI1_TXI1 = 61,
    IPR_SCI2_RXI2 = 62, IPR_SCI2_TXI2 = 63,
    IPR_ICU_IRQ0 = 64, IPR_ICU_IRQ1 = 65, IPR_ICU_IRQ2 = 66, IPR_ICU_IRQ3 = 67, IPR_ICU_IRQ4 = 68, IPR_ICU_IRQ5 = 69, IPR_ICU_IRQ6 = 70, IPR_ICU_IRQ7 = 71,
    IPR_ICU_IRQ8 = 72, IPR_ICU_IRQ9 = 73, IPR_ICU_IRQ10 = 74, IPR_ICU_IRQ11 = 75, IPR_ICU_IRQ12 = 76, IPR_ICU_IRQ13 = 77, IPR_ICU_IRQ14 = 78, IPR_ICU_IRQ15 = 79,
    IPR_SCI3_RXI3 = 80, IPR_SCI3_TXI3 = 81,
    IPR_SCI4_RXI4 = 82, IPR_SCI4_TXI4 = 83,
    IPR_SCI5_RXI5 = 84, IPR_SCI5_TXI5 = 85,
    IPR_SCI6_RXI6 = 86, IPR_SCI6_TXI6 = 87,
    IPR_LVD1_LVD1 = 88,
    IPR_LVD2_LVD2 = 89,
    IPR_USB0_USBR0 = 90,
    IPR_RTC_ALM = 92, IPR_RTC_PRD = 93,
    IPR_IWDT_IWUNI = 95,
    IPR_WDT_WUNI = 96,
    IPR_PDC_PCDFI = 97,
    IPR_SCI7_RXI7 = 98, IPR_SCI7_TXI7 = 99,
    IPR_SCI8_RXI8 = 100, IPR_SCI8_TXI8 = 101,
    IPR_SCI9_RXI9 = 102, IPR_SCI9_TXI9 = 103,
    IPR_SCI10_RXI10 = 104, IPR_SCI10_TXI10 = 105,
    IPR_ICU_GROUPBE0 = 106, IPR_ICU_GROUPBL2 = 107,
    IPR_RSPI2_SPRI2 = 108, IPR_RSPI2_SPTI2 = 109,
    IPR_ICU_GROUPBL0 = 110, IPR_ICU_GROUPBL1 = 111, IPR_ICU_GROUPAL0 = 112, IPR_ICU_GROUPAL1 = 113,
    IPR_SCI11_RXI11 = 114, IPR_SCI11_TXI11 = 115,
    IPR_SCI12_RXI12 = 116, IPR_SCI12_TXI12 = 117,
    IPR_DMAC_DMAC0I = 120, IPR_DMAC_DMAC1I = 121, IPR_DMAC_DMAC2I = 122, IPR_DMAC_DMAC3I = 123, IPR_DMAC_DMAC74I = 124,
    IPR_OST_OSTDI = 125,
    IPR_EXDMAC_EXDMAC0I = 126, IPR_EXDMAC_EXDMAC1I = 127,
    IPR_PERIB_INTB128 = 128, IPR_PERIB_INTB129 = 129, IPR_PERIB_INTB130 = 130, IPR_PERIB_INTB131 = 131, IPR_PERIB_INTB132 = 132,
    IPR_PERIB_INTB133 = 133, IPR_PERIB_INTB134 = 134, IPR_PERIB_INTB135 = 135, IPR_PERIB_INTB136 = 136, IPR_PERIB_INTB137 = 137,
    IPR_PERIB_INTB138 = 138, IPR_PERIB_INTB139 = 139, IPR_PERIB_INTB140 = 140, IPR_PERIB_INTB141 = 141, IPR_PERIB_INTB142 = 142,
    IPR_PERIB_INTB143 = 143, IPR_PERIB_INTB144 = 144, IPR_PERIB_INTB145 = 145, IPR_PERIB_INTB146 = 146, IPR_PERIB_INTB147 = 147,
    IPR_PERIB_INTB148 = 148, IPR_PERIB_INTB149 = 149, IPR_PERIB_INTB150 = 150, IPR_PERIB_INTB151 = 151, IPR_PERIB_INTB152 = 152,
    IPR_PERIB_INTB153 = 153, IPR_PERIB_INTB154 = 154, IPR_PERIB_INTB155 = 155, IPR_PERIB_INTB156 = 156, IPR_PERIB_INTB157 = 157,
    IPR_PERIB_INTB158 = 158, IPR_PERIB_INTB159 = 159, IPR_PERIB_INTB160 = 160, IPR_PERIB_INTB161 = 161, IPR_PERIB_INTB162 = 162,
    IPR_PERIB_INTB163 = 163, IPR_PERIB_INTB164 = 164, IPR_PERIB_INTB165 = 165, IPR_PERIB_INTB166 = 166, IPR_PERIB_INTB167 = 167,
    IPR_PERIB_INTB168 = 168, IPR_PERIB_INTB169 = 169, IPR_PERIB_INTB170 = 170, IPR_PERIB_INTB171 = 171, IPR_PERIB_INTB172 = 172,
    IPR_PERIB_INTB173 = 173, IPR_PERIB_INTB174 = 174, IPR_PERIB_INTB175 = 175, IPR_PERIB_INTB176 = 176, IPR_PERIB_INTB177 = 177,
    IPR_PERIB_INTB178 = 178, IPR_PERIB_INTB179 = 179, IPR_PERIB_INTB180 = 180, IPR_PERIB_INTB181 = 181, IPR_PERIB_INTB182 = 182,
    IPR_PERIB_INTB183 = 183, IPR_PERIB_INTB184 = 184, IPR_PERIB_INTB185 = 185, IPR_PERIB_INTB186 = 186, IPR_PERIB_INTB187 = 187,
    IPR_PERIB_INTB188 = 188, IPR_PERIB_INTB189 = 189, IPR_PERIB_INTB190 = 190, IPR_PERIB_INTB191 = 191, IPR_PERIB_INTB192 = 192,
    IPR_PERIB_INTB193 = 193, IPR_PERIB_INTB194 = 194, IPR_PERIB_INTB195 = 195, IPR_PERIB_INTB196 = 196, IPR_PERIB_INTB197 = 197,
    IPR_PERIB_INTB198 = 198, IPR_PERIB_INTB199 = 199, IPR_PERIB_INTB200 = 200, IPR_PERIB_INTB201 = 201, IPR_PERIB_INTB202 = 202,
    IPR_PERIB_INTB203 = 203, IPR_PERIB_INTB204 = 204, IPR_PERIB_INTB205 = 205, IPR_PERIB_INTB206 = 206, IPR_PERIB_INTB207 = 207,
    IPR_PERIA_INTA208 = 208, IPR_PERIA_INTA209 = 209, IPR_PERIA_INTA210 = 210, IPR_PERIA_INTA211 = 211, IPR_PERIA_INTA212 = 212,
    IPR_PERIA_INTA213 = 213, IPR_PERIA_INTA214 = 214, IPR_PERIA_INTA215 = 215, IPR_PERIA_INTA216 = 216, IPR_PERIA_INTA217 = 217,
    IPR_PERIA_INTA218 = 218, IPR_PERIA_INTA219 = 219, IPR_PERIA_INTA220 = 220, IPR_PERIA_INTA221 = 221, IPR_PERIA_INTA222 = 222,
    IPR_PERIA_INTA223 = 223, IPR_PERIA_INTA224 = 224, IPR_PERIA_INTA225 = 225, IPR_PERIA_INTA226 = 226, IPR_PERIA_INTA227 = 227,
    IPR_PERIA_INTA228 = 228, IPR_PERIA_INTA229 = 229, IPR_PERIA_INTA230 = 230, IPR_PERIA_INTA231 = 231, IPR_PERIA_INTA232 = 232,
    IPR_PERIA_INTA233 = 233, IPR_PERIA_INTA234 = 234, IPR_PERIA_INTA235 = 235, IPR_PERIA_INTA236 = 236, IPR_PERIA_INTA237 = 237,
    IPR_PERIA_INTA238 = 238, IPR_PERIA_INTA239 = 239, IPR_PERIA_INTA240 = 240, IPR_PERIA_INTA241 = 241, IPR_PERIA_INTA242 = 242,
    IPR_PERIA_INTA243 = 243, IPR_PERIA_INTA244 = 244, IPR_PERIA_INTA245 = 245, IPR_PERIA_INTA246 = 246, IPR_PERIA_INTA247 = 247,
    IPR_PERIA_INTA248 = 248, IPR_PERIA_INTA249 = 249, IPR_PERIA_INTA250 = 250, IPR_PERIA_INTA251 = 251, IPR_PERIA_INTA252 = 252,
    IPR_PERIA_INTA253 = 253, IPR_PERIA_INTA254 = 254, IPR_PERIA_INTA255 = 255,
    IPR_ICU_SWI = 3,
    IPR_CMT0_ = 4,
    IPR_CMT1_ = 5,
    IPR_CMTW0_ = 6,
    IPR_CMTW1_ = 7,
    IPR_SDHI_ = 44,
    IPR_MMCIF_ = 45,
    IPR_SSIE1_ = 48,
    IPR_LVD1_ = 88,
    IPR_LVD2_ = 89,
    IPR_IWDT_ = 95,
    IPR_WDT_ = 96,
    IPR_PDC_ = 97,
    IPR_OST_ = 125
} enum_ipr_t;

