FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX700_RX72N_EnvisionKit_IAR_e2studio_EWRX/src/smc_gen/r_bsp/mcu/rx72n/register_access/iccrx/iodefine.h
#ifdef __IAR_SYSTEMS_ICC__
    #pragma bitfields=reversed
#else
    #pragma bit_order left
#endif

#ifndef __IAR_SYSTEMS_ICC__
    #pragma unpack
#endif


typedef struct st_bsc
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char STSCLR : 1;
        } BIT;
    } BERCLR;
    char wk0[ 3 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 6;
            unsigned char TOEN : 1;
            unsigned char IGAEN : 1;
        } BIT;
    } BEREN;
    char wk1[ 3 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char MST : 3;
            unsigned char : 2;
            unsigned char TO : 1;
            unsigned char IA : 1;
        } BIT;
    } BERSR1;
    char wk2[ 1 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short ADDR : 13;
            unsigned short : 3;
        } BIT;
    } BERSR2;
    char wk3[ 4 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 2;
            unsigned short BPEB : 2;
            unsigned short BPFB : 2;
            unsigned short BPHB : 2;
            unsigned short BPGB : 2;
            unsigned short BPIB : 2;
            unsigned short BPRO : 2;
            unsigned short BPRA : 2;
        } BIT;
    } BUSPRI;
    char wk4[ 7408 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short PRMOD : 1;
            unsigned short : 5;
            unsigned short PWENB : 1;
            unsigned short PRENB : 1;
            unsigned short : 4;
            unsigned short EWENB : 1;
            unsigned short : 2;
            unsigned short WRMOD : 1;
        } BIT;
    } CS0MOD;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 3;
            unsigned long CSRWAIT : 5;
            unsigned long : 3;
            unsigned long CSWWAIT : 5;
            unsigned long : 5;
            unsigned long CSPRWAIT : 3;
            unsigned long : 5;
            unsigned long CSPWWAIT : 3;
        } BIT;
    } CS0WCR1;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 1;
            unsigned long CSON : 3;
            unsigned long : 1;
            unsigned long WDON : 3;
            unsigned long : 1;
            unsigned long WRON : 3;
            unsigned long : 1;
            unsigned long RDON : 3;
            unsigned long : 2;
            unsigned long AWAIT : 2;
            unsigned long : 1;
            unsigned long WDOFF : 3;
            unsigned long : 1;
            unsigned long CSWOFF : 3;
            unsigned long : 1;
            unsigned long CSROFF : 3;
        } BIT;
    } CS0WCR2;
    char wk5[ 6 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short PRMOD : 1;
            unsigned short : 5;
            unsigned short PWENB : 1;
            unsigned short PRENB : 1;
            unsigned short : 4;
            unsigned short EWENB : 1;
            unsigned short : 2;
            unsigned short WRMOD : 1;
        } BIT;
    } CS1MOD;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 3;
            unsigned long CSRWAIT : 5;
            unsigned long : 3;
            unsigned long CSWWAIT : 5;
            unsigned long : 5;
            unsigned long CSPRWAIT : 3;
            unsigned long : 5;
            unsigned long CSPWWAIT : 3;
        } BIT;
    } CS1WCR1;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 1;
            unsigned long CSON : 3;
            unsigned long : 1;
            unsigned long WDON : 3;
            unsigned long : 1;
            unsigned long WRON : 3;
            unsigned long : 1;
            unsigned long RDON : 3;
            unsigned long : 2;
            unsigned long AWAIT : 2;
            unsigned long : 1;
            unsigned long WDOFF : 3;
            unsigned long : 1;
            unsigned long CSWOFF : 3;
            unsigned long : 1;
            unsigned long CSROFF : 3;
        } BIT;
    } CS1WCR2;
    char wk6[ 6 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short PRMOD : 1;
            unsigned short : 5;
            unsigned short PWENB : 1;
            unsigned short PRENB : 1;
            unsigned short : 4;
            unsigned short EWENB : 1;
            unsigned short : 2;
            unsigned short WRMOD : 1;
        } BIT;
    } CS2MOD;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 3;
            unsigned long CSRWAIT : 5;
            unsigned long : 3;
            unsigned long CSWWAIT : 5;
            unsigned long : 5;
            unsigned long CSPRWAIT : 3;
            unsigned long : 5;
            unsigned long CSPWWAIT : 3;
        } BIT;
    } CS2WCR1;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 1;
            unsigned long CSON : 3;
            unsigned long : 1;
            unsigned long WDON : 3;
            unsigned long : 1;
            unsigned long WRON : 3;
            unsigned long : 1;
            unsigned long RDON : 3;
            unsigned long : 2;
            unsigned long AWAIT : 2;
            unsigned long : 1;
            unsigned long WDOFF : 3;
            unsigned long : 1;
            unsigned long CSWOFF : 3;
            unsigned long : 1;
            unsigned long CSROFF : 3;
        } BIT;
    } CS2WCR2;
    char wk7[ 6 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short PRMOD : 1;
            unsigned short : 5;
            unsigned short PWENB : 1;
            unsigned short PRENB : 1;
            unsigned short : 4;
            unsigned short EWENB : 1;
            unsigned short : 2;
            unsigned short WRMOD : 1;
        } BIT;
    } CS3MOD;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 3;
            unsigned long CSRWAIT : 5;
            unsigned long : 3;
            unsigned long CSWWAIT : 5;
            unsigned long : 5;
            unsigned long CSPRWAIT : 3;
            unsigned long : 5;
            unsigned long CSPWWAIT : 3;
        } BIT;
    } CS3WCR1;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 1;
            unsigned long CSON : 3;
            unsigned long : 1;
            unsigned long WDON : 3;
            unsigned long : 1;
            unsigned long WRON : 3;
            unsigned long : 1;
            unsigned long RDON : 3;
            unsigned long : 2;
            unsigned long AWAIT : 2;
            unsigned long : 1;
            unsigned long WDOFF : 3;
            unsigned long : 1;
            unsigned long CSWOFF : 3;
            unsigned long : 1;
            unsigned long CSROFF : 3;
        } BIT;
    } CS3WCR2;
    char wk8[ 6 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short PRMOD : 1;
            unsigned short : 5;
            unsigned short PWENB : 1;
            unsigned short PRENB : 1;
            unsigned short : 4;
            unsigned short EWENB : 1;
            unsigned short : 2;
            unsigned short WRMOD : 1;
        } BIT;
    } CS4MOD;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 3;
            unsigned long CSRWAIT : 5;
            unsigned long : 3;
            unsigned long CSWWAIT : 5;
            unsigned long : 5;
            unsigned long CSPRWAIT : 3;
            unsigned long : 5;
            unsigned long CSPWWAIT : 3;
        } BIT;
    } CS4WCR1;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 1;
            unsigned long CSON : 3;
            unsigned long : 1;
            unsigned long WDON : 3;
            unsigned long : 1;
            unsigned long WRON : 3;
            unsigned long : 1;
            unsigned long RDON : 3;
            unsigned long : 2;
            unsigned long AWAIT : 2;
            unsigned long : 1;
            unsigned long WDOFF : 3;
            unsigned long : 1;
            unsigned long CSWOFF : 3;
            unsigned long : 1;
            unsigned long CSROFF : 3;
        } BIT;
    } CS4WCR2;
    char wk9[ 6 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short PRMOD : 1;
            unsigned short : 5;
            unsigned short PWENB : 1;
            unsigned short PRENB : 1;
            unsigned short : 4;
            unsigned short EWENB : 1;
            unsigned short : 2;
            unsigned short WRMOD : 1;
        } BIT;
    } CS5MOD;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 3;
            unsigned long CSRWAIT : 5;
            unsigned long : 3;
            unsigned long CSWWAIT : 5;
            unsigned long : 5;
            unsigned long CSPRWAIT : 3;
            unsigned long : 5;
            unsigned long CSPWWAIT : 3;
        } BIT;
    } CS5WCR1;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 1;
            unsigned long CSON : 3;
            unsigned long : 1;
            unsigned long WDON : 3;
            unsigned long : 1;
            unsigned long WRON : 3;
            unsigned long : 1;
            unsigned long RDON : 3;
            unsigned long : 2;
            unsigned long AWAIT : 2;
            unsigned long : 1;
            unsigned long WDOFF : 3;
            unsigned long : 1;
            unsigned long CSWOFF : 3;
            unsigned long : 1;
            unsigned long CSROFF : 3;
        } BIT;
    } CS5WCR2;
    char wk10[ 6 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short PRMOD : 1;
            unsigned short : 5;
            unsigned short PWENB : 1;
            unsigned short PRENB : 1;
            unsigned short : 4;
            unsigned short EWENB : 1;
            unsigned short : 2;
            unsigned short WRMOD : 1;
        } BIT;
    } CS6MOD;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 3;
            unsigned long CSRWAIT : 5;
            unsigned long : 3;
            unsigned long CSWWAIT : 5;
            unsigned long : 5;
            unsigned long CSPRWAIT : 3;
            unsigned long : 5;
            unsigned long CSPWWAIT : 3;
        } BIT;
    } CS6WCR1;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 1;
            unsigned long CSON : 3;
            unsigned long : 1;
            unsigned long WDON : 3;
            unsigned long : 1;
            unsigned long WRON : 3;
            unsigned long : 1;
            unsigned long RDON : 3;
            unsigned long : 2;
            unsigned long AWAIT : 2;
            unsigned long : 1;
            unsigned long WDOFF : 3;
            unsigned long : 1;
            unsigned long CSWOFF : 3;
            unsigned long : 1;
            unsigned long CSROFF : 3;
        } BIT;
    } CS6WCR2;
    char wk11[ 6 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short PRMOD : 1;
            unsigned short : 5;
            unsigned short PWENB : 1;
            unsigned short PRENB : 1;
            unsigned short : 4;
            unsigned short EWENB : 1;
            unsigned short : 2;
            unsigned short WRMOD : 1;
        } BIT;
    } CS7MOD;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 3;
            unsigned long CSRWAIT : 5;
            unsigned long : 3;
            unsigned long CSWWAIT : 5;
            unsigned long : 5;
            unsigned long CSPRWAIT : 3;
            unsigned long : 5;
            unsigned long CSPWWAIT : 3;
        } BIT;
    } CS7WCR1;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 1;
            unsigned long CSON : 3;
            unsigned long : 1;
            unsigned long WDON : 3;
            unsigned long : 1;
            unsigned long WRON : 3;
            unsigned long : 1;
            unsigned long RDON : 3;
            unsigned long : 2;
            unsigned long AWAIT : 2;
            unsigned long : 1;
            unsigned long WDOFF : 3;
            unsigned long : 1;
            unsigned long CSWOFF : 3;
            unsigned long : 1;
            unsigned long CSROFF : 3;
        } BIT;
    } CS7WCR2;
    char wk12[ 1926 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 3;
            unsigned short MPXEN : 1;
            unsigned short : 3;
            unsigned short EMODE : 1;
            unsigned short : 2;
            unsigned short BSIZE : 2;
            unsigned short : 3;
            unsigned short EXENB : 1;
        } BIT;
    } CS0CR;
    char wk13[ 6 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 4;
            unsigned short WRCV : 4;
            unsigned short : 4;
            unsigned short RRCV : 4;
        } BIT;
    } CS0REC;
    char wk14[ 6 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 3;
            unsigned short MPXEN : 1;
            unsigned short : 3;
            unsigned short EMODE : 1;
            unsigned short : 2;
            unsigned short BSIZE : 2;
            unsigned short : 3;
            unsigned short EXENB : 1;
        } BIT;
    } CS1CR;
    char wk15[ 6 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 4;
            unsigned short WRCV : 4;
            unsigned short : 4;
            unsigned short RRCV : 4;
        } BIT;
    } CS1REC;
    char wk16[ 6 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 3;
            unsigned short MPXEN : 1;
            unsigned short : 3;
            unsigned short EMODE : 1;
            unsigned short : 2;
            unsigned short BSIZE : 2;
            unsigned short : 3;
            unsigned short EXENB : 1;
        } BIT;
    } CS2CR;
    char wk17[ 6 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 4;
            unsigned short WRCV : 4;
            unsigned short : 4;
            unsigned short RRCV : 4;
        } BIT;
    } CS2REC;
    char wk18[ 6 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 3;
            unsigned short MPXEN : 1;
            unsigned short : 3;
            unsigned short EMODE : 1;
            unsigned short : 2;
            unsigned short BSIZE : 2;
            unsigned short : 3;
            unsigned short EXENB : 1;
        } BIT;
    } CS3CR;
    char wk19[ 6 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 4;
            unsigned short WRCV : 4;
            unsigned short : 4;
            unsigned short RRCV : 4;
        } BIT;
    } CS3REC;
    char wk20[ 6 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 3;
            unsigned short MPXEN : 1;
            unsigned short : 3;
            unsigned short EMODE : 1;
            unsigned short : 2;
            unsigned short BSIZE : 2;
            unsigned short : 3;
            unsigned short EXENB : 1;
        } BIT;
    } CS4CR;
    char wk21[ 6 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 4;
            unsigned short WRCV : 4;
            unsigned short : 4;
            unsigned short RRCV : 4;
        } BIT;
    } CS4REC;
    char wk22[ 6 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 3;
            unsigned short MPXEN : 1;
            unsigned short : 3;
            unsigned short EMODE : 1;
            unsigned short : 2;
            unsigned short BSIZE : 2;
            unsigned short : 3;
            unsigned short EXENB : 1;
        } BIT;
    } CS5CR;
    char wk23[ 6 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 4;
            unsigned short WRCV : 4;
            unsigned short : 4;
            unsigned short RRCV : 4;
        } BIT;
    } CS5REC;
    char wk24[ 6 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 3;
            unsigned short MPXEN : 1;
            unsigned short : 3;
            unsigned short EMODE : 1;
            unsigned short : 2;
            unsigned short BSIZE : 2;
            unsigned short : 3;
            unsigned short EXENB : 1;
        } BIT;
    } CS6CR;
    char wk25[ 6 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 4;
            unsigned short WRCV : 4;
            unsigned short : 4;
            unsigned short RRCV : 4;
        } BIT;
    } CS6REC;
    char wk26[ 6 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 3;
            unsigned short MPXEN : 1;
            unsigned short : 3;
            unsigned short EMODE : 1;
            unsigned short : 2;
            unsigned short BSIZE : 2;
            unsigned short : 3;
            unsigned short EXENB : 1;
        } BIT;
    } CS7CR;
    char wk27[ 6 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 4;
            unsigned short WRCV : 4;
            unsigned short : 4;
            unsigned short RRCV : 4;
        } BIT;
    } CS7REC;
    char wk28[ 4 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short RCVENM7 : 1;
            unsigned short RCVENM6 : 1;
            unsigned short RCVENM5 : 1;
            unsigned short RCVENM4 : 1;
            unsigned short RCVENM3 : 1;
            unsigned short RCVENM2 : 1;
            unsigned short RCVENM1 : 1;
            unsigned short RCVENM0 : 1;
            unsigned short RCVEN7 : 1;
            unsigned short RCVEN6 : 1;
            unsigned short RCVEN5 : 1;
            unsigned short RCVEN4 : 1;
            unsigned short RCVEN3 : 1;
            unsigned short RCVEN2 : 1;
            unsigned short RCVEN1 : 1;
            unsigned short RCVEN0 : 1;
        } BIT;
    } CSRECEN;
    char wk29[ 894 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char BSIZE : 2;
            unsigned char : 3;
            unsigned char EXENB : 1;
        } BIT;
    } SDCCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char EMODE : 1;
        } BIT;
    } SDCMOD;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char BE : 1;
        } BIT;
    } SDAMOD;
    char wk30[ 13 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char SFEN : 1;
        } BIT;
    } SDSELF;
    char wk31[ 3 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short REFW : 4;
            unsigned short RFC : 12;
        } BIT;
    } SDRFCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char RFEN : 1;
        } BIT;
    } SDRFEN;
    char wk32[ 9 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char INIRQ : 1;
        } BIT;
    } SDICR;
    char wk33[ 3 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 5;
            unsigned short PRC : 3;
            unsigned short ARFC : 4;
            unsigned short ARFI : 4;
        } BIT;
    } SDIR;
    char wk34[ 26 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 6;
            unsigned char MXC : 2;
        } BIT;
    } SDADR;
    char wk35[ 3 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 13;
            unsigned long RAS : 3;
            unsigned long : 2;
            unsigned long RCD : 2;
            unsigned long RP : 3;
            unsigned long WR : 1;
            unsigned long : 5;
            unsigned long CL : 3;
        } BIT;
    } SDTR;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 1;
            unsigned short MR : 15;
        } BIT;
    } SDMOD;
    char wk36[ 6 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char SRFST : 1;
            unsigned char INIST : 1;
            unsigned char : 2;
            unsigned char MRSST : 1;
        } BIT;
    } SDSR;
    char wk37[ 269231 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long PRERR : 1;
            unsigned long : 12;
            unsigned long PR5SEL : 3;
            unsigned long : 1;
            unsigned long PR4SEL : 3;
            unsigned long : 1;
            unsigned long PR3SEL : 3;
            unsigned long : 1;
            unsigned long PR2SEL : 3;
            unsigned long : 1;
            unsigned long PR1SEL : 3;
        } BIT;
    } EBMAPCR;
} st_bsc_t;

