FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX700_RX72N_EnvisionKit_IAR_e2studio_EWRX/src/smc_gen/r_bsp/mcu/rx72n/register_access/iccrx/iodefine.h
typedef struct st_cac
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char CFME : 1;
        } BIT;
    } CACR0;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char EDGES : 2;
            unsigned char TCSS : 2;
            unsigned char FMCS : 3;
            unsigned char CACREFE : 1;
        } BIT;
    } CACR1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char DFS : 2;
            unsigned char RCDS : 2;
            unsigned char RSCS : 3;
            unsigned char RPS : 1;
        } BIT;
    } CACR2;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char OVFFCL : 1;
            unsigned char MENDFCL : 1;
            unsigned char FERRFCL : 1;
            unsigned char : 1;
            unsigned char OVFIE : 1;
            unsigned char MENDIE : 1;
            unsigned char FERRIE : 1;
        } BIT;
    } CAICR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char OVFF : 1;
            unsigned char MENDF : 1;
            unsigned char FERRF : 1;
        } BIT;
    } CASTR;
    char wk0[ 1 ];
    unsigned short CAULVR;
    unsigned short CALLVR;
    unsigned short CACNTBR;
} st_cac_t;

typedef struct st_can
{
    struct
    {
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned short H;
                unsigned short L;
            } WORD;
            struct
            {
                unsigned char HH;
                unsigned char HL;
                unsigned char LH;
                unsigned char LL;
            } BYTE;
            struct
            {
                unsigned long IDE : 1;
                unsigned long RTR : 1;
                unsigned long : 1;
                unsigned long SID : 11;
                unsigned long EID : 18;
            } BIT;
        } ID;
        unsigned short DLC;
        unsigned char DATA[ 8 ];
        unsigned short TS;
    } MB[ 32 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned short H;
            unsigned short L;
        } WORD;
        struct
        {
            unsigned char HH;
            unsigned char HL;
            unsigned char LH;
            unsigned char LL;
        } BYTE;
        struct
        {
            unsigned long : 3;
            unsigned long SID : 11;
            unsigned long EID : 18;
        } BIT;
    } MKR[ 8 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned short H;
            unsigned short L;
        } WORD;
        struct
        {
            unsigned char HH;
            unsigned char HL;
            unsigned char LH;
            unsigned char LL;
        } BYTE;
        struct
        {
            unsigned long IDE : 1;
            unsigned long RTR : 1;
            unsigned long : 1;
            unsigned long SID : 11;
            unsigned long EID : 18;
        } BIT;
    } FIDCR0;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned short H;
            unsigned short L;
        } WORD;
        struct
        {
            unsigned char HH;
            unsigned char HL;
            unsigned char LH;
            unsigned char LL;
        } BYTE;
        struct
        {
            unsigned long IDE : 1;
            unsigned long RTR : 1;
            unsigned long : 1;
            unsigned long SID : 11;
            unsigned long EID : 18;
        } BIT;
    } FIDCR1;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned short H;
            unsigned short L;
        } WORD;
        struct
        {
            unsigned char HH;
            unsigned char HL;
            unsigned char LH;
            unsigned char LL;
        } BYTE;
        struct
        {
            unsigned char MB31 : 1;
            unsigned char MB30 : 1;
            unsigned char MB29 : 1;
            unsigned char MB28 : 1;
            unsigned char MB27 : 1;
            unsigned char MB26 : 1;
            unsigned char MB25 : 1;
            unsigned char MB24 : 1;
            unsigned char MB23 : 1;
            unsigned char MB22 : 1;
            unsigned char MB21 : 1;
            unsigned char MB20 : 1;
            unsigned char MB19 : 1;
            unsigned char MB18 : 1;
            unsigned char MB17 : 1;
            unsigned char MB16 : 1;
            unsigned char MB15 : 1;
            unsigned char MB14 : 1;
            unsigned char MB13 : 1;
            unsigned char MB12 : 1;
            unsigned char MB11 : 1;
            unsigned char MB10 : 1;
            unsigned char MB9 : 1;
            unsigned char MB8 : 1;
            unsigned char MB7 : 1;
            unsigned char MB6 : 1;
            unsigned char MB5 : 1;
            unsigned char MB4 : 1;
            unsigned char MB3 : 1;
            unsigned char MB2 : 1;
            unsigned char MB1 : 1;
            unsigned char MB0 : 1;
        } BIT;
    } MKIVLR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned short H;
            unsigned short L;
        } WORD;
        struct
        {
            unsigned char HH;
            unsigned char HL;
            unsigned char LH;
            unsigned char LL;
        } BYTE;
        struct
        {
            unsigned char MB31 : 1;
            unsigned char MB30 : 1;
            unsigned char MB29 : 1;
            unsigned char MB28 : 1;
            unsigned char MB27 : 1;
            unsigned char MB26 : 1;
            unsigned char MB25 : 1;
            unsigned char MB24 : 1;
            unsigned char MB23 : 1;
            unsigned char MB22 : 1;
            unsigned char MB21 : 1;
            unsigned char MB20 : 1;
            unsigned char MB19 : 1;
            unsigned char MB18 : 1;
            unsigned char MB17 : 1;
            unsigned char MB16 : 1;
            unsigned char MB15 : 1;
            unsigned char MB14 : 1;
            unsigned char MB13 : 1;
            unsigned char MB12 : 1;
            unsigned char MB11 : 1;
            unsigned char MB10 : 1;
            unsigned char MB9 : 1;
            unsigned char MB8 : 1;
            unsigned char MB7 : 1;
            unsigned char MB6 : 1;
            unsigned char MB5 : 1;
            unsigned char MB4 : 1;
            unsigned char MB3 : 1;
            unsigned char MB2 : 1;
            unsigned char MB1 : 1;
            unsigned char MB0 : 1;
        } BIT;
    } MIER;
    char wk0[ 1008 ];
    union
    {
        unsigned char BYTE;
        union
        {
            struct
            {
                unsigned char TRMREQ : 1;
                unsigned char RECREQ : 1;
                unsigned char : 1;
                unsigned char ONESHOT : 1;
                unsigned char : 1;
                unsigned char TRMABT : 1;
                unsigned char TRMACTIVE : 1;
                unsigned char SENTDATA : 1;
            } TX;
            struct
            {
                unsigned char TRMREQ : 1;
                unsigned char RECREQ : 1;
                unsigned char : 1;
                unsigned char ONESHOT : 1;
                unsigned char : 1;
                unsigned char MSGLOST : 1;
                unsigned char INVALDATA : 1;
                unsigned char NEWDATA : 1;
            } RX;
        } BIT;
    } MCTL[ 32 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned char H;
            unsigned char L;
        } BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char RBOC : 1;
            unsigned char BOM : 2;
            unsigned char SLPM : 1;
            unsigned char CANM : 2;
            unsigned char TSPS : 2;
            unsigned char TSRC : 1;
            unsigned char TPM : 1;
            unsigned char MLM : 1;
            unsigned char IDFM : 2;
            unsigned char MBM : 1;
        } BIT;
    } CTLR;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned char H;
            unsigned char L;
        } BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char RECST : 1;
            unsigned char TRMST : 1;
            unsigned char BOST : 1;
            unsigned char EPST : 1;
            unsigned char SLPST : 1;
            unsigned char HLTST : 1;
            unsigned char RSTST : 1;
            unsigned char EST : 1;
            unsigned char TABST : 1;
            unsigned char FMLST : 1;
            unsigned char NMLST : 1;
            unsigned char TFST : 1;
            unsigned char RFST : 1;
            unsigned char SDST : 1;
            unsigned char NDST : 1;
        } BIT;
    } STR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned short H;
            unsigned short L;
        } WORD;
        struct
        {
            unsigned char HH;
            unsigned char HL;
            unsigned char LH;
            unsigned char LL;
        } BYTE;
        struct
        {
            unsigned long TSEG1 : 4;
            unsigned long : 2;
            unsigned long BRP : 10;
            unsigned long : 2;
            unsigned long SJW : 2;
            unsigned long : 1;
            unsigned long TSEG2 : 3;
            unsigned long : 7;
            unsigned long CCLKS : 1;
        } BIT;
    } BCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char RFEST : 1;
            unsigned char RFWST : 1;
            unsigned char RFFST : 1;
            unsigned char RFMLF : 1;
            unsigned char RFUST : 3;
            unsigned char RFE : 1;
        } BIT;
    } RFCR;
    unsigned char RFPCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TFEST : 1;
            unsigned char TFFST : 1;
            unsigned char : 2;
            unsigned char TFUST : 3;
            unsigned char TFE : 1;
        } BIT;
    } TFCR;
    unsigned char TFPCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char BLIE : 1;
            unsigned char OLIE : 1;
            unsigned char ORIE : 1;
            unsigned char BORIE : 1;
            unsigned char BOEIE : 1;
            unsigned char EPIE : 1;
            unsigned char EWIE : 1;
            unsigned char BEIE : 1;
        } BIT;
    } EIER;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char BLIF : 1;
            unsigned char OLIF : 1;
            unsigned char ORIF : 1;
            unsigned char BORIF : 1;
            unsigned char BOEIF : 1;
            unsigned char EPIF : 1;
            unsigned char EWIF : 1;
            unsigned char BEIF : 1;
        } BIT;
    } EIFR;
    unsigned char RECR;
    unsigned char TECR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char EDPM : 1;
            unsigned char ADEF : 1;
            unsigned char BE0F : 1;
            unsigned char BE1F : 1;
            unsigned char CEF : 1;
            unsigned char AEF : 1;
            unsigned char FEF : 1;
            unsigned char SEF : 1;
        } BIT;
    } ECSR;
    unsigned char CSSR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SEST : 1;
            unsigned char : 2;
            unsigned char MBNST : 5;
        } BIT;
    } MSSR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 6;
            unsigned char MBSM : 2;
        } BIT;
    } MSMR;
    unsigned short TSR;
    unsigned short AFSR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char TSTM : 2;
            unsigned char TSTE : 1;
        } BIT;
    } TCR;
} st_can_t;

typedef struct st_cmt
{
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 14;
            unsigned short STR1 : 1;
            unsigned short STR0 : 1;
        } BIT;
    } CMSTR0;
    char wk0[ 14 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 14;
            unsigned short STR3 : 1;
            unsigned short STR2 : 1;
        } BIT;
    } CMSTR1;
} st_cmt_t;

typedef struct st_cmt0
{
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 9;
            unsigned short CMIE : 1;
            unsigned short : 4;
            unsigned short CKS : 2;
        } BIT;
    } CMCR;
    unsigned short CMCNT;
    unsigned short CMCOR;
} st_cmt0_t;

typedef struct st_cmtw
{
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 15;
            unsigned short STR : 1;
        } BIT;
    } CMWSTR;
    char wk0[ 2 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short CCLR : 3;
            unsigned short : 3;
            unsigned short CMS : 1;
            unsigned short : 1;
            unsigned short OC1IE : 1;
            unsigned short OC0IE : 1;
            unsigned short IC1IE : 1;
            unsigned short IC0IE : 1;
            unsigned short CMWIE : 1;
            unsigned short : 1;
            unsigned short CKS : 2;
        } BIT;
    } CMWCR;
    char wk1[ 2 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short CMWE : 1;
            unsigned short : 1;
            unsigned short OC1E : 1;
            unsigned short OC0E : 1;
            unsigned short OC1 : 2;
            unsigned short OC0 : 2;
            unsigned short : 2;
            unsigned short IC1E : 1;
            unsigned short IC0E : 1;
            unsigned short IC1 : 2;
            unsigned short IC0 : 2;
        } BIT;
    } CMWIOR;
    char wk2[ 6 ];
    unsigned long CMWCNT;
    unsigned long CMWCOR;
    unsigned long CMWICR0;
    unsigned long CMWICR1;
    unsigned long CMWOCR0;
    unsigned long CMWOCR1;
} st_cmtw_t;

typedef struct st_crc
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char DORCLR : 1;
            unsigned char LMS : 1;
            unsigned char : 3;
            unsigned char GPS : 3;
        } BIT;
    } CRCCR;
    char wk0[ 3 ];
    union
    {
        unsigned long LONG;
        unsigned char BYTE;
    } CRCDIR;
    union
    {
        unsigned long LONG;
        unsigned short WORD;
        unsigned char BYTE;
    } CRCDOR;
} st_crc_t;

typedef struct st_da
{
    unsigned short DADR0;
    unsigned short DADR1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char DAOE1 : 1;
            unsigned char DAOE0 : 1;
            unsigned char DAE : 1;
            unsigned char : 5;
        } BIT;
    } DACR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char DPSEL : 1;
            unsigned char : 7;
        } BIT;
    } DADPR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char DAADST : 1;
            unsigned char : 7;
        } BIT;
    } DAADSCR;
    char wk0[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char DAAMP1 : 1;
            unsigned char DAAMP0 : 1;
            unsigned char : 6;
        } BIT;
    } DAAMPCR;
    char wk1[ 19 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char DAASW1 : 1;
            unsigned char DAASW0 : 1;
            unsigned char : 6;
        } BIT;
    } DAASWCR;
    char wk2[ 17763 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 6;
            unsigned char AMADSEL1 : 1;
            unsigned char : 1;
        } BIT;
    } DAADUSR;
} st_da_t;

typedef struct st_dmac
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char DMST : 1;
        } BIT;
    } DMAST;
    char wk0[ 3 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char DMIS7 : 1;
            unsigned char DMIS6 : 1;
            unsigned char DMIS5 : 1;
            unsigned char DMIS4 : 1;
            unsigned char : 4;
        } BIT;
    } DMIST;
} st_dmac_t;

typedef struct st_dmac0
{
    void * DMSAR;
    void * DMDAR;
    unsigned long DMCRA;
    unsigned short DMCRB;
    char wk0[ 2 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short MD : 2;
            unsigned short DTS : 2;
            unsigned short : 2;
            unsigned short SZ : 2;
            unsigned short : 6;
            unsigned short DCTG : 2;
        } BIT;
    } DMTMD;
    char wk1[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char DTIE : 1;
            unsigned char ESIE : 1;
            unsigned char RPTIE : 1;
            unsigned char SARIE : 1;
            unsigned char DARIE : 1;
        } BIT;
    } DMINT;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short SM : 2;
            unsigned short : 1;
            unsigned short SARA : 5;
            unsigned short DM : 2;
            unsigned short : 1;
            unsigned short DARA : 5;
        } BIT;
    } DMAMD;
    char wk2[ 2 ];
    unsigned long DMOFR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char DTE : 1;
        } BIT;
    } DMCNT;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char CLRS : 1;
            unsigned char : 3;
            unsigned char SWREQ : 1;
        } BIT;
    } DMREQ;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ACT : 1;
            unsigned char : 2;
            unsigned char DTIF : 1;
            unsigned char : 3;
            unsigned char ESIF : 1;
        } BIT;
    } DMSTS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char DISEL : 1;
        } BIT;
    } DMCSL;
} st_dmac0_t;

