FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX700_RX72N_EnvisionKit_IAR_e2studio_EWRX/src/smc_gen/r_bsp/mcu/rx72n/register_access/iccrx/iodefine.h
typedef struct st_edmac
{
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 25;
            unsigned long DE : 1;
            unsigned long DL : 2;
            unsigned long : 3;
            unsigned long SWR : 1;
        } BIT;
    } EDMR;
    char wk0[ 4 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 31;
            unsigned long TR : 1;
        } BIT;
    } EDTRR;
    char wk1[ 4 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 31;
            unsigned long RR : 1;
        } BIT;
    } EDRRR;
    char wk2[ 4 ];
    void * TDLAR;
    char wk3[ 4 ];
    void * RDLAR;
    char wk4[ 4 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 1;
            unsigned long TWB : 1;
            unsigned long : 3;
            unsigned long TABT : 1;
            unsigned long RABT : 1;
            unsigned long RFCOF : 1;
            unsigned long : 1;
            unsigned long ECI : 1;
            unsigned long TC : 1;
            unsigned long TDE : 1;
            unsigned long TFUF : 1;
            unsigned long FR : 1;
            unsigned long RDE : 1;
            unsigned long RFOF : 1;
            unsigned long : 4;
            unsigned long CND : 1;
            unsigned long DLC : 1;
            unsigned long CD : 1;
            unsigned long TRO : 1;
            unsigned long RMAF : 1;
            unsigned long : 2;
            unsigned long RRF : 1;
            unsigned long RTLF : 1;
            unsigned long RTSF : 1;
            unsigned long PRE : 1;
            unsigned long CERF : 1;
        } BIT;
    } EESR;
    char wk5[ 4 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 1;
            unsigned long TWBIP : 1;
            unsigned long : 3;
            unsigned long TABTIP : 1;
            unsigned long RABTIP : 1;
            unsigned long RFCOFIP : 1;
            unsigned long : 1;
            unsigned long ECIIP : 1;
            unsigned long TCIP : 1;
            unsigned long TDEIP : 1;
            unsigned long TFUFIP : 1;
            unsigned long FRIP : 1;
            unsigned long RDEIP : 1;
            unsigned long RFOFIP : 1;
            unsigned long : 4;
            unsigned long CNDIP : 1;
            unsigned long DLCIP : 1;
            unsigned long CDIP : 1;
            unsigned long TROIP : 1;
            unsigned long RMAFIP : 1;
            unsigned long : 2;
            unsigned long RRFIP : 1;
            unsigned long RTLFIP : 1;
            unsigned long RTSFIP : 1;
            unsigned long PREIP : 1;
            unsigned long CERFIP : 1;
        } BIT;
    } EESIPR;
    char wk6[ 4 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 24;
            unsigned long RMAFCE : 1;
            unsigned long : 2;
            unsigned long RRFCE : 1;
            unsigned long : 4;
        } BIT;
    } TRSCER;
    char wk7[ 4 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 16;
            unsigned long MFC : 16;
        } BIT;
    } RMFCR;
    char wk8[ 4 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 21;
            unsigned long TFT : 11;
        } BIT;
    } TFTR;
    char wk9[ 4 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 19;
            unsigned long TFD : 5;
            unsigned long : 3;
            unsigned long RFD : 5;
        } BIT;
    } FDR;
    char wk10[ 4 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 31;
            unsigned long RNR : 1;
        } BIT;
    } RMCR;
    char wk11[ 8 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 16;
            unsigned long UNDER : 16;
        } BIT;
    } TFUCR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 16;
            unsigned long OVER : 16;
        } BIT;
    } RFOCR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 31;
            unsigned long ELB : 1;
        } BIT;
    } IOSR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 13;
            unsigned long RFFO : 3;
            unsigned long : 13;
            unsigned long RFDO : 3;
        } BIT;
    } FCFTR;
    char wk12[ 4 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 14;
            unsigned long PADS : 2;
            unsigned long : 10;
            unsigned long PADR : 6;
        } BIT;
    } RPADIR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 27;
            unsigned long TIM : 1;
            unsigned long : 3;
            unsigned long TIS : 1;
        } BIT;
    } TRIMD;
    char wk13[ 72 ];
    void * RBWAR;
    void * RDFAR;
    char wk14[ 4 ];
    void * TBRAR;
    void * TDFAR;
} st_edmac_t;

typedef struct st_elc
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELCON : 1;
            unsigned char : 7;
        } BIT;
    } ELCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        } BIT;
    } ELSR0;
    char wk0[ 2 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        } BIT;
    } ELSR3;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        } BIT;
    } ELSR4;
    char wk1[ 2 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        } BIT;
    } ELSR7;
    char wk2[ 2 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        } BIT;
    } ELSR10;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        } BIT;
    } ELSR11;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        } BIT;
    } ELSR12;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        } BIT;
    } ELSR13;
    char wk3[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        } BIT;
    } ELSR15;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        } BIT;
    } ELSR16;
    char wk4[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        } BIT;
    } ELSR18;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        } BIT;
    } ELSR19;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        } BIT;
    } ELSR20;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        } BIT;
    } ELSR21;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        } BIT;
    } ELSR22;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        } BIT;
    } ELSR23;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        } BIT;
    } ELSR24;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        } BIT;
    } ELSR25;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        } BIT;
    } ELSR26;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        } BIT;
    } ELSR27;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        } BIT;
    } ELSR28;
    char wk5[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char MTU3MD : 2;
            unsigned char : 4;
            unsigned char MTU0MD : 2;
        } BIT;
    } ELOPA;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 6;
            unsigned char MTU4MD : 2;
        } BIT;
    } ELOPB;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 4;
            unsigned char CMT1MD : 2;
            unsigned char : 2;
        } BIT;
    } ELOPC;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TMR3MD : 2;
            unsigned char TMR2MD : 2;
            unsigned char TMR1MD : 2;
            unsigned char TMR0MD : 2;
        } BIT;
    } ELOPD;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PGR7 : 1;
            unsigned char PGR6 : 1;
            unsigned char PGR5 : 1;
            unsigned char PGR4 : 1;
            unsigned char PGR3 : 1;
            unsigned char PGR2 : 1;
            unsigned char PGR1 : 1;
            unsigned char PGR0 : 1;
        } BIT;
    } PGR1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PGR7 : 1;
            unsigned char PGR6 : 1;
            unsigned char PGR5 : 1;
            unsigned char PGR4 : 1;
            unsigned char PGR3 : 1;
            unsigned char PGR2 : 1;
            unsigned char PGR1 : 1;
            unsigned char PGR0 : 1;
        } BIT;
    } PGR2;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char PGCO : 3;
            unsigned char : 1;
            unsigned char PGCOVE : 1;
            unsigned char PGCI : 2;
        } BIT;
    } PGC1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char PGCO : 3;
            unsigned char : 1;
            unsigned char PGCOVE : 1;
            unsigned char PGCI : 2;
        } BIT;
    } PGC2;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PDBF7 : 1;
            unsigned char PDBF6 : 1;
            unsigned char PDBF5 : 1;
            unsigned char PDBF4 : 1;
            unsigned char PDBF3 : 1;
            unsigned char PDBF2 : 1;
            unsigned char PDBF1 : 1;
            unsigned char PDBF0 : 1;
        } BIT;
    } PDBF1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PDBF7 : 1;
            unsigned char PDBF6 : 1;
            unsigned char PDBF5 : 1;
            unsigned char PDBF4 : 1;
            unsigned char PDBF3 : 1;
            unsigned char PDBF2 : 1;
            unsigned char PDBF1 : 1;
            unsigned char PDBF0 : 1;
        } BIT;
    } PDBF2;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char PSM : 2;
            unsigned char PSP : 2;
            unsigned char PSB : 3;
        } BIT;
    } PEL0;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char PSM : 2;
            unsigned char PSP : 2;
            unsigned char PSB : 3;
        } BIT;
    } PEL1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char PSM : 2;
            unsigned char PSP : 2;
            unsigned char PSB : 3;
        } BIT;
    } PEL2;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char PSM : 2;
            unsigned char PSP : 2;
            unsigned char PSB : 3;
        } BIT;
    } PEL3;
    union
    {
        unsigned char BYTE;
        #ifdef IODEFINE_H_HISTORY
            struct
            {
                unsigned char WI : 1;
                unsigned char WE : 1;
                unsigned char : 5;
                unsigned char SEG : 1;
            } BIT;
        #endif
    } ELSEGR;
    char wk6[ 3 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        } BIT;
    } ELSR33;
    char wk7[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        } BIT;
    } ELSR35;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        } BIT;
    } ELSR36;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        } BIT;
    } ELSR37;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        } BIT;
    } ELSR38;
    char wk8[ 6 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        } BIT;
    } ELSR45;
    char wk9[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TPU3MD : 2;
            unsigned char TPU2MD : 2;
            unsigned char TPU1MD : 2;
            unsigned char TPU0MD : 2;
        } BIT;
    } ELOPF;
    char wk10[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 6;
            unsigned char CMTW0MD : 2;
        } BIT;
    } ELOPH;
    char wk11[ 4 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        } BIT;
    } ELSR48;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        } BIT;
    } ELSR49;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        } BIT;
    } ELSR50;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        } BIT;
    } ELSR51;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        } BIT;
    } ELSR52;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        } BIT;
    } ELSR53;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        } BIT;
    } ELSR54;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        } BIT;
    } ELSR55;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        } BIT;
    } ELSR56;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS : 8;
        } BIT;
    } ELSR57;
} st_elc_t;

