FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX700_RX72N_EnvisionKit_IAR_e2studio_EWRX/src/smc_gen/r_bsp/mcu/rx72n/register_access/iccrx/iodefine.h
typedef struct st_eptpc
{
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 31;
            unsigned long RESET : 1;
        } BIT;
    } PTRSTR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 21;
            unsigned long SCLKSEL : 3;
            unsigned long : 5;
            unsigned long SCLKDIV : 3;
        } BIT;
    } STCSELR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 15;
            unsigned long BYPASS1 : 1;
            unsigned long : 15;
            unsigned long BYPASS0 : 1;
        } BIT;
    } SYBYPSR;
    char wk0[ 15092 ];
    unsigned long MIESR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 10;
            unsigned long CYC5 : 1;
            unsigned long CYC4 : 1;
            unsigned long CYC3 : 1;
            unsigned long CYC2 : 1;
            unsigned long CYC1 : 1;
            unsigned long CYC0 : 1;
            unsigned long : 12;
            unsigned long PR : 1;
            unsigned long SY1 : 1;
            unsigned long SY0 : 1;
            unsigned long ST : 1;
        } BIT;
    } MIEIPR;
    char wk1[ 8 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 7;
            unsigned long PLSN : 1;
            unsigned long : 7;
            unsigned long PLSP : 1;
            unsigned long : 2;
            unsigned long CYCN5 : 1;
            unsigned long CYCN4 : 1;
            unsigned long CYCN3 : 1;
            unsigned long CYCN2 : 1;
            unsigned long CYCN1 : 1;
            unsigned long CYCN0 : 1;
            unsigned long : 2;
            unsigned long CYCP5 : 1;
            unsigned long CYCP4 : 1;
            unsigned long CYCP3 : 1;
            unsigned long CYCP2 : 1;
            unsigned long CYCP1 : 1;
            unsigned long CYCP0 : 1;
        } BIT;
    } ELIPPR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 7;
            unsigned long PLSN : 1;
            unsigned long : 7;
            unsigned long PLSP : 1;
            unsigned long : 2;
            unsigned long CYCN5 : 1;
            unsigned long CYCN4 : 1;
            unsigned long CYCN3 : 1;
            unsigned long CYCN2 : 1;
            unsigned long CYCN1 : 1;
            unsigned long CYCN0 : 1;
            unsigned long : 2;
            unsigned long CYCP5 : 1;
            unsigned long CYCP4 : 1;
            unsigned long CYCP3 : 1;
            unsigned long CYCP2 : 1;
            unsigned long CYCP1 : 1;
            unsigned long CYCP0 : 1;
        } BIT;
    } ELIPACR;
    char wk2[ 40 ];
    unsigned long STSR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 27;
            unsigned long W10D : 1;
            unsigned long SYNTOUT : 1;
            unsigned long : 1;
            unsigned long SYNCOUT : 1;
            unsigned long SYNC : 1;
        } BIT;
    } STIPR;
    char wk3[ 8 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 30;
            unsigned long STCF : 2;
        } BIT;
    } STCFR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 2;
            unsigned long ALEN1 : 1;
            unsigned long ALEN0 : 1;
            unsigned long : 4;
            unsigned long DVTH : 4;
            unsigned long SYTH : 4;
            unsigned long W10S : 1;
            unsigned long : 1;
            unsigned long CMOD : 1;
            unsigned long : 5;
            unsigned long WINT : 8;
        } BIT;
    } STMR;
    unsigned long SYNTOR;
    char wk4[ 4 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 26;
            unsigned long IPTSEL5 : 1;
            unsigned long IPTSEL4 : 1;
            unsigned long IPTSEL3 : 1;
            unsigned long IPTSEL2 : 1;
            unsigned long IPTSEL1 : 1;
            unsigned long IPTSEL0 : 1;
        } BIT;
    } IPTSELR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 26;
            unsigned long MINTEN5 : 1;
            unsigned long MINTEN4 : 1;
            unsigned long MINTEN3 : 1;
            unsigned long MINTEN2 : 1;
            unsigned long MINTEN1 : 1;
            unsigned long MINTEN0 : 1;
        } BIT;
    } MITSELR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 26;
            unsigned long ELTDIS5 : 1;
            unsigned long ELTDIS4 : 1;
            unsigned long ELTDIS3 : 1;
            unsigned long ELTDIS2 : 1;
            unsigned long ELTDIS1 : 1;
            unsigned long ELTDIS0 : 1;
        } BIT;
    } ELTSELR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 31;
            unsigned long SYSEL : 1;
        } BIT;
    } STCHSELR;
    char wk5[ 16 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 31;
            unsigned long STR : 1;
        } BIT;
    } SYNSTARTR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 31;
            unsigned long LOAD : 1;
        } BIT;
    } LCIVLDR;
    char wk6[ 8 ];
    unsigned long SYNTDARU;
    unsigned long SYNTDARL;
    unsigned long SYNTDBRU;
    unsigned long SYNTDBRL;
    char wk7[ 16 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 16;
            unsigned long VALU : 16;
        } BIT;
    } LCIVRU;
    unsigned long LCIVRM;
    unsigned long LCIVRL;
    char wk8[ 104 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 31;
            unsigned long GW10 : 1;
        } BIT;
    } GETW10R;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 1;
            unsigned long LMTU : 31;
        } BIT;
    } PLIMITRU;
    unsigned long PLIMITRM;
    unsigned long PLIMITRL;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 1;
            unsigned long LMTU : 31;
        } BIT;
    } MLIMITRU;
    unsigned long MLIMITRM;
    unsigned long MLIMITRL;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 31;
            unsigned long INFO : 1;
        } BIT;
    } GETINFOR;
    char wk9[ 44 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 16;
            unsigned long CNTU : 16;
        } BIT;
    } LCCVRU;
    unsigned long LCCVRM;
    unsigned long LCCVRL;
    char wk10[ 148 ];
    unsigned long PW10VRU;
    unsigned long PW10VRM;
    unsigned long PW10VRL;
    char wk11[ 180 ];
    unsigned long MW10RU;
    unsigned long MW10RM;
    unsigned long MW10RL;
    char wk12[ 36 ];
    unsigned long TMSTTRU0;
    unsigned long TMSTTRL0;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 2;
            unsigned long CYC : 30;
        } BIT;
    } TMCYCR0;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 3;
            unsigned long WTH : 29;
        } BIT;
    } TMPLSR0;
    unsigned long TMSTTRU1;
    unsigned long TMSTTRL1;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 2;
            unsigned long CYC : 30;
        } BIT;
    } TMCYCR1;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 3;
            unsigned long WTH : 29;
        } BIT;
    } TMPLSR1;
    unsigned long TMSTTRU2;
    unsigned long TMSTTRL2;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 2;
            unsigned long CYC : 30;
        } BIT;
    } TMCYCR2;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 3;
            unsigned long WTH : 29;
        } BIT;
    } TMPLSR2;
    unsigned long TMSTTRU3;
    unsigned long TMSTTRL3;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 2;
            unsigned long CYC : 30;
        } BIT;
    } TMCYCR3;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 3;
            unsigned long WTH : 29;
        } BIT;
    } TMPLSR3;
    unsigned long TMSTTRU4;
    unsigned long TMSTTRL4;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 2;
            unsigned long CYC : 30;
        } BIT;
    } TMCYCR4;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 3;
            unsigned long WTH : 29;
        } BIT;
    } TMPLSR4;
    unsigned long TMSTTRU5;
    unsigned long TMSTTRL5;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 2;
            unsigned long CYC : 30;
        } BIT;
    } TMCYCR5;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 3;
            unsigned long WTH : 29;
        } BIT;
    } TMPLSR5;
    char wk13[ 28 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 26;
            unsigned long EN5 : 1;
            unsigned long EN4 : 1;
            unsigned long EN3 : 1;
            unsigned long EN2 : 1;
            unsigned long EN1 : 1;
            unsigned long EN0 : 1;
        } BIT;
    } TMSTARTR;
    char wk14[ 128 ];
    unsigned long PRSR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 2;
            unsigned long URE1 : 1;
            unsigned long URE0 : 1;
            unsigned long : 19;
            unsigned long MACE : 1;
            unsigned long : 4;
            unsigned long OVRE3 : 1;
            unsigned long OVRE2 : 1;
            unsigned long OVRE1 : 1;
            unsigned long OVRE0 : 1;
        } BIT;
    } PRIPR;
    char wk15[ 8 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 8;
            unsigned long MACU : 24;
        } BIT;
    } PRMACRU0;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 8;
            unsigned long MACL : 24;
        } BIT;
    } PRMACRL0;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 8;
            unsigned long MACU : 24;
        } BIT;
    } PRMACRU1;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 8;
            unsigned long MACL : 24;
        } BIT;
    } PRMACRL1;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 30;
            unsigned long TDIS : 2;
        } BIT;
    } TRNDISR;
    char wk16[ 12 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 22;
            unsigned long FWD1 : 1;
            unsigned long FWD0 : 1;
            unsigned long : 7;
            unsigned long MOD : 1;
        } BIT;
    } TRNMR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 21;
            unsigned long THVAL : 11;
        } BIT;
    } TRNCTTDR;
} st_eptpc_t;

