FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX700_RX72N_EnvisionKit_IAR_e2studio_EWRX/src/smc_gen/r_bsp/mcu/rx72n/register_access/iccrx/iodefine.h
typedef struct st_eptpc0
{
    unsigned long SYSR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 14;
            unsigned long GENDN : 1;
            unsigned long RESDN : 1;
            unsigned long : 1;
            unsigned long INFABT : 1;
            unsigned long : 1;
            unsigned long RECLP : 1;
            unsigned long : 5;
            unsigned long DRQOVR : 1;
            unsigned long INTDEV : 1;
            unsigned long DRPTO : 1;
            unsigned long : 1;
            unsigned long MPDUD : 1;
            unsigned long INTCHG : 1;
            unsigned long OFMUD : 1;
        } BIT;
    } SYIPR;
    char wk0[ 8 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 8;
            unsigned long MACU : 24;
        } BIT;
    } SYMACRU;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 8;
            unsigned long MACL : 24;
        } BIT;
    } SYMACRL;
    unsigned long SYLLCCTLR;
    unsigned long SYIPADDRR;
    char wk1[ 32 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 24;
            unsigned long TRSP : 4;
            unsigned long VER : 4;
        } BIT;
    } SYSPVRR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 24;
            unsigned long DNUM : 8;
        } BIT;
    } SYDOMR;
    char wk2[ 8 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 17;
            unsigned long FLAG14 : 1;
            unsigned long FLAG13 : 1;
            unsigned long : 2;
            unsigned long FLAG10 : 1;
            unsigned long : 1;
            unsigned long FLAG8 : 1;
            unsigned long : 2;
            unsigned long FLAG5 : 1;
            unsigned long FLAG4 : 1;
            unsigned long FLAG3 : 1;
            unsigned long FLAG2 : 1;
            unsigned long FLAG1 : 1;
            unsigned long FLAG0 : 1;
        } BIT;
    } ANFR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 17;
            unsigned long FLAG14 : 1;
            unsigned long FLAG13 : 1;
            unsigned long : 2;
            unsigned long FLAG10 : 1;
            unsigned long FLAG9 : 1;
            unsigned long FLAG8 : 1;
            unsigned long : 8;
        } BIT;
    } SYNFR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 17;
            unsigned long FLAG14 : 1;
            unsigned long FLAG13 : 1;
            unsigned long : 2;
            unsigned long FLAG10 : 1;
            unsigned long : 10;
        } BIT;
    } DYRQFR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 17;
            unsigned long FLAG14 : 1;
            unsigned long FLAG13 : 1;
            unsigned long : 2;
            unsigned long FLAG10 : 1;
            unsigned long FLAG9 : 1;
            unsigned long FLAG8 : 1;
            unsigned long : 8;
        } BIT;
    } DYRPFR;
    unsigned long SYCIDRU;
    unsigned long SYCIDRL;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 16;
            unsigned long PNUM : 16;
        } BIT;
    } SYPNUMR;
    char wk3[ 20 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 29;
            unsigned long ANUP : 1;
            unsigned long STUP : 1;
            unsigned long BMUP : 1;
        } BIT;
    } SYRVLDR;
    char wk4[ 12 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 1;
            unsigned long PDFUP : 3;
            unsigned long : 1;
            unsigned long PDRP : 3;
            unsigned long : 1;
            unsigned long PDRQ : 3;
            unsigned long : 1;
            unsigned long DRP : 3;
            unsigned long : 1;
            unsigned long DRQ : 3;
            unsigned long : 1;
            unsigned long FUP : 3;
            unsigned long : 1;
            unsigned long SYNC : 3;
            unsigned long : 2;
            unsigned long ANCE : 2;
        } BIT;
    } SYRFL1R;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 2;
            unsigned long ILL : 2;
            unsigned long : 22;
            unsigned long SIG : 2;
            unsigned long : 2;
            unsigned long MAN : 2;
        } BIT;
    } SYRFL2R;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 19;
            unsigned long PDRQ : 1;
            unsigned long : 3;
            unsigned long DRQ : 1;
            unsigned long : 3;
            unsigned long SYNC : 1;
            unsigned long : 3;
            unsigned long ANCE : 1;
        } BIT;
    } SYTRENR;
    char wk5[ 4 ];
    unsigned long MTCIDU;
    unsigned long MTCIDL;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 16;
            unsigned long PNUM : 16;
        } BIT;
    } MTPID;
    char wk6[ 20 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 8;
            unsigned long DREQ : 8;
            unsigned long SYNC : 8;
            unsigned long ANCE : 8;
        } BIT;
    } SYTLIR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 8;
            unsigned long DRESP : 8;
            unsigned long SYNC : 8;
            unsigned long ANCE : 8;
        } BIT;
    } SYRLIR;
    unsigned long OFMRU;
    unsigned long OFMRL;
    unsigned long MPDRU;
    unsigned long MPDRL;
    char wk7[ 8 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 8;
            unsigned long GMPR1 : 8;
            unsigned long : 8;
            unsigned long GMPR2 : 8;
        } BIT;
    } GMPR;
    unsigned long GMCQR;
    unsigned long GMIDRU;
    unsigned long GMIDRL;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long CUTO : 16;
            unsigned long : 8;
            unsigned long TSRC : 8;
        } BIT;
    } CUOTSR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 16;
            unsigned long SRMV : 16;
        } BIT;
    } SRR;
    char wk8[ 8 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 8;
            unsigned long MACU : 24;
        } BIT;
    } PPMACRU;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 8;
            unsigned long MACL : 24;
        } BIT;
    } PPMACRL;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 8;
            unsigned long MACU : 24;
        } BIT;
    } PDMACRU;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 8;
            unsigned long MACL : 24;
        } BIT;
    } PDMACRL;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 16;
            unsigned long TYPE : 16;
        } BIT;
    } PETYPER;
    char wk9[ 12 ];
    unsigned long PPIPR;
    unsigned long PDIPR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 24;
            unsigned long EVTO : 8;
        } BIT;
    } PETOSR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 24;
            unsigned long GETO : 8;
        } BIT;
    } PGTOSR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 24;
            unsigned long PRTL : 8;
        } BIT;
    } PPTTLR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 24;
            unsigned long PDTL : 8;
        } BIT;
    } PDTTLR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 16;
            unsigned long EVUPT : 16;
        } BIT;
    } PEUDPR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 16;
            unsigned long GEUPT : 16;
        } BIT;
    } PGUDPR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 15;
            unsigned long EXTPRM : 1;
            unsigned long : 13;
            unsigned long ENB : 1;
            unsigned long PRT : 1;
            unsigned long SEL : 1;
        } BIT;
    } FFLTR;
    char wk10[ 28 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 8;
            unsigned long MACU : 24;
        } BIT;
    } FMAC0RU;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 8;
            unsigned long MACL : 24;
        } BIT;
    } FMAC0RL;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 8;
            unsigned long MACU : 24;
        } BIT;
    } FMAC1RU;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 8;
            unsigned long MACL : 24;
        } BIT;
    } FMAC1RL;
    char wk11[ 80 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 16;
            unsigned long ASYMU : 16;
        } BIT;
    } DASYMRU;
    unsigned long DASYMRL;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long INGP : 16;
            unsigned long EGP : 16;
        } BIT;
    } TSLATR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 11;
            unsigned long TCMOD : 1;
            unsigned long : 3;
            unsigned long FILDIS : 1;
            unsigned long : 3;
            unsigned long SBDIS : 1;
            unsigned long : 4;
            unsigned long TCYC : 8;
        } BIT;
    } SYCONFR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 30;
            unsigned long FORM1 : 1;
            unsigned long FORM0 : 1;
        } BIT;
    } SYFORMR;
    unsigned long RSTOUTR;
} st_eptpc0_t;

typedef struct st_etherc
{
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 11;
            unsigned long TPC : 1;
            unsigned long ZPF : 1;
            unsigned long PFR : 1;
            unsigned long RXF : 1;
            unsigned long TXF : 1;
            unsigned long : 3;
            unsigned long PRCEF : 1;
            unsigned long : 2;
            unsigned long MPDE : 1;
            unsigned long : 2;
            unsigned long RE : 1;
            unsigned long TE : 1;
            unsigned long : 1;
            unsigned long ILB : 1;
            unsigned long RTM : 1;
            unsigned long DM : 1;
            unsigned long PRM : 1;
        } BIT;
    } ECMR;
    char wk0[ 4 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 20;
            unsigned long RFL : 12;
        } BIT;
    } RFLR;
    char wk1[ 4 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 26;
            unsigned long BFR : 1;
            unsigned long PSRTO : 1;
            unsigned long : 1;
            unsigned long LCHNG : 1;
            unsigned long MPD : 1;
            unsigned long ICD : 1;
        } BIT;
    } ECSR;
    char wk2[ 4 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 26;
            unsigned long BFSIPR : 1;
            unsigned long PSRTOIP : 1;
            unsigned long : 1;
            unsigned long LCHNGIP : 1;
            unsigned long MPDIP : 1;
            unsigned long ICDIP : 1;
        } BIT;
    } ECSIPR;
    char wk3[ 4 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 28;
            unsigned long MDI : 1;
            unsigned long MDO : 1;
            unsigned long MMD : 1;
            unsigned long MDC : 1;
        } BIT;
    } PIR;
    char wk4[ 4 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 31;
            unsigned long LMON : 1;
        } BIT;
    } PSR;
    char wk5[ 20 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 12;
            unsigned long RMD : 20;
        } BIT;
    } RDMLR;
    char wk6[ 12 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 27;
            unsigned long IPG : 5;
        } BIT;
    } IPGR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 16;
            unsigned long AP : 16;
        } BIT;
    } APR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 16;
            unsigned long MP : 16;
        } BIT;
    } MPR;
    char wk7[ 4 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 24;
            unsigned long RPAUSE : 8;
        } BIT;
    } RFCF;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 16;
            unsigned long TPAUSE : 16;
        } BIT;
    } TPAUSER;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 24;
            unsigned long TXP : 8;
        } BIT;
    } TPAUSECR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 16;
            unsigned long BCF : 16;
        } BIT;
    } BCFRR;
    char wk8[ 80 ];
    unsigned long MAHR;
    char wk9[ 4 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 16;
            unsigned long MA : 16;
        } BIT;
    } MALR;
    char wk10[ 4 ];
    unsigned long TROCR;
    unsigned long CDCR;
    unsigned long LCCR;
    unsigned long CNDCR;
    char wk11[ 4 ];
    unsigned long CEFCR;
    unsigned long FRECR;
    unsigned long TSFRCR;
    unsigned long TLFRCR;
    unsigned long RFCR;
    unsigned long MAFCR;
} st_etherc_t;

typedef struct st_exdmac
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char DMST : 1;
        } BIT;
    } EDMAST;
    char wk0[ 479 ];
    unsigned long CLSBR0;
    unsigned long CLSBR1;
    unsigned long CLSBR2;
    unsigned long CLSBR3;
    unsigned long CLSBR4;
    unsigned long CLSBR5;
    unsigned long CLSBR6;
    unsigned long CLSBR7;
} st_exdmac_t;

typedef struct st_exdmac0
{
    void * EDMSAR;
    void * EDMDAR;
    unsigned long EDMCRA;
    unsigned short EDMCRB;
    char wk0[ 2 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short MD : 2;
            unsigned short DTS : 2;
            unsigned short : 2;
            unsigned short SZ : 2;
            unsigned short : 6;
            unsigned short DCTG : 2;
        } BIT;
    } EDMTMD;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 4;
            unsigned char DACKS : 1;
            unsigned char DACKE : 1;
            unsigned char DACKW : 1;
            unsigned char DACKSEL : 1;
        } BIT;
    } EDMOMD;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char DTIE : 1;
            unsigned char ESIE : 1;
            unsigned char RPTIE : 1;
            unsigned char SARIE : 1;
            unsigned char DARIE : 1;
        } BIT;
    } EDMINT;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 14;
            unsigned long AMS : 1;
            unsigned long DIR : 1;
            unsigned long SM : 2;
            unsigned long : 1;
            unsigned long SARA : 5;
            unsigned long DM : 2;
            unsigned long : 1;
            unsigned long DARA : 5;
        } BIT;
    } EDMAMD;
    unsigned long EDMOFR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char DTE : 1;
        } BIT;
    } EDMCNT;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char CLRS : 1;
            unsigned char : 3;
            unsigned char SWREQ : 1;
        } BIT;
    } EDMREQ;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ACT : 1;
            unsigned char : 2;
            unsigned char DTIF : 1;
            unsigned char : 3;
            unsigned char ESIF : 1;
        } BIT;
    } EDMSTS;
    char wk1[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 6;
            unsigned char DREQS : 2;
        } BIT;
    } EDMRMD;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char EREQ : 1;
        } BIT;
    } EDMERF;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char PREQ : 1;
        } BIT;
    } EDMPRF;
} st_exdmac0_t;

typedef struct st_exdmac1
{
    void * EDMSAR;
    void * EDMDAR;
    unsigned long EDMCRA;
    unsigned short EDMCRB;
    char wk0[ 2 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short MD : 2;
            unsigned short DTS : 2;
            unsigned short : 2;
            unsigned short SZ : 2;
            unsigned short : 6;
            unsigned short DCTG : 2;
        } BIT;
    } EDMTMD;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 4;
            unsigned char DACKS : 1;
            unsigned char DACKE : 1;
            unsigned char DACKW : 1;
            unsigned char DACKSEL : 1;
        } BIT;
    } EDMOMD;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char DTIE : 1;
            unsigned char ESIE : 1;
            unsigned char RPTIE : 1;
            unsigned char SARIE : 1;
            unsigned char DARIE : 1;
        } BIT;
    } EDMINT;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 14;
            unsigned long AMS : 1;
            unsigned long DIR : 1;
            unsigned long SM : 2;
            unsigned long : 1;
            unsigned long SARA : 5;
            unsigned long DM : 2;
            unsigned long : 1;
            unsigned long DARA : 5;
        } BIT;
    } EDMAMD;
    char wk1[ 4 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char DTE : 1;
        } BIT;
    } EDMCNT;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char CLRS : 1;
            unsigned char : 3;
            unsigned char SWREQ : 1;
        } BIT;
    } EDMREQ;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ACT : 1;
            unsigned char : 2;
            unsigned char DTIF : 1;
            unsigned char : 3;
            unsigned char ESIF : 1;
        } BIT;
    } EDMSTS;
    char wk2[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 6;
            unsigned char DREQS : 2;
        } BIT;
    } EDMRMD;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char EREQ : 1;
        } BIT;
    } EDMERF;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char PREQ : 1;
        } BIT;
    } EDMPRF;
} st_exdmac1_t;

