FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX700_RX72N_EnvisionKit_IAR_e2studio_EWRX/src/smc_gen/r_bsp/mcu/rx72n/register_access/iccrx/iodefine.h
        struct
        {
            unsigned long : 5;
            unsigned long GAIN08 : 11;
            unsigned long : 5;
            unsigned long GAIN09 : 11;
        } BIT;
    } GAMRLUT5;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 5;
            unsigned long GAIN10 : 11;
            unsigned long : 5;
            unsigned long GAIN11 : 11;
        } BIT;
    } GAMRLUT6;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 5;
            unsigned long GAIN12 : 11;
            unsigned long : 5;
            unsigned long GAIN13 : 11;
        } BIT;
    } GAMRLUT7;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 5;
            unsigned long GAIN14 : 11;
            unsigned long : 5;
            unsigned long GAIN15 : 11;
        } BIT;
    } GAMRLUT8;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 2;
            unsigned long TH01 : 10;
            unsigned long TH02 : 10;
            unsigned long TH03 : 10;
        } BIT;
    } GAMRAREA1;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 2;
            unsigned long TH04 : 10;
            unsigned long TH05 : 10;
            unsigned long TH06 : 10;
        } BIT;
    } GAMRAREA2;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 2;
            unsigned long TH07 : 10;
            unsigned long TH08 : 10;
            unsigned long TH09 : 10;
        } BIT;
    } GAMRAREA3;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 2;
            unsigned long TH10 : 10;
            unsigned long TH11 : 10;
            unsigned long TH12 : 10;
        } BIT;
    } GAMRAREA4;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 2;
            unsigned long TH13 : 10;
            unsigned long TH14 : 10;
            unsigned long TH15 : 10;
        } BIT;
    } GAMRAREA5;
    char wk13[ 4 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 31;
            unsigned long VEN : 1;
        } BIT;
    } OUTVEN;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 3;
            unsigned long ENDIANON : 1;
            unsigned long : 3;
            unsigned long SWAPON : 1;
            unsigned long : 10;
            unsigned long FORMAT : 2;
            unsigned long : 2;
            unsigned long FRQSEL : 1;
            unsigned long : 4;
            unsigned long DIRSEL : 1;
            unsigned long : 2;
            unsigned long PHASE : 2;
        } BIT;
    } OUTSET;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 22;
            unsigned long BRTG : 10;
        } BIT;
    } BRIGHT1;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 6;
            unsigned long BRTB : 10;
            unsigned long : 6;
            unsigned long BRTR : 10;
        } BIT;
    } BRIGHT2;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 8;
            unsigned long CONTG : 8;
            unsigned long CONTB : 8;
            unsigned long CONTR : 8;
        } BIT;
    } CONTRAST;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 10;
            unsigned long SEL : 2;
            unsigned long : 2;
            unsigned long FORM : 2;
            unsigned long : 2;
            unsigned long PA : 2;
            unsigned long : 2;
            unsigned long PB : 2;
            unsigned long : 2;
            unsigned long PC : 2;
            unsigned long : 2;
            unsigned long PD : 2;
        } BIT;
    } PANELDTHA;
    char wk14[ 12 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 19;
            unsigned long FRONTGAM : 1;
            unsigned long : 3;
            unsigned long LCDEDG : 1;
            unsigned long : 1;
            unsigned long TCON0EDG : 1;
            unsigned long TCON1EDG : 1;
            unsigned long TCON2EDG : 1;
            unsigned long TCON3EDG : 1;
            unsigned long : 3;
        } BIT;
    } CLKPHASE;
    char wk15[ 28 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 5;
            unsigned long HALF : 11;
            unsigned long : 5;
            unsigned long OFFSET : 11;
        } BIT;
    } TCONTIM;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 5;
            unsigned long VS : 11;
            unsigned long : 5;
            unsigned long VW : 11;
        } BIT;
    } TCONSTVA1;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 27;
            unsigned long INV : 1;
            unsigned long : 1;
            unsigned long SEL : 3;
        } BIT;
    } TCONSTVA2;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 5;
            unsigned long VS : 11;
            unsigned long : 5;
            unsigned long VW : 11;
        } BIT;
    } TCONSTVB1;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 27;
            unsigned long INV : 1;
            unsigned long : 1;
            unsigned long SEL : 3;
        } BIT;
    } TCONSTVB2;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 5;
            unsigned long HS : 11;
            unsigned long : 5;
            unsigned long HW : 11;
        } BIT;
    } TCONSTHA1;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 23;
            unsigned long HSSEL : 1;
            unsigned long : 3;
            unsigned long INV : 1;
            unsigned long : 1;
            unsigned long SEL : 3;
        } BIT;
    } TCONSTHA2;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 5;
            unsigned long HS : 11;
            unsigned long : 5;
            unsigned long HW : 11;
        } BIT;
    } TCONSTHB1;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 23;
            unsigned long HSSEL : 1;
            unsigned long : 3;
            unsigned long INV : 1;
            unsigned long : 1;
            unsigned long SEL : 3;
        } BIT;
    } TCONSTHB2;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 31;
            unsigned long INV : 1;
        } BIT;
    } TCONDE;
    char wk16[ 20 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 29;
            unsigned long GR2UFDTC : 1;
            unsigned long GR1UFDTC : 1;
            unsigned long VPOSDTC : 1;
        } BIT;
    } DTCTEN;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 29;
            unsigned long GR2UFINTEN : 1;
            unsigned long GR1UFINTEN : 1;
            unsigned long VPOSINTEN : 1;
        } BIT;
    } INTEN;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 29;
            unsigned long GR2UFCLR : 1;
            unsigned long GR1UFCLR : 1;
            unsigned long VPOSCLR : 1;
        } BIT;
    } STCLR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 29;
            unsigned long GR2UF : 1;
            unsigned long GR1UF : 1;
            unsigned long VPOS : 1;
        } BIT;
    } STMON;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 19;
            unsigned long PIXSEL : 1;
            unsigned long : 3;
            unsigned long CLKSEL : 1;
            unsigned long : 1;
            unsigned long CLKEN : 1;
            unsigned long DCDR : 6;
        } BIT;
    } PANELCLK;
} st_glcdc_t;

