FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX700_RX72N_EnvisionKit_IAR_e2studio_EWRX/src/smc_gen/r_bsp/mcu/rx72n/register_access/iccrx/iodefine.h
        {
            unsigned char PIR7 : 1;
            unsigned char PIR6 : 1;
            unsigned char PIR5 : 1;
            unsigned char PIR4 : 1;
            unsigned char PIR3 : 1;
            unsigned char PIR2 : 1;
            unsigned char PIR1 : 1;
            unsigned char PIR0 : 1;
        } BIT;
    } PIBR7;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PIR7 : 1;
            unsigned char PIR6 : 1;
            unsigned char PIR5 : 1;
            unsigned char PIR4 : 1;
            unsigned char PIR3 : 1;
            unsigned char PIR2 : 1;
            unsigned char PIR1 : 1;
            unsigned char PIR0 : 1;
        } BIT;
    } PIBR8;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PIR7 : 1;
            unsigned char PIR6 : 1;
            unsigned char PIR5 : 1;
            unsigned char PIR4 : 1;
            unsigned char PIR3 : 1;
            unsigned char PIR2 : 1;
            unsigned char PIR1 : 1;
            unsigned char PIR0 : 1;
        } BIT;
    } PIBR9;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PIR7 : 1;
            unsigned char PIR6 : 1;
            unsigned char PIR5 : 1;
            unsigned char PIR4 : 1;
            unsigned char PIR3 : 1;
            unsigned char PIR2 : 1;
            unsigned char PIR1 : 1;
            unsigned char PIR0 : 1;
        } BIT;
    } PIBRA;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PIR7 : 1;
            unsigned char PIR6 : 1;
            unsigned char PIR5 : 1;
            unsigned char PIR4 : 1;
            unsigned char PIR3 : 1;
            unsigned char PIR2 : 1;
            unsigned char PIR1 : 1;
            unsigned char PIR0 : 1;
        } BIT;
    } PIBRB;
    char wk23[ 116 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBXR128;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBXR129;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBXR130;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBXR131;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBXR132;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBXR133;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBXR134;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBXR135;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBXR136;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBXR137;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBXR138;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBXR139;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBXR140;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBXR141;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBXR142;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBXR143;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR144;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR145;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR146;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR147;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR148;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR149;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR150;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR151;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR152;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR153;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR154;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR155;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR156;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR157;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR158;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR159;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR160;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR161;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR162;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR163;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR164;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR165;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR166;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR167;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR168;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR169;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR170;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR171;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR172;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR173;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR174;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR175;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR176;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR177;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR178;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR179;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR180;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR181;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR182;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR183;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR184;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR185;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR186;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR187;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR188;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR189;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR190;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR191;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR192;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR193;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR194;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR195;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR196;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR197;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR198;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR199;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR200;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR201;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR202;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR203;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR204;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR205;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR206;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLI : 8;
        } BIT;
    } SLIBR207;
    char wk24[ 96 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long IS31 : 1;
            unsigned long IS30 : 1;
            unsigned long IS29 : 1;
            unsigned long IS28 : 1;
            unsigned long IS27 : 1;
            unsigned long IS26 : 1;
            unsigned long IS25 : 1;
            unsigned long IS24 : 1;
            unsigned long IS23 : 1;
            unsigned long IS22 : 1;
            unsigned long IS21 : 1;
            unsigned long IS20 : 1;
            unsigned long IS19 : 1;
            unsigned long IS18 : 1;
            unsigned long IS17 : 1;
            unsigned long IS16 : 1;
            unsigned long IS15 : 1;
            unsigned long IS14 : 1;
            unsigned long IS13 : 1;
            unsigned long IS12 : 1;
            unsigned long IS11 : 1;
            unsigned long IS10 : 1;
            unsigned long IS9 : 1;
            unsigned long IS8 : 1;
            unsigned long IS7 : 1;
            unsigned long IS6 : 1;
            unsigned long IS5 : 1;
            unsigned long IS4 : 1;
            unsigned long IS3 : 1;
            unsigned long IS2 : 1;
            unsigned long IS1 : 1;
            unsigned long IS0 : 1;
        } BIT;
    } GRPAL0;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long IS31 : 1;
            unsigned long IS30 : 1;
            unsigned long IS29 : 1;
            unsigned long IS28 : 1;
            unsigned long IS27 : 1;
            unsigned long IS26 : 1;
            unsigned long IS25 : 1;
            unsigned long IS24 : 1;
            unsigned long IS23 : 1;
            unsigned long IS22 : 1;
            unsigned long IS21 : 1;
            unsigned long IS20 : 1;
            unsigned long IS19 : 1;
            unsigned long IS18 : 1;
            unsigned long IS17 : 1;
            unsigned long IS16 : 1;
            unsigned long IS15 : 1;
            unsigned long IS14 : 1;
            unsigned long IS13 : 1;
            unsigned long IS12 : 1;
            unsigned long IS11 : 1;
            unsigned long IS10 : 1;
            unsigned long IS9 : 1;
            unsigned long IS8 : 1;
            unsigned long IS7 : 1;
            unsigned long IS6 : 1;
            unsigned long IS5 : 1;
            unsigned long IS4 : 1;
            unsigned long IS3 : 1;
            unsigned long IS2 : 1;
            unsigned long IS1 : 1;
            unsigned long IS0 : 1;
        } BIT;
    } GRPAL1;
    char wk25[ 56 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long EN31 : 1;
            unsigned long EN30 : 1;
            unsigned long EN29 : 1;
            unsigned long EN28 : 1;
            unsigned long EN27 : 1;
            unsigned long EN26 : 1;
            unsigned long EN25 : 1;
            unsigned long EN24 : 1;
            unsigned long EN23 : 1;
            unsigned long EN22 : 1;
            unsigned long EN21 : 1;
            unsigned long EN20 : 1;
            unsigned long EN19 : 1;
            unsigned long EN18 : 1;
            unsigned long EN17 : 1;
            unsigned long EN16 : 1;
            unsigned long EN15 : 1;
            unsigned long EN14 : 1;
            unsigned long EN13 : 1;
            unsigned long EN12 : 1;
            unsigned long EN11 : 1;
            unsigned long EN10 : 1;
            unsigned long EN9 : 1;
            unsigned long EN8 : 1;
            unsigned long EN7 : 1;
            unsigned long EN6 : 1;
            unsigned long EN5 : 1;
            unsigned long EN4 : 1;
            unsigned long EN3 : 1;
            unsigned long EN2 : 1;
            unsigned long EN1 : 1;
            unsigned long EN0 : 1;
        } BIT;
    } GENAL0;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long EN31 : 1;
            unsigned long EN30 : 1;
            unsigned long EN29 : 1;
            unsigned long EN28 : 1;
            unsigned long EN27 : 1;
            unsigned long EN26 : 1;
            unsigned long EN25 : 1;
            unsigned long EN24 : 1;
            unsigned long EN23 : 1;
            unsigned long EN22 : 1;
            unsigned long EN21 : 1;
            unsigned long EN20 : 1;
            unsigned long EN19 : 1;
            unsigned long EN18 : 1;
            unsigned long EN17 : 1;
            unsigned long EN16 : 1;
            unsigned long EN15 : 1;
            unsigned long EN14 : 1;
            unsigned long EN13 : 1;
            unsigned long EN12 : 1;
            unsigned long EN11 : 1;
            unsigned long EN10 : 1;
            unsigned long EN9 : 1;
            unsigned long EN8 : 1;
            unsigned long EN7 : 1;
            unsigned long EN6 : 1;
            unsigned long EN5 : 1;
            unsigned long EN4 : 1;
            unsigned long EN3 : 1;
            unsigned long EN2 : 1;
            unsigned long EN1 : 1;
            unsigned long EN0 : 1;
        } BIT;
    } GENAL1;
    char wk26[ 136 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PIR7 : 1;
            unsigned char PIR6 : 1;
            unsigned char PIR5 : 1;
            unsigned char PIR4 : 1;
            unsigned char PIR3 : 1;
            unsigned char PIR2 : 1;
            unsigned char PIR1 : 1;
            unsigned char PIR0 : 1;
        } BIT;
    } PIAR0;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PIR7 : 1;
            unsigned char PIR6 : 1;
            unsigned char PIR5 : 1;
            unsigned char PIR4 : 1;
            unsigned char PIR3 : 1;
            unsigned char PIR2 : 1;
            unsigned char PIR1 : 1;
            unsigned char PIR0 : 1;
        } BIT;
    } PIAR1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PIR7 : 1;
            unsigned char PIR6 : 1;
            unsigned char PIR5 : 1;
            unsigned char PIR4 : 1;
            unsigned char PIR3 : 1;
            unsigned char PIR2 : 1;
            unsigned char PIR1 : 1;
            unsigned char PIR0 : 1;
        } BIT;
    } PIAR2;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PIR7 : 1;
            unsigned char PIR6 : 1;
            unsigned char PIR5 : 1;
            unsigned char PIR4 : 1;
            unsigned char PIR3 : 1;
            unsigned char PIR2 : 1;
            unsigned char PIR1 : 1;
            unsigned char PIR0 : 1;
        } BIT;
    } PIAR3;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PIR7 : 1;
            unsigned char PIR6 : 1;
            unsigned char PIR5 : 1;
            unsigned char PIR4 : 1;
            unsigned char PIR3 : 1;
            unsigned char PIR2 : 1;
            unsigned char PIR1 : 1;
            unsigned char PIR0 : 1;
        } BIT;
    } PIAR4;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PIR7 : 1;
            unsigned char PIR6 : 1;
            unsigned char PIR5 : 1;
            unsigned char PIR4 : 1;
            unsigned char PIR3 : 1;
            unsigned char PIR2 : 1;
            unsigned char PIR1 : 1;
            unsigned char PIR0 : 1;
        } BIT;
    } PIAR5;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PIR7 : 1;
            unsigned char PIR6 : 1;
            unsigned char PIR5 : 1;
            unsigned char PIR4 : 1;
            unsigned char PIR3 : 1;
            unsigned char PIR2 : 1;
            unsigned char PIR1 : 1;
            unsigned char PIR0 : 1;
        } BIT;
    } PIAR6;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PIR7 : 1;
            unsigned char PIR6 : 1;
            unsigned char PIR5 : 1;
            unsigned char PIR4 : 1;
            unsigned char PIR3 : 1;
            unsigned char PIR2 : 1;
            unsigned char PIR1 : 1;
            unsigned char PIR0 : 1;
        } BIT;
    } PIAR7;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PIR7 : 1;
            unsigned char PIR6 : 1;
            unsigned char PIR5 : 1;
            unsigned char PIR4 : 1;
            unsigned char PIR3 : 1;
            unsigned char PIR2 : 1;
            unsigned char PIR1 : 1;
            unsigned char PIR0 : 1;
        } BIT;
    } PIAR8;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PIR7 : 1;
            unsigned char PIR6 : 1;
            unsigned char PIR5 : 1;
            unsigned char PIR4 : 1;
            unsigned char PIR3 : 1;
            unsigned char PIR2 : 1;
            unsigned char PIR1 : 1;
            unsigned char PIR0 : 1;
        } BIT;
    } PIAR9;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PIR7 : 1;
            unsigned char PIR6 : 1;
            unsigned char PIR5 : 1;
            unsigned char PIR4 : 1;
            unsigned char PIR3 : 1;
            unsigned char PIR2 : 1;
            unsigned char PIR1 : 1;
            unsigned char PIR0 : 1;
        } BIT;
    } PIARA;
    char wk27[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PIR7 : 1;
            unsigned char PIR6 : 1;
            unsigned char PIR5 : 1;
            unsigned char PIR4 : 1;
            unsigned char PIR3 : 1;
            unsigned char PIR2 : 1;
            unsigned char PIR1 : 1;
            unsigned char PIR0 : 1;
        } BIT;
    } PIARC;
    char wk28[ 195 ];
    union
    {
        unsigned char BYTE;
    } SLIAR208;
    union
    {
        unsigned char BYTE;
    } SLIAR209;
    union
    {
        unsigned char BYTE;
    } SLIAR210;
    union
    {
        unsigned char BYTE;
    } SLIAR211;
    union
    {
        unsigned char BYTE;
    } SLIAR212;
    union
    {
        unsigned char BYTE;
    } SLIAR213;
    union
    {
        unsigned char BYTE;
    } SLIAR214;
    union
    {
        unsigned char BYTE;
    } SLIAR215;
    union
    {
        unsigned char BYTE;
    } SLIAR216;
    union
    {
        unsigned char BYTE;
    } SLIAR217;
    union
    {
        unsigned char BYTE;
    } SLIAR218;
    union
    {
        unsigned char BYTE;
    } SLIAR219;
    union
    {
        unsigned char BYTE;
    } SLIAR220;
    union
    {
        unsigned char BYTE;
    } SLIAR221;
    union
    {
        unsigned char BYTE;
    } SLIAR222;
    union
    {
        unsigned char BYTE;
    } SLIAR223;
    union
    {
        unsigned char BYTE;
    } SLIAR224;
    union
    {
        unsigned char BYTE;
    } SLIAR225;
    union
    {
        unsigned char BYTE;
    } SLIAR226;
    union
    {
        unsigned char BYTE;
    } SLIAR227;
    union
    {
        unsigned char BYTE;
    } SLIAR228;
    union
    {
        unsigned char BYTE;
    } SLIAR229;
    union
    {
        unsigned char BYTE;
    } SLIAR230;
    union
    {
        unsigned char BYTE;
    } SLIAR231;
    union
    {
        unsigned char BYTE;
    } SLIAR232;
    union
    {
        unsigned char BYTE;
    } SLIAR233;
    union
    {
        unsigned char BYTE;
