FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX700_RX72N_EnvisionKit_IAR_e2studio_EWRX/src/smc_gen/r_bsp/mcu/rx72n/register_access/iccrx/iodefine.h
    } SLIAR234;
    union
    {
        unsigned char BYTE;
    } SLIAR235;
    union
    {
        unsigned char BYTE;
    } SLIAR236;
    union
    {
        unsigned char BYTE;
    } SLIAR237;
    union
    {
        unsigned char BYTE;
    } SLIAR238;
    union
    {
        unsigned char BYTE;
    } SLIAR239;
    union
    {
        unsigned char BYTE;
    } SLIAR240;
    union
    {
        unsigned char BYTE;
    } SLIAR241;
    union
    {
        unsigned char BYTE;
    } SLIAR242;
    union
    {
        unsigned char BYTE;
    } SLIAR243;
    union
    {
        unsigned char BYTE;
    } SLIAR244;
    union
    {
        unsigned char BYTE;
    } SLIAR245;
    union
    {
        unsigned char BYTE;
    } SLIAR246;
    union
    {
        unsigned char BYTE;
    } SLIAR247;
    union
    {
        unsigned char BYTE;
    } SLIAR248;
    union
    {
        unsigned char BYTE;
    } SLIAR249;
    union
    {
        unsigned char BYTE;
    } SLIAR250;
    union
    {
        unsigned char BYTE;
    } SLIAR251;
    union
    {
        unsigned char BYTE;
    } SLIAR252;
    union
    {
        unsigned char BYTE;
    } SLIAR253;
    union
    {
        unsigned char BYTE;
    } SLIAR254;
    union
    {
        unsigned char BYTE;
    } SLIAR255;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char WPRC : 1;
        } BIT;
    } SLIPRCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 6;
            unsigned char SELEXD1 : 1;
            unsigned char SELEXD0 : 1;
        } BIT;
    } SELEXDR;
} st_icu_t;

typedef struct st_iwdt
{
    unsigned char IWDTRR;
    char wk0[ 1 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 2;
            unsigned short RPSS : 2;
            unsigned short : 2;
            unsigned short RPES : 2;
            unsigned short CKS : 4;
            unsigned short : 2;
            unsigned short TOPS : 2;
        } BIT;
    } IWDTCR;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short REFEF : 1;
            unsigned short UNDFF : 1;
            unsigned short CNTVAL : 14;
        } BIT;
    } IWDTSR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char RSTIRQS : 1;
            unsigned char : 7;
        } BIT;
    } IWDTRCR;
    char wk1[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SLCSTP : 1;
            unsigned char : 7;
        } BIT;
    } IWDTCSTPR;
} st_iwdt_t;

typedef struct st_mmcif
{
    union
    {
        unsigned long LONG;
        #ifdef IODEFINE_H_HISTORY
            struct
            {
                unsigned long : 1;
                unsigned long BOOT : 1;
                unsigned long CMD : 6;
                unsigned long RTYP : 2;
                unsigned long RBSY : 1;
                unsigned long : 1;
                unsigned long WDAT : 1;
                unsigned long DWEN : 1;
                unsigned long CMLTE : 1;
                unsigned long CMD12EN : 1;
                unsigned long RIDXC : 2;
                unsigned long RCRC7C : 2;
                unsigned long : 1;
                unsigned long CRC16C : 1;
                unsigned long BOOTACK : 1;
                unsigned long CRCSTE : 1;
                unsigned long TBIT : 1;
                unsigned long OPDM : 1;
                unsigned long : 2;
                unsigned long SBIT : 1;
                unsigned long : 1;
                unsigned long DATW : 2;
            } BIT;
        #endif /* ifdef IODEFINE_H_HISTORY */
    } CECMDSET;
    char wk0[ 4 ];
    union
    {
        unsigned long LONG;
    } CEARG;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long C12ARG : 32;
        } BIT;
    } CEARGCMD12;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 31;
            unsigned long BREAK : 1;
        } BIT;
    } CECMDCTRL;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long BLKCNT : 16;
            unsigned long BLKSIZ : 16;
        } BIT;
    } CEBLOCKSET;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long MMCBUSBSY : 1;
            unsigned long : 6;
            unsigned long CLKEN : 1;
            unsigned long : 4;
            unsigned long CLKDIV : 4;
            unsigned long : 2;
            unsigned long SRSPTO : 2;
            unsigned long SRBSYTO : 4;
            unsigned long SRWDTO : 4;
            unsigned long : 4;
        } BIT;
    } CECLKCTRL;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 5;
            unsigned long DMATYP : 1;
            unsigned long DMAWEN : 1;
            unsigned long DMAREN : 1;
            unsigned long : 7;
            unsigned long ATYP : 1;
            unsigned long : 16;
        } BIT;
    } CEBUFACC;
    unsigned long CERESP3;
    unsigned long CERESP2;
    unsigned long CERESP1;
    unsigned long CERESP0;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long RSP12 : 32;
        } BIT;
    } CERESPCMD12;
    unsigned long CEDATA;
    char wk1[ 4 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long SBTCLKDIV : 4;
            unsigned long SBTACKTO : 4;
            unsigned long SFSTBTDATTO : 4;
            unsigned long SBTDATTO : 4;
            unsigned long : 16;
        } BIT;
    } CEBOOT;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 5;
            unsigned long CMD12DRE : 1;
            unsigned long CMD12RBE : 1;
            unsigned long CMD12CRE : 1;
            unsigned long DTRANE : 1;
            unsigned long BUFRE : 1;
            unsigned long BUFWEN : 1;
            unsigned long BUFREN : 1;
            unsigned long : 2;
            unsigned long RBSYE : 1;
            unsigned long CRSPE : 1;
            unsigned long CMDVIO : 1;
            unsigned long BUFVIO : 1;
            unsigned long : 2;
            unsigned long WDATERR : 1;
            unsigned long RDATERR : 1;
            unsigned long RIDXERR : 1;
            unsigned long RSPERR : 1;
            unsigned long : 3;
            unsigned long CRCSTO : 1;
            unsigned long WDATTO : 1;
            unsigned long RDATTO : 1;
            unsigned long RBSYTO : 1;
            unsigned long RSPTO : 1;
        } BIT;
    } CEINT;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 5;
            unsigned long MCMD12DRE : 1;
            unsigned long MCMD12RBE : 1;
            unsigned long MCMD12CRE : 1;
            unsigned long MDTRANE : 1;
            unsigned long MBUFRE : 1;
            unsigned long MBUFWEN : 1;
            unsigned long MBUFREN : 1;
            unsigned long : 2;
            unsigned long MRBSYE : 1;
            unsigned long MCRSPE : 1;
            unsigned long MCMDVIO : 1;
            unsigned long MBUFVIO : 1;
            unsigned long : 2;
            unsigned long MWDATERR : 1;
            unsigned long MRDATERR : 1;
            unsigned long MRIDXERR : 1;
            unsigned long MRSPERR : 1;
            unsigned long : 3;
            unsigned long MCRCSTO : 1;
            unsigned long MWDATTO : 1;
            unsigned long MRDATTO : 1;
            unsigned long MRBSYTO : 1;
            unsigned long MRSPTO : 1;
        } BIT;
    } CEINTEN;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long CMDSEQ : 1;
            unsigned long CMDSIG : 1;
            unsigned long RSPIDX : 6;
            unsigned long DATSIG : 8;
            unsigned long RCVBLK : 16;
        } BIT;
    } CEHOSTSTS1;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long CRCSTE : 1;
            unsigned long CRC16E : 1;
            unsigned long AC12CRCE : 1;
            unsigned long RSPCRC7E : 1;
            unsigned long CRCSTEBE : 1;
            unsigned long RDATEBE : 1;
            unsigned long AC12REBE : 1;
            unsigned long RSPEBE : 1;
            unsigned long AC12IDXE : 1;
            unsigned long RSPIDXE : 1;
            unsigned long BTACKPATE : 1;
            unsigned long BTACKEBE : 1;
            unsigned long : 1;
            unsigned long CRCST : 3;
            unsigned long : 1;
            unsigned long STRDATTO : 1;
            unsigned long DATBSYTO : 1;
            unsigned long CRCSTTO : 1;
            unsigned long AC12BSYTO : 1;
            unsigned long RSPBSYTO : 1;
            unsigned long AC12RSPTO : 1;
            unsigned long STRSPTO : 1;
            unsigned long BTACKTO : 1;
            unsigned long FSTBTDATTO : 1;
            unsigned long BTDATTO : 1;
            unsigned long : 5;
        } BIT;
    } CEHOSTSTS2;
    char wk2[ 32 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 17;
            unsigned long CDSIG : 1;
            unsigned long CDRISE : 1;
            unsigned long CDFALL : 1;
            unsigned long : 6;
            unsigned long MCDRISE : 1;
            unsigned long MCDFALL : 1;
            unsigned long : 4;
        } BIT;
    } CEDETECT;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 10;
            unsigned long RESNOUT : 1;
            unsigned long : 1;
            unsigned long CLKMAIN : 1;
            unsigned long : 19;
        } BIT;
    } CEADDMODE;
    char wk3[ 4 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long SWRST : 1;
            unsigned long : 15;
            unsigned long VERSION : 16;
        } BIT;
    } CEVERSION;
} st_mmcif_t;

