FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX700_RX72N_EnvisionKit_IAR_e2studio_EWRX/src/smc_gen/r_bsp/mcu/rx72n/register_access/iccrx/iodefine.h
            unsigned char ISEL : 1;
            unsigned char PSEL : 6;
        } BIT;
    } PE6PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ASEL : 1;
            unsigned char ISEL : 1;
            unsigned char PSEL : 6;
        } BIT;
    } PE7PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PF0PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PF1PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PF2PFS;
    char wk10[ 2 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char ISEL : 1;
            unsigned char : 6;
        } BIT;
    } PF5PFS;
    char wk11[ 2 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PG0PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PG1PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PG2PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PG3PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PG4PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PG5PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PG6PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PG7PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PH0PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PH1PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PH2PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PH3PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PH4PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PH5PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PH6PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PH7PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PJ0PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PJ1PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PJ2PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PJ3PFS;
    char wk12[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PJ5PFS;
    char wk13[ 2 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PK0PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PK1PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PK2PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PK3PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PK4PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PK5PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PK6PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PK7PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PL0PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PL1PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PL2PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PL3PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PL4PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PL5PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PL6PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PL7PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PM0PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PM1PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PM2PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PM3PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PM4PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PM5PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PM6PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PM7PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PN0PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PN1PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PN2PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PN3PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PN4PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PN5PFS;
    char wk14[ 2 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PQ0PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PQ1PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PQ2PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PQ3PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PQ4PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PQ5PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PQ6PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char PSEL : 6;
        } BIT;
    } PQ7PFS;
} st_mpc_t;

typedef struct st_mpu
{
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long RSPN : 28;
            unsigned long : 4;
        } BIT;
    } RSPAGE0;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long REPN : 28;
            unsigned long UAC : 3;
            unsigned long V : 1;
        } BIT;
    } REPAGE0;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long RSPN : 28;
            unsigned long : 4;
        } BIT;
    } RSPAGE1;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long REPN : 28;
            unsigned long UAC : 3;
            unsigned long V : 1;
        } BIT;
    } REPAGE1;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long RSPN : 28;
            unsigned long : 4;
        } BIT;
    } RSPAGE2;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long REPN : 28;
            unsigned long UAC : 3;
            unsigned long V : 1;
        } BIT;
    } REPAGE2;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long RSPN : 28;
            unsigned long : 4;
        } BIT;
    } RSPAGE3;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long REPN : 28;
            unsigned long UAC : 3;
            unsigned long V : 1;
        } BIT;
    } REPAGE3;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long RSPN : 28;
            unsigned long : 4;
        } BIT;
    } RSPAGE4;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long REPN : 28;
            unsigned long UAC : 3;
            unsigned long V : 1;
        } BIT;
    } REPAGE4;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long RSPN : 28;
            unsigned long : 4;
        } BIT;
    } RSPAGE5;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long REPN : 28;
            unsigned long UAC : 3;
            unsigned long V : 1;
        } BIT;
    } REPAGE5;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long RSPN : 28;
            unsigned long : 4;
        } BIT;
    } RSPAGE6;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long REPN : 28;
            unsigned long UAC : 3;
            unsigned long V : 1;
        } BIT;
    } REPAGE6;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long RSPN : 28;
            unsigned long : 4;
        } BIT;
    } RSPAGE7;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long REPN : 28;
            unsigned long UAC : 3;
            unsigned long V : 1;
        } BIT;
    } REPAGE7;
    char wk0[ 192 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 31;
            unsigned long MPEN : 1;
        } BIT;
    } MPEN;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 28;
            unsigned long UBAC : 3;
            unsigned long : 1;
        } BIT;
    } MPBAC;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 31;
            unsigned long CLR : 1;
        } BIT;
    } MPECLR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 29;
            unsigned long DRW : 1;
            unsigned long DMPER : 1;
            unsigned long IMPER : 1;
        } BIT;
    } MPESTS;
    char wk1[ 4 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long DEA : 32;
        } BIT;
    } MPDEA;
    char wk2[ 8 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long SA : 32;
        } BIT;
    } MPSA;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 15;
            unsigned short S : 1;
        } BIT;
    } MPOPS;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 15;
            unsigned short INV : 1;
        } BIT;
    } MPOPI;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 8;
            unsigned long HITI : 8;
            unsigned long : 12;
            unsigned long UHACI : 3;
            unsigned long : 1;
        } BIT;
    } MHITI;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 8;
            unsigned long HITD : 8;
            unsigned long : 12;
            unsigned long UHACD : 3;
            unsigned long : 1;
        } BIT;
    } MHITD;
} st_mpu_t;

