FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX700_RX72N_EnvisionKit_IAR_e2studio_EWRX/src/smc_gen/r_bsp/mcu/rx72n/register_access/iccrx/iodefine.h
typedef struct st_mtu
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char OE4D : 1;
            unsigned char OE4C : 1;
            unsigned char OE3D : 1;
            unsigned char OE4B : 1;
            unsigned char OE4A : 1;
            unsigned char OE3B : 1;
        } BIT;
    } TOERA;
    char wk0[ 2 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char BDC : 1;
            unsigned char N : 1;
            unsigned char P : 1;
            unsigned char FB : 1;
            unsigned char WF : 1;
            unsigned char VF : 1;
            unsigned char UF : 1;
        } BIT;
    } TGCRA;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char PSYE : 1;
            unsigned char : 2;
            unsigned char TOCL : 1;
            unsigned char TOCS : 1;
            unsigned char OLSN : 1;
            unsigned char OLSP : 1;
        } BIT;
    } TOCR1A;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char BF : 2;
            unsigned char OLS3N : 1;
            unsigned char OLS3P : 1;
            unsigned char OLS2N : 1;
            unsigned char OLS2P : 1;
            unsigned char OLS1N : 1;
            unsigned char OLS1P : 1;
        } BIT;
    } TOCR2A;
    char wk1[ 4 ];
    unsigned short TCDRA;
    unsigned short TDDRA;
    char wk2[ 8 ];
    unsigned short TCNTSA;
    unsigned short TCBRA;
    char wk3[ 12 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char T3AEN : 1;
            unsigned char T3ACOR : 3;
            unsigned char T4VEN : 1;
            unsigned char T4VCOR : 3;
        } BIT;
    } TITCR1A;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char T3ACNT : 3;
            unsigned char : 1;
            unsigned char T4VCNT : 3;
        } BIT;
    } TITCNT1A;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 6;
            unsigned char BTE : 2;
        } BIT;
    } TBTERA;
    char wk4[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char TDER : 1;
        } BIT;
    } TDERA;
    char wk5[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char OLS3N : 1;
            unsigned char OLS3P : 1;
            unsigned char OLS2N : 1;
            unsigned char OLS2P : 1;
            unsigned char OLS1N : 1;
            unsigned char OLS1P : 1;
        } BIT;
    } TOLBRA;
    char wk6[ 3 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char TITM : 1;
        } BIT;
    } TITMRA;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char TRG4COR : 3;
        } BIT;
    } TITCR2A;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char TRG4CNT : 3;
        } BIT;
    } TITCNT2A;
    char wk7[ 35 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CCE : 1;
            unsigned char : 5;
            unsigned char SCC : 1;
            unsigned char WRE : 1;
        } BIT;
    } TWCRA;
    char wk8[ 15 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char DRS : 1;
        } BIT;
    } TMDR2A;
    char wk9[ 15 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CST4 : 1;
            unsigned char CST3 : 1;
            unsigned char : 2;
            unsigned char CST8 : 1;
            unsigned char CST2 : 1;
            unsigned char CST1 : 1;
            unsigned char CST0 : 1;
        } BIT;
    } TSTRA;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SYNC4 : 1;
            unsigned char SYNC3 : 1;
            unsigned char : 3;
            unsigned char SYNC2 : 1;
            unsigned char SYNC1 : 1;
            unsigned char SYNC0 : 1;
        } BIT;
    } TSYRA;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SCH0 : 1;
            unsigned char SCH1 : 1;
            unsigned char SCH2 : 1;
            unsigned char SCH3 : 1;
            unsigned char SCH4 : 1;
            unsigned char : 1;
            unsigned char SCH6 : 1;
            unsigned char SCH7 : 1;
        } BIT;
    } TCSYSTR;
    char wk10[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char RWE : 1;
        } BIT;
    } TRWERA;
    char wk11[ 1925 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char OE7D : 1;
            unsigned char OE7C : 1;
            unsigned char OE6D : 1;
            unsigned char OE7B : 1;
            unsigned char OE7A : 1;
            unsigned char OE6B : 1;
        } BIT;
    } TOERB;
    char wk12[ 3 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char PSYE : 1;
            unsigned char : 2;
            unsigned char TOCL : 1;
            unsigned char TOCS : 1;
            unsigned char OLSN : 1;
            unsigned char OLSP : 1;
        } BIT;
    } TOCR1B;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char BF : 2;
            unsigned char OLS3N : 1;
            unsigned char OLS3P : 1;
            unsigned char OLS2N : 1;
            unsigned char OLS2P : 1;
            unsigned char OLS1N : 1;
            unsigned char OLS1P : 1;
        } BIT;
    } TOCR2B;
    char wk13[ 4 ];
    unsigned short TCDRB;
    unsigned short TDDRB;
    char wk14[ 8 ];
    unsigned short TCNTSB;
    unsigned short TCBRB;
    char wk15[ 12 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char T6AEN : 1;
            unsigned char T6ACOR : 3;
            unsigned char T7VEN : 1;
            unsigned char T7VCOR : 3;
        } BIT;
    } TITCR1B;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char T6ACNT : 3;
            unsigned char : 1;
            unsigned char T7VCNT : 3;
        } BIT;
    } TITCNT1B;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 6;
            unsigned char BTE : 2;
        } BIT;
    } TBTERB;
    char wk16[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char TDER : 1;
        } BIT;
    } TDERB;
    char wk17[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char OLS3N : 1;
            unsigned char OLS3P : 1;
            unsigned char OLS2N : 1;
            unsigned char OLS2P : 1;
            unsigned char OLS1N : 1;
            unsigned char OLS1P : 1;
        } BIT;
    } TOLBRB;
    char wk18[ 3 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char TITM : 1;
        } BIT;
    } TITMRB;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char TRG7COR : 3;
        } BIT;
    } TITCR2B;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char TRG7CNT : 3;
        } BIT;
    } TITCNT2B;
    char wk19[ 35 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CCE : 1;
            unsigned char : 5;
            unsigned char SCC : 1;
            unsigned char WRE : 1;
        } BIT;
    } TWCRB;
    char wk20[ 15 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char DRS : 1;
        } BIT;
    } TMDR2B;
    char wk21[ 15 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CST7 : 1;
            unsigned char CST6 : 1;
            unsigned char : 6;
        } BIT;
    } TSTRB;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SYNC7 : 1;
            unsigned char SYNC6 : 1;
            unsigned char : 6;
        } BIT;
    } TSYRB;
    char wk22[ 2 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char RWE : 1;
        } BIT;
    } TRWERB;
} st_mtu_t;

typedef struct st_mtu0
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char NFCS : 2;
            unsigned char NFDEN : 1;
            unsigned char NFCEN : 1;
            unsigned char NFBEN : 1;
            unsigned char NFAEN : 1;
        } BIT;
    } NFCR0;
    char wk0[ 8 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char NFCS : 2;
            unsigned char NFDEN : 1;
            unsigned char NFCEN : 1;
            unsigned char NFBEN : 1;
            unsigned char NFAEN : 1;
        } BIT;
    } NFCRC;
    char wk1[ 102 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CCLR : 3;
            unsigned char CKEG : 2;
            unsigned char TPSC : 3;
        } BIT;
    } TCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char BFE : 1;
            unsigned char BFB : 1;
            unsigned char BFA : 1;
            unsigned char MD : 4;
        } BIT;
    } TMDR1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char IOB : 4;
            unsigned char IOA : 4;
        } BIT;
    } TIORH;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char IOD : 4;
            unsigned char IOC : 4;
        } BIT;
    } TIORL;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TTGE : 1;
            unsigned char : 2;
            unsigned char TCIEV : 1;
            unsigned char TGIED : 1;
            unsigned char TGIEC : 1;
            unsigned char TGIEB : 1;
            unsigned char TGIEA : 1;
        } BIT;
    } TIER;
    char wk2[ 1 ];
    unsigned short TCNT;
    unsigned short TGRA;
    unsigned short TGRB;
    unsigned short TGRC;
    unsigned short TGRD;
    char wk3[ 16 ];
    unsigned short TGRE;
    unsigned short TGRF;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TTGE2 : 1;
            unsigned char : 5;
            unsigned char TGIEF : 1;
            unsigned char TGIEE : 1;
        } BIT;
    } TIER2;
    char wk4[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char TTSE : 1;
            unsigned char TTSB : 1;
            unsigned char TTSA : 1;
        } BIT;
    } TBTM;
    char wk5[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char TPSC2 : 3;
        } BIT;
    } TCR2;
} st_mtu0_t;

typedef struct st_mtu1
{
    char wk0[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char NFCS : 2;
            unsigned char NFDEN : 1;
            unsigned char NFCEN : 1;
            unsigned char NFBEN : 1;
            unsigned char NFAEN : 1;
        } BIT;
    } NFCR1;
    char wk1[ 238 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char CCLR : 2;
            unsigned char CKEG : 2;
            unsigned char TPSC : 3;
        } BIT;
    } TCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 4;
            unsigned char MD : 4;
        } BIT;
    } TMDR1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char IOB : 4;
            unsigned char IOA : 4;
        } BIT;
    } TIOR;
    char wk2[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TTGE : 1;
            unsigned char : 1;
            unsigned char TCIEU : 1;
            unsigned char TCIEV : 1;
            unsigned char : 2;
            unsigned char TGIEB : 1;
            unsigned char TGIEA : 1;
        } BIT;
    } TIER;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TCFD : 1;
            unsigned char : 7;
        } BIT;
    } TSR;
    unsigned short TCNT;
    unsigned short TGRA;
    unsigned short TGRB;
    char wk3[ 4 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 4;
            unsigned char I2BE : 1;
            unsigned char I2AE : 1;
            unsigned char I1BE : 1;
            unsigned char I1AE : 1;
        } BIT;
    } TICCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 6;
            unsigned char PHCKSEL : 1;
            unsigned char LWA : 1;
        } BIT;
    } TMDR3;
    char wk4[ 2 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char PCB : 2;
            unsigned char TPSC2 : 3;
        } BIT;
    } TCR2;
    char wk5[ 11 ];
    unsigned long TCNTLW;
    unsigned long TGRALW;
    unsigned long TGRBLW;
} st_mtu1_t;

typedef struct st_mtu2
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char NFCS : 2;
            unsigned char NFDEN : 1;
            unsigned char NFCEN : 1;
            unsigned char NFBEN : 1;
            unsigned char NFAEN : 1;
        } BIT;
    } NFCR2;
    char wk0[ 365 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char CCLR : 2;
            unsigned char CKEG : 2;
            unsigned char TPSC : 3;
        } BIT;
    } TCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 4;
            unsigned char MD : 4;
        } BIT;
    } TMDR1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char IOB : 4;
            unsigned char IOA : 4;
        } BIT;
    } TIOR;
    char wk1[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TTGE : 1;
            unsigned char : 1;
            unsigned char TCIEU : 1;
            unsigned char TCIEV : 1;
            unsigned char : 2;
            unsigned char TGIEB : 1;
            unsigned char TGIEA : 1;
        } BIT;
    } TIER;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TCFD : 1;
            unsigned char : 7;
        } BIT;
    } TSR;
    unsigned short TCNT;
    unsigned short TGRA;
    unsigned short TGRB;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char PCB : 2;
            unsigned char TPSC2 : 3;
        } BIT;
    } TCR2;
} st_mtu2_t;

typedef struct st_mtu3
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CCLR : 3;
            unsigned char CKEG : 2;
            unsigned char TPSC : 3;
        } BIT;
    } TCR;
    char wk0[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char BFB : 1;
            unsigned char BFA : 1;
            unsigned char MD : 4;
        } BIT;
    } TMDR1;
    char wk1[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char IOB : 4;
            unsigned char IOA : 4;
        } BIT;
    } TIORH;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char IOD : 4;
            unsigned char IOC : 4;
        } BIT;
    } TIORL;
    char wk2[ 2 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TTGE : 1;
            unsigned char : 2;
            unsigned char TCIEV : 1;
            unsigned char TGIED : 1;
            unsigned char TGIEC : 1;
            unsigned char TGIEB : 1;
            unsigned char TGIEA : 1;
        } BIT;
    } TIER;
    char wk3[ 7 ];
    unsigned short TCNT;
    char wk4[ 6 ];
    unsigned short TGRA;
    unsigned short TGRB;
    char wk5[ 8 ];
    unsigned short TGRC;
    unsigned short TGRD;
    char wk6[ 4 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TCFD : 1;
            unsigned char : 7;
        } BIT;
    } TSR;
    char wk7[ 11 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 6;
            unsigned char TTSB : 1;
            unsigned char TTSA : 1;
        } BIT;
    } TBTM;
    char wk8[ 19 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char TPSC2 : 3;
        } BIT;
    } TCR2;
    char wk9[ 37 ];
    unsigned short TGRE;
    char wk10[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char NFCS : 2;
            unsigned char NFDEN : 1;
            unsigned char NFCEN : 1;
            unsigned char NFBEN : 1;
            unsigned char NFAEN : 1;
        } BIT;
    } NFCR3;
} st_mtu3_t;

typedef struct st_mtu4
{
    char wk0[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CCLR : 3;
            unsigned char CKEG : 2;
            unsigned char TPSC : 3;
        } BIT;
    } TCR;
    char wk1[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char BFB : 1;
            unsigned char BFA : 1;
            unsigned char MD : 4;
        } BIT;
    } TMDR1;
    char wk2[ 2 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char IOB : 4;
            unsigned char IOA : 4;
        } BIT;
    } TIORH;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char IOD : 4;
            unsigned char IOC : 4;
        } BIT;
    } TIORL;
    char wk3[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TTGE : 1;
            unsigned char TTGE2 : 1;
            unsigned char : 1;
            unsigned char TCIEV : 1;
            unsigned char TGIED : 1;
            unsigned char TGIEC : 1;
            unsigned char TGIEB : 1;
            unsigned char TGIEA : 1;
        } BIT;
    } TIER;
    char wk4[ 8 ];
    unsigned short TCNT;
    char wk5[ 8 ];
    unsigned short TGRA;
    unsigned short TGRB;
    char wk6[ 8 ];
    unsigned short TGRC;
    unsigned short TGRD;
    char wk7[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TCFD : 1;
            unsigned char : 7;
        } BIT;
    } TSR;
    char wk8[ 11 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 6;
            unsigned char TTSB : 1;
            unsigned char TTSA : 1;
        } BIT;
    } TBTM;
    char wk9[ 6 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short BF : 2;
            unsigned short : 6;
            unsigned short UT4AE : 1;
            unsigned short DT4AE : 1;
            unsigned short UT4BE : 1;
            unsigned short DT4BE : 1;
            unsigned short ITA3AE : 1;
            unsigned short ITA4VE : 1;
            unsigned short ITB3AE : 1;
            unsigned short ITB4VE : 1;
        } BIT;
    } TADCR;
    char wk10[ 2 ];
    unsigned short TADCORA;
    unsigned short TADCORB;
    unsigned short TADCOBRA;
    unsigned short TADCOBRB;
    char wk11[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char TPSC2 : 3;
        } BIT;
    } TCR2;
    char wk12[ 38 ];
    unsigned short TGRE;
    unsigned short TGRF;
    char wk13[ 28 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char NFCS : 2;
            unsigned char NFDEN : 1;
            unsigned char NFCEN : 1;
            unsigned char NFBEN : 1;
            unsigned char NFAEN : 1;
        } BIT;
    } NFCR4;
} st_mtu4_t;

