FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX700_RX72N_EnvisionKit_IAR_e2studio_EWRX/src/smc_gen/r_bsp/mcu/rx72n/register_access/iccrx/iodefine.h
typedef struct st_mtu5
{
    char wk0[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char NFCS : 2;
            unsigned char : 1;
            unsigned char NFWEN : 1;
            unsigned char NFVEN : 1;
            unsigned char NFUEN : 1;
        } BIT;
    } NFCR5;
    char wk1[ 490 ];
    unsigned short TCNTU;
    unsigned short TGRU;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 6;
            unsigned char TPSC : 2;
        } BIT;
    } TCRU;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char CKEG : 2;
            unsigned char TPSC2 : 3;
        } BIT;
    } TCR2U;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char IOC : 5;
        } BIT;
    } TIORU;
    char wk2[ 9 ];
    unsigned short TCNTV;
    unsigned short TGRV;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 6;
            unsigned char TPSC : 2;
        } BIT;
    } TCRV;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char CKEG : 2;
            unsigned char TPSC2 : 3;
        } BIT;
    } TCR2V;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char IOC : 5;
        } BIT;
    } TIORV;
    char wk3[ 9 ];
    unsigned short TCNTW;
    unsigned short TGRW;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 6;
            unsigned char TPSC : 2;
        } BIT;
    } TCRW;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char CKEG : 2;
            unsigned char TPSC2 : 3;
        } BIT;
    } TCR2W;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char IOC : 5;
        } BIT;
    } TIORW;
    char wk4[ 11 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char TGIE5U : 1;
            unsigned char TGIE5V : 1;
            unsigned char TGIE5W : 1;
        } BIT;
    } TIER;
    char wk5[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char CSTU5 : 1;
            unsigned char CSTV5 : 1;
            unsigned char CSTW5 : 1;
        } BIT;
    } TSTR;
    char wk6[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char CMPCLR5U : 1;
            unsigned char CMPCLR5V : 1;
            unsigned char CMPCLR5W : 1;
        } BIT;
    } TCNTCMPCLR;
} st_mtu5_t;

typedef struct st_mtu6
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CCLR : 3;
            unsigned char CKEG : 2;
            unsigned char TPSC : 3;
        } BIT;
    } TCR;
    char wk0[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char BFB : 1;
            unsigned char BFA : 1;
            unsigned char MD : 4;
        } BIT;
    } TMDR1;
    char wk1[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char IOB : 4;
            unsigned char IOA : 4;
        } BIT;
    } TIORH;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char IOD : 4;
            unsigned char IOC : 4;
        } BIT;
    } TIORL;
    char wk2[ 2 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TTGE : 1;
            unsigned char : 2;
            unsigned char TCIEV : 1;
            unsigned char TGIED : 1;
            unsigned char TGIEC : 1;
            unsigned char TGIEB : 1;
            unsigned char TGIEA : 1;
        } BIT;
    } TIER;
    char wk3[ 7 ];
    unsigned short TCNT;
    char wk4[ 6 ];
    unsigned short TGRA;
    unsigned short TGRB;
    char wk5[ 8 ];
    unsigned short TGRC;
    unsigned short TGRD;
    char wk6[ 4 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TCFD : 1;
            unsigned char : 7;
        } BIT;
    } TSR;
    char wk7[ 11 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 6;
            unsigned char TTSB : 1;
            unsigned char TTSA : 1;
        } BIT;
    } TBTM;
    char wk8[ 19 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char TPSC2 : 3;
        } BIT;
    } TCR2;
    char wk9[ 3 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CE0A : 1;
            unsigned char CE0B : 1;
            unsigned char CE0C : 1;
            unsigned char CE0D : 1;
            unsigned char CE1A : 1;
            unsigned char CE1B : 1;
            unsigned char CE2A : 1;
            unsigned char CE2B : 1;
        } BIT;
    } TSYCR;
    char wk10[ 33 ];
    unsigned short TGRE;
    char wk11[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char NFCS : 2;
            unsigned char NFDEN : 1;
            unsigned char NFCEN : 1;
            unsigned char NFBEN : 1;
            unsigned char NFAEN : 1;
        } BIT;
    } NFCR6;
} st_mtu6_t;

typedef struct st_mtu7
{
    char wk0[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CCLR : 3;
            unsigned char CKEG : 2;
            unsigned char TPSC : 3;
        } BIT;
    } TCR;
    char wk1[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char BFB : 1;
            unsigned char BFA : 1;
            unsigned char MD : 4;
        } BIT;
    } TMDR1;
    char wk2[ 2 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char IOB : 4;
            unsigned char IOA : 4;
        } BIT;
    } TIORH;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char IOD : 4;
            unsigned char IOC : 4;
        } BIT;
    } TIORL;
    char wk3[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TTGE : 1;
            unsigned char TTGE2 : 1;
            unsigned char : 1;
            unsigned char TCIEV : 1;
            unsigned char TGIED : 1;
            unsigned char TGIEC : 1;
            unsigned char TGIEB : 1;
            unsigned char TGIEA : 1;
        } BIT;
    } TIER;
    char wk4[ 8 ];
    unsigned short TCNT;
    char wk5[ 8 ];
    unsigned short TGRA;
    unsigned short TGRB;
    char wk6[ 8 ];
    unsigned short TGRC;
    unsigned short TGRD;
    char wk7[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TCFD : 1;
            unsigned char : 7;
        } BIT;
    } TSR;
    char wk8[ 11 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 6;
            unsigned char TTSB : 1;
            unsigned char TTSA : 1;
        } BIT;
    } TBTM;
    char wk9[ 6 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short BF : 2;
            unsigned short : 6;
            unsigned short UT7AE : 1;
            unsigned short DT7AE : 1;
            unsigned short UT7BE : 1;
            unsigned short DT7BE : 1;
            unsigned short ITA6AE : 1;
            unsigned short ITA7VE : 1;
            unsigned short ITB6AE : 1;
            unsigned short ITB7VE : 1;
        } BIT;
    } TADCR;
    char wk10[ 2 ];
    unsigned short TADCORA;
    unsigned short TADCORB;
    unsigned short TADCOBRA;
    unsigned short TADCOBRB;
    char wk11[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char TPSC2 : 3;
        } BIT;
    } TCR2;
    char wk12[ 38 ];
    unsigned short TGRE;
    unsigned short TGRF;
    char wk13[ 28 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char NFCS : 2;
            unsigned char NFDEN : 1;
            unsigned char NFCEN : 1;
            unsigned char NFBEN : 1;
            unsigned char NFAEN : 1;
        } BIT;
    } NFCR7;
} st_mtu7_t;

typedef struct st_mtu8
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char NFCS : 2;
            unsigned char NFDEN : 1;
            unsigned char NFCEN : 1;
            unsigned char NFBEN : 1;
            unsigned char NFAEN : 1;
        } BIT;
    } NFCR8;
    char wk0[ 871 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CCLR : 3;
            unsigned char CKEG : 2;
            unsigned char TPSC : 3;
        } BIT;
    } TCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char BFB : 1;
            unsigned char BFA : 1;
            unsigned char MD : 4;
        } BIT;
    } TMDR1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char IOB : 4;
            unsigned char IOA : 4;
        } BIT;
    } TIORH;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char IOD : 4;
            unsigned char IOC : 4;
        } BIT;
    } TIORL;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char TCIEV : 1;
            unsigned char TGIED : 1;
            unsigned char TGIEC : 1;
            unsigned char TGIEB : 1;
            unsigned char TGIEA : 1;
        } BIT;
    } TIER;
    char wk1[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char TPSC2 : 3;
        } BIT;
    } TCR2;
    char wk2[ 1 ];
    unsigned long TCNT;
    unsigned long TGRA;
    unsigned long TGRB;
    unsigned long TGRC;
    unsigned long TGRD;
} st_mtu8_t;

typedef struct st_ofsm
{
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 25;
            unsigned long BANKMD : 3;
            unsigned long : 1;
            unsigned long MDE : 3;
        } BIT;
    } MDE;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 3;
            unsigned long WDTRSTIRQS : 1;
            unsigned long WDTRPSS : 2;
            unsigned long WDTRPES : 2;
            unsigned long WDTCKS : 4;
            unsigned long WDTTOPS : 2;
            unsigned long WDTSTRT : 1;
            unsigned long : 2;
            unsigned long IWDTSLCSTP : 1;
            unsigned long : 1;
            unsigned long IWDTRSTIRQS : 1;
            unsigned long IWDTRPSS : 2;
            unsigned long IWDTRPES : 2;
            unsigned long IWDTCKS : 4;
            unsigned long IWDTTOPS : 2;
            unsigned long IWDTSTRT : 1;
            unsigned long : 1;
        } BIT;
    } OFS0;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 23;
            unsigned long HOCOEN : 1;
            unsigned long : 5;
            unsigned long LVDAS : 1;
            unsigned long VDSEL : 2;
        } BIT;
    } OFS1;
    char wk0[ 4 ];
    unsigned long TMINF;
    char wk1[ 12 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 29;
            unsigned long BANKSWP : 3;
        } BIT;
    } BANKSEL;
    char wk2[ 28 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 4;
            unsigned long SPE : 1;
            unsigned long : 27;
        } BIT;
    } SPCC;
    char wk3[ 4 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 1;
            unsigned long TMEFDB : 3;
            unsigned long : 1;
            unsigned long TMEF : 3;
            unsigned long : 24;
        } BIT;
    } TMEF;
    char wk4[ 4 ];
    union
    {
        struct
        {
            unsigned long ID4 : 8;
            unsigned long ID3 : 8;
            unsigned long ID2 : 8;
            unsigned long ID1 : 8;
            unsigned long ID8 : 8;
            unsigned long ID7 : 8;
            unsigned long ID6 : 8;
            unsigned long ID5 : 8;
            unsigned long ID12 : 8;
            unsigned long ID11 : 8;
            unsigned long ID10 : 8;
            unsigned long ID9 : 8;
            unsigned long ID16 : 8;
            unsigned long ID15 : 8;
            unsigned long ID14 : 8;
            unsigned long ID13 : 8;
        } BIT;
    } OSIS;
    char wk5[ 4 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long BTFLG : 1;
            unsigned long : 3;
            unsigned long FAWE : 12;
            unsigned long FSPR : 1;
            unsigned long : 3;
            unsigned long FAWS : 12;
        } BIT;
    } FAW;
    char wk6[ 8 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long CODE : 32;
        } BIT;
    } ROMCODE;
} st_ofsm_t;

