FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX700_RX72N_EnvisionKit_IAR_e2studio_EWRX/src/smc_gen/r_bsp/mcu/rx72n/register_access/iccrx/iodefine.h
typedef struct st_pdc
{
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 17;
            unsigned long EDS : 1;
            unsigned long PCKDIV : 3;
            unsigned long PCKOE : 1;
            unsigned long HERIE : 1;
            unsigned long VERIE : 1;
            unsigned long UDRIE : 1;
            unsigned long OVIE : 1;
            unsigned long FEIE : 1;
            unsigned long DFIE : 1;
            unsigned long PRST : 1;
            unsigned long HPS : 1;
            unsigned long VPS : 1;
            unsigned long PCKE : 1;
        } BIT;
    } PCCR0;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 31;
            unsigned long PCE : 1;
        } BIT;
    } PCCR1;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 25;
            unsigned long HERF : 1;
            unsigned long VERF : 1;
            unsigned long UDRF : 1;
            unsigned long OVRF : 1;
            unsigned long FEF : 1;
            unsigned long FEMPF : 1;
            unsigned long FBSY : 1;
        } BIT;
    } PCSR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 30;
            unsigned long HSYNC : 1;
            unsigned long VSYNC : 1;
        } BIT;
    } PCMONR;
    union
    {
        unsigned long LONG;
    } PCDR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 4;
            unsigned long VSZ : 12;
            unsigned long : 4;
            unsigned long VST : 12;
        } BIT;
    } VCR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 4;
            unsigned long HSZ : 12;
            unsigned long : 4;
            unsigned long HST : 12;
        } BIT;
    } HCR;
} st_pdc_t;

typedef struct st_pmgi
{
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 9;
            unsigned long PSMCT : 3;
            unsigned long : 1;
            unsigned long PSMHT : 3;
            unsigned long PSMDP : 1;
            unsigned long : 1;
            unsigned long PSMCS : 6;
            unsigned long : 8;
        } BIT;
    } PMGCR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long PRD : 16;
            unsigned long : 3;
            unsigned long PRA : 5;
            unsigned long PDA : 5;
            unsigned long : 1;
            unsigned long PSMAD : 1;
            unsigned long PSME : 1;
        } BIT;
    } PSMR;
} st_pmgi_t;

typedef struct st_poe
{
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 3;
            unsigned short POE0F : 1;
            unsigned short : 3;
            unsigned short PIE1 : 1;
            unsigned short : 6;
            unsigned short POE0M : 2;
        } BIT;
    } ICSR1;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short OSF1 : 1;
            unsigned short : 5;
            unsigned short OCE1 : 1;
            unsigned short OIE1 : 1;
            unsigned short : 8;
        } BIT;
    } OCSR1;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 3;
            unsigned short POE4F : 1;
            unsigned short : 3;
            unsigned short PIE2 : 1;
            unsigned short : 6;
            unsigned short POE4M : 2;
        } BIT;
    } ICSR2;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short OSF2 : 1;
            unsigned short : 5;
            unsigned short OCE2 : 1;
            unsigned short OIE2 : 1;
            unsigned short : 8;
        } BIT;
    } OCSR2;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 3;
            unsigned short POE8F : 1;
            unsigned short : 2;
            unsigned short POE8E : 1;
            unsigned short PIE3 : 1;
            unsigned short : 6;
            unsigned short POE8M : 2;
        } BIT;
    } ICSR3;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char MTUCH0HIZ : 1;
            unsigned char MTUCH67HIZ : 1;
            unsigned char MTUCH34HIZ : 1;
        } BIT;
    } SPOER;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 4;
            unsigned char MTU0DZE : 1;
            unsigned char MTU0CZE : 1;
            unsigned char MTU0BZE : 1;
            unsigned char MTU0AZE : 1;
        } BIT;
    } POECR1;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 5;
            unsigned short MTU3BDZE : 1;
            unsigned short MTU4ACZE : 1;
            unsigned short MTU4BDZE : 1;
            unsigned short : 5;
            unsigned short MTU6BDZE : 1;
            unsigned short MTU7ACZE : 1;
            unsigned short MTU7BDZE : 1;
        } BIT;
    } POECR2;
    char wk0[ 2 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 2;
            unsigned short IC5ADDMT67ZE : 1;
            unsigned short IC4ADDMT67ZE : 1;
            unsigned short IC3ADDMT67ZE : 1;
            unsigned short : 1;
            unsigned short IC1ADDMT67ZE : 1;
            unsigned short : 3;
            unsigned short IC5ADDMT34ZE : 1;
            unsigned short IC4ADDMT34ZE : 1;
            unsigned short IC3ADDMT34ZE : 1;
            unsigned short IC2ADDMT34ZE : 1;
            unsigned short : 2;
        } BIT;
    } POECR4;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 10;
            unsigned short IC5ADDMT0ZE : 1;
            unsigned short IC4ADDMT0ZE : 1;
            unsigned short : 1;
            unsigned short IC2ADDMT0ZE : 1;
            unsigned short IC1ADDMT0ZE : 1;
            unsigned short : 1;
        } BIT;
    } POECR5;
    char wk1[ 2 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 3;
            unsigned short POE10F : 1;
            unsigned short : 2;
            unsigned short POE10E : 1;
            unsigned short PIE4 : 1;
            unsigned short : 6;
            unsigned short POE10M : 2;
        } BIT;
    } ICSR4;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 3;
            unsigned short POE11F : 1;
            unsigned short : 2;
            unsigned short POE11E : 1;
            unsigned short PIE5 : 1;
            unsigned short : 6;
            unsigned short POE11M : 2;
        } BIT;
    } ICSR5;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 8;
            unsigned short OLSEN : 1;
            unsigned short : 1;
            unsigned short OLSG2B : 1;
            unsigned short OLSG2A : 1;
            unsigned short OLSG1B : 1;
            unsigned short OLSG1A : 1;
            unsigned short OLSG0B : 1;
            unsigned short OLSG0A : 1;
        } BIT;
    } ALR1;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 3;
            unsigned short OSTSTF : 1;
            unsigned short : 2;
            unsigned short OSTSTE : 1;
            unsigned short : 9;
        } BIT;
    } ICSR6;
    char wk2[ 6 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char M0BSEL : 4;
            unsigned char M0ASEL : 4;
        } BIT;
    } M0SELR1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char M0DSEL : 4;
            unsigned char M0CSEL : 4;
        } BIT;
    } M0SELR2;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char M3DSEL : 4;
            unsigned char M3BSEL : 4;
        } BIT;
    } M3SELR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char M4CSEL : 4;
            unsigned char M4ASEL : 4;
        } BIT;
    } M4SELR1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char M4DSEL : 4;
            unsigned char M4BSEL : 4;
        } BIT;
    } M4SELR2;
    char wk3[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char M6DSEL : 4;
            unsigned char M6BSEL : 4;
        } BIT;
    } M6SELR;
} st_poe_t;

typedef struct st_poeg
{
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long NFCS : 2;
            unsigned long NFEN : 1;
            unsigned long INV : 1;
            unsigned long : 11;
            unsigned long ST : 1;
            unsigned long : 9;
            unsigned long OSTPE : 1;
            unsigned long IOCE : 1;
            unsigned long PIDE : 1;
            unsigned long SSF : 1;
            unsigned long OSTPF : 1;
            unsigned long IOCF : 1;
            unsigned long PIDF : 1;
        } BIT;
    } POEGGA;
    char wk0[ 252 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long NFCS : 2;
            unsigned long NFEN : 1;
            unsigned long INV : 1;
            unsigned long : 11;
            unsigned long ST : 1;
            unsigned long : 9;
            unsigned long OSTPE : 1;
            unsigned long IOCE : 1;
            unsigned long PIDE : 1;
            unsigned long SSF : 1;
            unsigned long OSTPF : 1;
            unsigned long IOCF : 1;
            unsigned long PIDF : 1;
        } BIT;
    } POEGGB;
    char wk1[ 252 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long NFCS : 2;
            unsigned long NFEN : 1;
            unsigned long INV : 1;
            unsigned long : 11;
            unsigned long ST : 1;
            unsigned long : 9;
            unsigned long OSTPE : 1;
            unsigned long IOCE : 1;
            unsigned long PIDE : 1;
            unsigned long SSF : 1;
            unsigned long OSTPF : 1;
            unsigned long IOCF : 1;
            unsigned long PIDF : 1;
        } BIT;
    } POEGGC;
    char wk2[ 252 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long NFCS : 2;
            unsigned long NFEN : 1;
            unsigned long INV : 1;
            unsigned long : 11;
            unsigned long ST : 1;
            unsigned long : 9;
            unsigned long OSTPE : 1;
            unsigned long IOCE : 1;
            unsigned long PIDE : 1;
            unsigned long SSF : 1;
            unsigned long OSTPF : 1;
            unsigned long IOCF : 1;
            unsigned long PIDF : 1;
        } BIT;
    } POEGGD;
} st_poeg_t;

