FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX700_RX72N_EnvisionKit_IAR_e2studio_EWRX/src/smc_gen/r_bsp/mcu/rx72n/register_access/iccrx/iodefine.h
typedef struct st_port9
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        } BIT;
    } PDR;
    char wk0[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        } BIT;
    } PODR;
    char wk1[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        } BIT;
    } PIDR;
    char wk2[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        } BIT;
    } PMR;
    char wk3[ 40 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char B6 : 1;
            unsigned char : 1;
            unsigned char B4 : 1;
            unsigned char : 1;
            unsigned char B2 : 1;
            unsigned char : 1;
            unsigned char B0 : 1;
        } BIT;
    } ODR0;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char B6 : 1;
            unsigned char : 1;
            unsigned char B4 : 1;
            unsigned char : 1;
            unsigned char B2 : 1;
            unsigned char : 1;
            unsigned char B0 : 1;
        } BIT;
    } ODR1;
    char wk4[ 53 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        } BIT;
    } PCR;
    char wk5[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        } BIT;
    } DSCR;
    char wk6[ 71 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        } BIT;
    } DSCR2;
} st_port9_t;

typedef struct st_porta
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        } BIT;
    } PDR;
    char wk0[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        } BIT;
    } PODR;
    char wk1[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        } BIT;
    } PIDR;
    char wk2[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        } BIT;
    } PMR;
    char wk3[ 41 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char B6 : 1;
            unsigned char : 1;
            unsigned char B4 : 1;
            unsigned char : 1;
            unsigned char B2 : 1;
            unsigned char : 1;
            unsigned char B0 : 1;
        } BIT;
    } ODR0;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char B6 : 1;
            unsigned char : 1;
            unsigned char B4 : 1;
            unsigned char : 1;
            unsigned char B2 : 1;
            unsigned char : 1;
            unsigned char B0 : 1;
        } BIT;
    } ODR1;
    char wk4[ 52 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        } BIT;
    } PCR;
    char wk5[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        } BIT;
    } DSCR;
    char wk6[ 71 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7 : 1;
            unsigned char B6 : 1;
            unsigned char B5 : 1;
            unsigned char B4 : 1;
            unsigned char B3 : 1;
            unsigned char B2 : 1;
            unsigned char B1 : 1;
            unsigned char B0 : 1;
        } BIT;
    } DSCR2;
} st_porta_t;

