FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX700_RX72N_EnvisionKit_IAR_e2studio_EWRX/src/smc_gen/r_bsp/mcu/rx72n/register_access/iccrx/iodefine.h
typedef struct st_ppg1
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char PTRSL : 1;
        } BIT;
    } PTRSLR;
    char wk0[ 5 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char G3CMS : 2;
            unsigned char G2CMS : 2;
            unsigned char G1CMS : 2;
            unsigned char G0CMS : 2;
        } BIT;
    } PCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char G3INV : 1;
            unsigned char G2INV : 1;
            unsigned char G1INV : 1;
            unsigned char G0INV : 1;
            unsigned char G3NOV : 1;
            unsigned char G2NOV : 1;
            unsigned char G1NOV : 1;
            unsigned char G0NOV : 1;
        } BIT;
    } PMR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char NDER31 : 1;
            unsigned char NDER30 : 1;
            unsigned char NDER29 : 1;
            unsigned char NDER28 : 1;
            unsigned char NDER27 : 1;
            unsigned char NDER26 : 1;
            unsigned char NDER25 : 1;
            unsigned char NDER24 : 1;
        } BIT;
    } NDERH;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char NDER23 : 1;
            unsigned char NDER22 : 1;
            unsigned char NDER21 : 1;
            unsigned char NDER20 : 1;
            unsigned char NDER19 : 1;
            unsigned char NDER18 : 1;
            unsigned char NDER17 : 1;
            unsigned char NDER16 : 1;
        } BIT;
    } NDERL;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char POD31 : 1;
            unsigned char POD30 : 1;
            unsigned char POD29 : 1;
            unsigned char POD28 : 1;
            unsigned char POD27 : 1;
            unsigned char POD26 : 1;
            unsigned char POD25 : 1;
            unsigned char POD24 : 1;
        } BIT;
    } PODRH;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char POD23 : 1;
            unsigned char POD22 : 1;
            unsigned char POD21 : 1;
            unsigned char POD20 : 1;
            unsigned char POD19 : 1;
            unsigned char POD18 : 1;
            unsigned char POD17 : 1;
            unsigned char POD16 : 1;
        } BIT;
    } PODRL;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char NDR31 : 1;
            unsigned char NDR30 : 1;
            unsigned char NDR29 : 1;
            unsigned char NDR28 : 1;
            unsigned char NDR27 : 1;
            unsigned char NDR26 : 1;
            unsigned char NDR25 : 1;
            unsigned char NDR24 : 1;
        } BIT;
    } NDRH;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char NDR23 : 1;
            unsigned char NDR22 : 1;
            unsigned char NDR21 : 1;
            unsigned char NDR20 : 1;
            unsigned char NDR19 : 1;
            unsigned char NDR18 : 1;
            unsigned char NDR17 : 1;
            unsigned char NDR16 : 1;
        } BIT;
    } NDRL;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 4;
            unsigned char NDR27 : 1;
            unsigned char NDR26 : 1;
            unsigned char NDR25 : 1;
            unsigned char NDR24 : 1;
        } BIT;
    } NDRH2;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 4;
            unsigned char NDR19 : 1;
            unsigned char NDR18 : 1;
            unsigned char NDR17 : 1;
            unsigned char NDR16 : 1;
        } BIT;
    } NDRL2;
} st_ppg1_t;

typedef struct st_ptpedmac
{
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 25;
            unsigned long DE : 1;
            unsigned long DL : 2;
            unsigned long : 3;
            unsigned long SWR : 1;
        } BIT;
    } EDMR;
    char wk0[ 4 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 31;
            unsigned long TR : 1;
        } BIT;
    } EDTRR;
    char wk1[ 4 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 31;
            unsigned long RR : 1;
        } BIT;
    } EDRRR;
    char wk2[ 4 ];
    void * TDLAR;
    char wk3[ 4 ];
    void * RDLAR;
    char wk4[ 4 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 1;
            unsigned long TWB : 1;
            unsigned long : 3;
            unsigned long TABT : 1;
            unsigned long : 1;
            unsigned long RFCOF : 1;
            unsigned long : 2;
            unsigned long TC : 1;
            unsigned long TDE : 1;
            unsigned long TFUF : 1;
            unsigned long FR : 1;
            unsigned long RDE : 1;
            unsigned long RFOF : 1;
            unsigned long : 7;
            unsigned long MACE : 1;
            unsigned long RPORT : 1;
            unsigned long : 2;
            unsigned long PVER : 1;
            unsigned long TYPE : 4;
        } BIT;
    } EESR;
    char wk5[ 4 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 1;
            unsigned long TWBIP : 1;
            unsigned long : 3;
            unsigned long TABTIP : 1;
            unsigned long : 1;
            unsigned long RFCOFIP : 1;
            unsigned long : 2;
            unsigned long TCIP : 1;
            unsigned long TDEIP : 1;
            unsigned long TFUFIP : 1;
            unsigned long FRIP : 1;
            unsigned long RDEIP : 1;
            unsigned long RFOFIP : 1;
            unsigned long : 7;
            unsigned long MACEIP : 1;
            unsigned long RPORTIP : 1;
            unsigned long : 2;
            unsigned long PVERIP : 1;
            unsigned long : 4;
        } BIT;
    } EESIPR;
    char wk6[ 12 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 16;
            unsigned long MFC : 16;
        } BIT;
    } RMFCR;
    char wk7[ 4 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 21;
            unsigned long TFT : 11;
        } BIT;
    } TFTR;
    char wk8[ 4 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 19;
            unsigned long TFD : 5;
            unsigned long : 3;
            unsigned long RFD : 5;
        } BIT;
    } FDR;
    char wk9[ 4 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 31;
            unsigned long RNR : 1;
        } BIT;
    } RMCR;
    char wk10[ 8 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 16;
            unsigned long UNDER : 16;
        } BIT;
    } TFUCR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 16;
            unsigned long OVER : 16;
        } BIT;
    } RFOCR;
    char wk11[ 4 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 13;
            unsigned long RFFO : 3;
            unsigned long : 13;
            unsigned long RFDO : 3;
        } BIT;
    } FCFTR;
    char wk12[ 4 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 14;
            unsigned long PADS : 2;
            unsigned long : 10;
            unsigned long PADR : 6;
        } BIT;
    } RPADIR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 27;
            unsigned long TIM : 1;
            unsigned long : 3;
            unsigned long TIS : 1;
        } BIT;
    } TRIMD;
    char wk13[ 72 ];
    void * RBWAR;
    void * RDFAR;
    char wk14[ 4 ];
    void * TBRAR;
    void * TDFAR;
} st_ptpedmac_t;

