FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX700_RX72N_EnvisionKit_IAR_e2studio_EWRX/src/smc_gen/r_bsp/mcu/rx72n/register_access/iccrx/iodefine.h
typedef struct st_s12ad
{
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short ADST : 1;
            unsigned short ADCS : 2;
            unsigned short ADIE : 1;
            unsigned short : 2;
            unsigned short TRGE : 1;
            unsigned short EXTRG : 1;
            unsigned short DBLE : 1;
            unsigned short GBADIE : 1;
            unsigned short : 1;
            unsigned short DBLANS : 5;
        } BIT;
    } ADCSR;
    char wk0[ 2 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 8;
            unsigned short ANSA007 : 1;
            unsigned short ANSA006 : 1;
            unsigned short ANSA005 : 1;
            unsigned short ANSA004 : 1;
            unsigned short ANSA003 : 1;
            unsigned short ANSA002 : 1;
            unsigned short ANSA001 : 1;
            unsigned short ANSA000 : 1;
        } BIT;
    } ADANSA0;
    char wk1[ 2 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 8;
            unsigned short ADS007 : 1;
            unsigned short ADS006 : 1;
            unsigned short ADS005 : 1;
            unsigned short ADS004 : 1;
            unsigned short ADS003 : 1;
            unsigned short ADS002 : 1;
            unsigned short ADS001 : 1;
            unsigned short ADS000 : 1;
        } BIT;
    } ADADS0;
    char wk2[ 2 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char AVEE : 1;
            unsigned char : 4;
            unsigned char ADC : 3;
        } BIT;
    } ADADC;
    char wk3[ 1 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short ADRFMT : 1;
            unsigned short : 3;
            unsigned short DIAGM : 1;
            unsigned short DIAGLD : 1;
            unsigned short DIAGVAL : 2;
            unsigned short : 2;
            unsigned short ACE : 1;
            unsigned short : 2;
            unsigned short ADPRC : 2;
            unsigned short : 1;
        } BIT;
    } ADCER;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 2;
            unsigned short TRSA : 6;
            unsigned short : 2;
            unsigned short TRSB : 6;
        } BIT;
    } ADSTRGR;
    char wk4[ 2 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 8;
            unsigned short ANSB007 : 1;
            unsigned short ANSB006 : 1;
            unsigned short ANSB005 : 1;
            unsigned short ANSB004 : 1;
            unsigned short ANSB003 : 1;
            unsigned short ANSB002 : 1;
            unsigned short ANSB001 : 1;
            unsigned short ANSB000 : 1;
        } BIT;
    } ADANSB0;
    char wk5[ 2 ];
    union
    {
        unsigned short WORD;
    } ADDBLDR;
    char wk6[ 4 ];
    union
    {
        unsigned short WORD;
        union
        {
            struct
            {
                unsigned short DIAGST : 2;
                unsigned short : 2;
                unsigned short AD : 12;
            } RIGHT;
            struct
            {
                unsigned short AD : 12;
                unsigned short : 2;
                unsigned short DIAGST : 2;
            } LEFT;
        } BIT;
    } ADRD;
    unsigned short ADDR0;
    unsigned short ADDR1;
    unsigned short ADDR2;
    unsigned short ADDR3;
    unsigned short ADDR4;
    unsigned short ADDR5;
    unsigned short ADDR6;
    unsigned short ADDR7;
    char wk7[ 51 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 6;
            unsigned char PRO : 2;
        } BIT;
    } ADSAMPR;
    char wk8[ 2 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 5;
            unsigned short SHANS : 3;
            unsigned short SSTSH : 8;
        } BIT;
    } ADSHCR;
    char wk9[ 6 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 10;
            unsigned short SAM : 1;
            unsigned short : 5;
        } BIT;
    } ADSAM;
    char wk10[ 10 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char ADNDIS : 5;
        } BIT;
    } ADDISCR;
    char wk11[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char SHMD : 1;
        } BIT;
    } ADSHMSR;
    char wk12[ 3 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short GBRP : 1;
            unsigned short LGRRS : 1;
            unsigned short : 12;
            unsigned short GBRSCN : 1;
            unsigned short PGS : 1;
        } BIT;
    } ADGSPCR;
    char wk13[ 2 ];
    unsigned short ADDBLDRA;
    unsigned short ADDBLDRB;
    char wk14[ 4 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char MONCMPB : 1;
            unsigned char MONCMPA : 1;
            unsigned char : 3;
            unsigned char MONCOMB : 1;
        } BIT;
    } ADWINMON;
    char wk15[ 3 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short CMPAIE : 1;
            unsigned short WCMPE : 1;
            unsigned short CMPBIE : 1;
            unsigned short : 1;
            unsigned short CMPAE : 1;
            unsigned short : 1;
            unsigned short CMPBE : 1;
            unsigned short : 7;
            unsigned short CMPAB : 2;
        } BIT;
    } ADCMPCR;
    char wk16[ 2 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 8;
            unsigned short CMPCHA007 : 1;
            unsigned short CMPCHA006 : 1;
            unsigned short CMPCHA005 : 1;
            unsigned short CMPCHA004 : 1;
            unsigned short CMPCHA003 : 1;
            unsigned short CMPCHA002 : 1;
            unsigned short CMPCHA001 : 1;
            unsigned short CMPCHA000 : 1;
        } BIT;
    } ADCMPANSR0;
    char wk17[ 2 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 8;
            unsigned short CMPLCHA007 : 1;
            unsigned short CMPLCHA006 : 1;
            unsigned short CMPLCHA005 : 1;
            unsigned short CMPLCHA004 : 1;
            unsigned short CMPLCHA003 : 1;
            unsigned short CMPLCHA002 : 1;
            unsigned short CMPLCHA001 : 1;
            unsigned short CMPLCHA000 : 1;
        } BIT;
    } ADCMPLR0;
    char wk18[ 2 ];
    unsigned short ADCMPDR0;
    unsigned short ADCMPDR1;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 8;
            unsigned short CMPSTCHA007 : 1;
            unsigned short CMPSTCHA006 : 1;
            unsigned short CMPSTCHA005 : 1;
            unsigned short CMPSTCHA004 : 1;
            unsigned short CMPSTCHA003 : 1;
            unsigned short CMPSTCHA002 : 1;
            unsigned short CMPSTCHA001 : 1;
            unsigned short CMPSTCHA000 : 1;
        } BIT;
    } ADCMPSR0;
    char wk19[ 4 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CMPLB : 1;
            unsigned char : 1;
            unsigned char CMPCHB : 6;
        } BIT;
    } ADCMPBNSR;
    char wk20[ 1 ];
    unsigned short ADWINLLB;
    unsigned short ADWINULB;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char CMPSTB : 1;
        } BIT;
    } ADCMPBSR;
    char wk21[ 39 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 8;
            unsigned short ANSC007 : 1;
            unsigned short ANSC006 : 1;
            unsigned short ANSC005 : 1;
            unsigned short ANSC004 : 1;
            unsigned short ANSC003 : 1;
            unsigned short ANSC002 : 1;
            unsigned short ANSC001 : 1;
            unsigned short ANSC000 : 1;
        } BIT;
    } ADANSC0;
    char wk22[ 3 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char GRCE : 1;
            unsigned char GCADIE : 1;
            unsigned char TRSC : 6;
        } BIT;
    } ADGCTRGR;
    char wk23[ 6 ];
    unsigned char ADSSTR0;
    unsigned char ADSSTR1;
    unsigned char ADSSTR2;
    unsigned char ADSSTR3;
    unsigned char ADSSTR4;
    unsigned char ADSSTR5;
    unsigned char ADSSTR6;
    unsigned char ADSSTR7;
} st_s12ad_t;

