FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX700_RX72N_EnvisionKit_IAR_e2studio_EWRX/src/smc_gen/r_bsp/mcu/rx72n/register_access/iccrx/iodefine.h
typedef struct st_s12ad1
{
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short ADST : 1;
            unsigned short ADCS : 2;
            unsigned short ADIE : 1;
            unsigned short : 2;
            unsigned short TRGE : 1;
            unsigned short EXTRG : 1;
            unsigned short DBLE : 1;
            unsigned short GBADIE : 1;
            unsigned short : 1;
            unsigned short DBLANS : 5;
        } BIT;
    } ADCSR;
    char wk0[ 2 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short ANSA015 : 1;
            unsigned short ANSA014 : 1;
            unsigned short ANSA013 : 1;
            unsigned short ANSA012 : 1;
            unsigned short ANSA011 : 1;
            unsigned short ANSA010 : 1;
            unsigned short ANSA009 : 1;
            unsigned short ANSA008 : 1;
            unsigned short ANSA007 : 1;
            unsigned short ANSA006 : 1;
            unsigned short ANSA005 : 1;
            unsigned short ANSA004 : 1;
            unsigned short ANSA003 : 1;
            unsigned short ANSA002 : 1;
            unsigned short ANSA001 : 1;
            unsigned short ANSA000 : 1;
        } BIT;
    } ADANSA0;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 11;
            unsigned short ANSA104 : 1;
            unsigned short ANSA103 : 1;
            unsigned short ANSA102 : 1;
            unsigned short ANSA101 : 1;
            unsigned short ANSA100 : 1;
        } BIT;
    } ADANSA1;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short ADS015 : 1;
            unsigned short ADS014 : 1;
            unsigned short ADS013 : 1;
            unsigned short ADS012 : 1;
            unsigned short ADS011 : 1;
            unsigned short ADS010 : 1;
            unsigned short ADS009 : 1;
            unsigned short ADS008 : 1;
            unsigned short ADS007 : 1;
            unsigned short ADS006 : 1;
            unsigned short ADS005 : 1;
            unsigned short ADS004 : 1;
            unsigned short ADS003 : 1;
            unsigned short ADS002 : 1;
            unsigned short ADS001 : 1;
            unsigned short ADS000 : 1;
        } BIT;
    } ADADS0;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 11;
            unsigned short ADS104 : 1;
            unsigned short ADS103 : 1;
            unsigned short ADS102 : 1;
            unsigned short ADS101 : 1;
            unsigned short ADS100 : 1;
        } BIT;
    } ADADS1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char AVEE : 1;
            unsigned char : 4;
            unsigned char ADC : 3;
        } BIT;
    } ADADC;
    char wk1[ 1 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short ADRFMT : 1;
            unsigned short : 3;
            unsigned short DIAGM : 1;
            unsigned short DIAGLD : 1;
            unsigned short DIAGVAL : 2;
            unsigned short : 2;
            unsigned short ACE : 1;
            unsigned short : 2;
            unsigned short ADPRC : 2;
            unsigned short : 1;
        } BIT;
    } ADCER;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 2;
            unsigned short TRSA : 6;
            unsigned short : 2;
            unsigned short TRSB : 6;
        } BIT;
    } ADSTRGR;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short EXOEN : 1;
            unsigned short EXSEL : 2;
            unsigned short : 1;
            unsigned short OCSB : 1;
            unsigned short TSSB : 1;
            unsigned short OCSA : 1;
            unsigned short TSSA : 1;
            unsigned short : 6;
            unsigned short OCSAD : 1;
            unsigned short TSSAD : 1;
        } BIT;
    } ADEXICR;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short ANSB015 : 1;
            unsigned short ANSB014 : 1;
            unsigned short ANSB013 : 1;
            unsigned short ANSB012 : 1;
            unsigned short ANSB011 : 1;
            unsigned short ANSB010 : 1;
            unsigned short ANSB009 : 1;
            unsigned short ANSB008 : 1;
            unsigned short ANSB007 : 1;
            unsigned short ANSB006 : 1;
            unsigned short ANSB005 : 1;
            unsigned short ANSB004 : 1;
            unsigned short ANSB003 : 1;
            unsigned short ANSB002 : 1;
            unsigned short ANSB001 : 1;
            unsigned short ANSB000 : 1;
        } BIT;
    } ADANSB0;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 11;
            unsigned short ANSB104 : 1;
            unsigned short ANSB103 : 1;
            unsigned short ANSB102 : 1;
            unsigned short ANSB101 : 1;
            unsigned short ANSB100 : 1;
        } BIT;
    } ADANSB1;
    unsigned short ADDBLDR;
    unsigned short ADTSDR;
    unsigned short ADOCDR;
    union
    {
        unsigned short WORD;
        union
        {
            struct
            {
                unsigned short DIAGST : 2;
                unsigned short : 2;
                unsigned short AD : 12;
            } RIGHT;
            struct
            {
                unsigned short AD : 12;
                unsigned short : 2;
                unsigned short DIAGST : 2;
            } LEFT;
        } BIT;
    } ADRD;
    unsigned short ADDR0;
    unsigned short ADDR1;
    unsigned short ADDR2;
    unsigned short ADDR3;
    unsigned short ADDR4;
    unsigned short ADDR5;
    unsigned short ADDR6;
    unsigned short ADDR7;
    unsigned short ADDR8;
    unsigned short ADDR9;
    unsigned short ADDR10;
    unsigned short ADDR11;
    unsigned short ADDR12;
    unsigned short ADDR13;
    unsigned short ADDR14;
    unsigned short ADDR15;
    unsigned short ADDR16;
    unsigned short ADDR17;
    unsigned short ADDR18;
    unsigned short ADDR19;
    unsigned short ADDR20;
    char wk2[ 25 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 6;
            unsigned char PRO : 2;
        } BIT;
    } ADSAMPR;
    char wk3[ 10 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 10;
            unsigned short SAM : 1;
            unsigned short : 5;
        } BIT;
    } ADSAM;
    char wk4[ 10 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char ADNDIS : 5;
        } BIT;
    } ADDISCR;
    char wk5[ 5 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short GBRP : 1;
            unsigned short LGRRS : 1;
            unsigned short : 12;
            unsigned short GBRSCN : 1;
            unsigned short PGS : 1;
        } BIT;
    } ADGSPCR;
    char wk6[ 2 ];
    unsigned short ADDBLDRA;
    unsigned short ADDBLDRB;
    char wk7[ 4 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char MONCMPB : 1;
            unsigned char MONCMPA : 1;
            unsigned char : 3;
            unsigned char MONCOMB : 1;
        } BIT;
    } ADWINMON;
    char wk8[ 3 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short CMPAIE : 1;
            unsigned short WCMPE : 1;
            unsigned short CMPBIE : 1;
            unsigned short : 1;
            unsigned short CMPAE : 1;
            unsigned short : 1;
            unsigned short CMPBE : 1;
            unsigned short : 7;
            unsigned short CMPAB : 2;
        } BIT;
    } ADCMPCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 6;
            unsigned char CMPSOC : 1;
            unsigned char CMPSTS : 1;
        } BIT;
    } ADCMPANSER;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 6;
            unsigned char CMPLOC : 1;
            unsigned char CMPLTS : 1;
        } BIT;
    } ADCMPLER;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short CMPCHA015 : 1;
            unsigned short CMPCHA014 : 1;
            unsigned short CMPCHA013 : 1;
            unsigned short CMPCHA012 : 1;
            unsigned short CMPCHA011 : 1;
            unsigned short CMPCHA010 : 1;
            unsigned short CMPCHA009 : 1;
            unsigned short CMPCHA008 : 1;
            unsigned short CMPCHA007 : 1;
            unsigned short CMPCHA006 : 1;
            unsigned short CMPCHA005 : 1;
            unsigned short CMPCHA004 : 1;
            unsigned short CMPCHA003 : 1;
            unsigned short CMPCHA002 : 1;
            unsigned short CMPCHA001 : 1;
            unsigned short CMPCHA000 : 1;
        } BIT;
    } ADCMPANSR0;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 11;
            unsigned short CMPCHA104 : 1;
            unsigned short CMPCHA103 : 1;
            unsigned short CMPCHA102 : 1;
            unsigned short CMPCHA101 : 1;
            unsigned short CMPCHA100 : 1;
        } BIT;
    } ADCMPANSR1;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short CMPLCHA015 : 1;
            unsigned short CMPLCHA014 : 1;
            unsigned short CMPLCHA013 : 1;
            unsigned short CMPLCHA012 : 1;
            unsigned short CMPLCHA011 : 1;
            unsigned short CMPLCHA010 : 1;
            unsigned short CMPLCHA009 : 1;
            unsigned short CMPLCHA008 : 1;
            unsigned short CMPLCHA007 : 1;
            unsigned short CMPLCHA006 : 1;
            unsigned short CMPLCHA005 : 1;
            unsigned short CMPLCHA004 : 1;
            unsigned short CMPLCHA003 : 1;
            unsigned short CMPLCHA002 : 1;
            unsigned short CMPLCHA001 : 1;
            unsigned short CMPLCHA000 : 1;
        } BIT;
    } ADCMPLR0;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 11;
            unsigned short CMPLCHA104 : 1;
            unsigned short CMPLCHA103 : 1;
            unsigned short CMPLCHA102 : 1;
            unsigned short CMPLCHA101 : 1;
            unsigned short CMPLCHA100 : 1;
        } BIT;
    } ADCMPLR1;
    unsigned short ADCMPDR0;
    unsigned short ADCMPDR1;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short CMPSTCHA015 : 1;
            unsigned short CMPSTCHA014 : 1;
            unsigned short CMPSTCHA013 : 1;
            unsigned short CMPSTCHA012 : 1;
            unsigned short CMPSTCHA011 : 1;
            unsigned short CMPSTCHA010 : 1;
            unsigned short CMPSTCHA009 : 1;
            unsigned short CMPSTCHA008 : 1;
            unsigned short CMPSTCHA007 : 1;
            unsigned short CMPSTCHA006 : 1;
            unsigned short CMPSTCHA005 : 1;
            unsigned short CMPSTCHA004 : 1;
            unsigned short CMPSTCHA003 : 1;
            unsigned short CMPSTCHA002 : 1;
            unsigned short CMPSTCHA001 : 1;
            unsigned short CMPSTCHA000 : 1;
        } BIT;
    } ADCMPSR0;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 11;
            unsigned short CMPSTCHA104 : 1;
            unsigned short CMPSTCHA103 : 1;
            unsigned short CMPSTCHA102 : 1;
            unsigned short CMPSTCHA101 : 1;
            unsigned short CMPSTCHA100 : 1;
        } BIT;
    } ADCMPSR1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 6;
            unsigned char CMPFOC : 1;
            unsigned char CMPFTS : 1;
        } BIT;
    } ADCMPSER;
    char wk9[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CMPLB : 1;
            unsigned char : 1;
            unsigned char CMPCHB : 6;
        } BIT;
    } ADCMPBNSR;
    char wk10[ 1 ];
    unsigned short ADWINLLB;
    unsigned short ADWINULB;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char CMPSTB : 1;
        } BIT;
    } ADCMPBSR;
    char wk11[ 39 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short ANSC015 : 1;
            unsigned short ANSC014 : 1;
            unsigned short ANSC013 : 1;
            unsigned short ANSC012 : 1;
            unsigned short ANSC011 : 1;
            unsigned short ANSC010 : 1;
            unsigned short ANSC009 : 1;
            unsigned short ANSC008 : 1;
            unsigned short ANSC007 : 1;
            unsigned short ANSC006 : 1;
            unsigned short ANSC005 : 1;
            unsigned short ANSC004 : 1;
            unsigned short ANSC003 : 1;
            unsigned short ANSC002 : 1;
            unsigned short ANSC001 : 1;
            unsigned short ANSC000 : 1;
        } BIT;
    } ADANSC0;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 11;
            unsigned short ANSC104 : 1;
            unsigned short ANSC103 : 1;
            unsigned short ANSC102 : 1;
            unsigned short ANSC101 : 1;
            unsigned short ANSC100 : 1;
        } BIT;
    } ADANSC1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 6;
            unsigned char OCSC : 1;
            unsigned char TSSC : 1;
        } BIT;
    } ADGCEXCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char GRCE : 1;
            unsigned char GCADIE : 1;
            unsigned char TRSC : 6;
        } BIT;
    } ADGCTRGR;
    char wk12[ 3 ];
    unsigned char ADSSTRL;
    unsigned char ADSSTRT;
    unsigned char ADSSTRO;
    unsigned char ADSSTR0;
    unsigned char ADSSTR1;
    unsigned char ADSSTR2;
    unsigned char ADSSTR3;
    unsigned char ADSSTR4;
    unsigned char ADSSTR5;
    unsigned char ADSSTR6;
    unsigned char ADSSTR7;
    unsigned char ADSSTR8;
    unsigned char ADSSTR9;
    unsigned char ADSSTR10;
    unsigned char ADSSTR11;
    unsigned char ADSSTR12;
    unsigned char ADSSTR13;
    unsigned char ADSSTR14;
    unsigned char ADSSTR15;
} st_s12ad1_t;

typedef struct st_sci0
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CM : 1;
            unsigned char CHR : 1;
            unsigned char PE : 1;
            unsigned char PM : 1;
            unsigned char STOP : 1;
            unsigned char MP : 1;
            unsigned char CKS : 2;
        } BIT;
    } SMR;
    unsigned char BRR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TIE : 1;
            unsigned char RIE : 1;
            unsigned char TE : 1;
            unsigned char RE : 1;
            unsigned char MPIE : 1;
            unsigned char TEIE : 1;
            unsigned char CKE : 2;
        } BIT;
    } SCR;
    unsigned char TDR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TDRE : 1;
            unsigned char RDRF : 1;
            unsigned char ORER : 1;
            unsigned char FER : 1;
            unsigned char PER : 1;
            unsigned char TEND : 1;
            unsigned char MPB : 1;
            unsigned char MPBT : 1;
        } BIT;
    } SSR;
    unsigned char RDR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char BCP2 : 1;
            unsigned char : 2;
            unsigned char CHR1 : 1;
            unsigned char SDIR : 1;
            unsigned char SINV : 1;
            unsigned char : 1;
            unsigned char SMIF : 1;
        } BIT;
    } SCMR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char RXDESEL : 1;
            unsigned char BGDM : 1;
            unsigned char NFEN : 1;
            unsigned char ABCS : 1;
            unsigned char ABCSE : 1;
            unsigned char BRME : 1;
            unsigned char : 1;
            unsigned char ACS0 : 1;
        } BIT;
    } SEMR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char NFCS : 3;
        } BIT;
    } SNFR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char IICDL : 5;
            unsigned char : 2;
            unsigned char IICM : 1;
        } BIT;
    } SIMR1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char IICACKT : 1;
            unsigned char : 3;
            unsigned char IICCSC : 1;
            unsigned char IICINTM : 1;
        } BIT;
    } SIMR2;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char IICSCLS : 2;
            unsigned char IICSDAS : 2;
            unsigned char IICSTIF : 1;
            unsigned char IICSTPREQ : 1;
            unsigned char IICRSTAREQ : 1;
            unsigned char IICSTAREQ : 1;
        } BIT;
    } SIMR3;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char IICACKR : 1;
        } BIT;
    } SISR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CKPH : 1;
            unsigned char CKPOL : 1;
            unsigned char : 1;
            unsigned char MFF : 1;
            unsigned char : 1;
            unsigned char MSS : 1;
            unsigned char CTSE : 1;
            unsigned char SSE : 1;
        } BIT;
    } SPMR;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned char TDRH;
            unsigned char TDRL;
        } BYTE;
    } TDRHL;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned char RDRH;
            unsigned char RDRL;
        } BYTE;
    } RDRHL;
    unsigned char MDDR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char DCME : 1;
            unsigned char IDSEL : 1;
            unsigned char : 1;
            unsigned char DFER : 1;
            unsigned char DPER : 1;
            unsigned char : 2;
            unsigned char DCMF : 1;
        } BIT;
    } DCCR;
    char wk0[ 6 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned char H;
            unsigned char L;
        } BYTE;
        struct
        {
            unsigned short : 7;
            unsigned short CMPD : 9;
        } BIT;
    } CDR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char SPB2IO : 1;
            unsigned char SPB2DT : 1;
            unsigned char RXDMON : 1;
        } BIT;
    } SPTR;
} st_sci0_t;

