FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX700_RX72N_EnvisionKit_IAR_e2studio_EWRX/src/smc_gen/r_bsp/mcu/rx72n/register_access/iccrx/iodefine.h
typedef struct st_sci7
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CM : 1;
            unsigned char CHR : 1;
            unsigned char PE : 1;
            unsigned char PM : 1;
            unsigned char STOP : 1;
            unsigned char MP : 1;
            unsigned char CKS : 2;
        } BIT;
    } SMR;
    unsigned char BRR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TIE : 1;
            unsigned char RIE : 1;
            unsigned char TE : 1;
            unsigned char RE : 1;
            unsigned char MPIE : 1;
            unsigned char TEIE : 1;
            unsigned char CKE : 2;
        } BIT;
    } SCR;
    unsigned char TDR;
    union
    {
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char TDRE : 1;
                unsigned char RDRF : 1;
                unsigned char ORER : 1;
                unsigned char FER : 1;
                unsigned char PER : 1;
                unsigned char TEND : 1;
                unsigned char MPB : 1;
                unsigned char MPBT : 1;
            } BIT;
        } SSR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char TDFE : 1;
                unsigned char RDF : 1;
                unsigned char ORER : 1;
                unsigned char FER : 1;
                unsigned char PER : 1;
                unsigned char TEND : 1;
                unsigned char : 1;
                unsigned char DR : 1;
            } BIT;
        } SSRFIFO;
    };
    unsigned char RDR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char BCP2 : 1;
            unsigned char : 2;
            unsigned char CHR1 : 1;
            unsigned char SDIR : 1;
            unsigned char SINV : 1;
            unsigned char : 1;
            unsigned char SMIF : 1;
        } BIT;
    } SCMR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char RXDESEL : 1;
            unsigned char BGDM : 1;
            unsigned char NFEN : 1;
            unsigned char ABCS : 1;
            unsigned char ABCSE : 1;
            unsigned char BRME : 1;
            unsigned char : 1;
            unsigned char ACS0 : 1;
        } BIT;
    } SEMR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char NFCS : 3;
        } BIT;
    } SNFR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char IICDL : 5;
            unsigned char : 2;
            unsigned char IICM : 1;
        } BIT;
    } SIMR1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char IICACKT : 1;
            unsigned char : 3;
            unsigned char IICCSC : 1;
            unsigned char IICINTM : 1;
        } BIT;
    } SIMR2;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char IICSCLS : 2;
            unsigned char IICSDAS : 2;
            unsigned char IICSTIF : 1;
            unsigned char IICSTPREQ : 1;
            unsigned char IICRSTAREQ : 1;
            unsigned char IICSTAREQ : 1;
        } BIT;
    } SIMR3;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char IICACKR : 1;
        } BIT;
    } SISR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CKPH : 1;
            unsigned char CKPOL : 1;
            unsigned char : 1;
            unsigned char MFF : 1;
            unsigned char : 1;
            unsigned char MSS : 1;
            unsigned char CTSE : 1;
            unsigned char SSE : 1;
        } BIT;
    } SPMR;
    union
    {
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned char TDRH;
                unsigned char TDRL;
            } BYTE;
        } TDRHL;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned char H;
                unsigned char L;
            } BYTE;
            struct
            {
                unsigned short : 6;
                unsigned short MPBT : 1;
                unsigned short TDAT : 9;
            } BIT;
        } FTDR;
    };
    union
    {
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned char RDRH;
                unsigned char RDRL;
            } BYTE;
        } RDRHL;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned char H;
                unsigned char L;
            } BYTE;
            struct
            {
                unsigned short : 1;
                unsigned short RDF : 1;
                unsigned short ORER : 1;
                unsigned short FER : 1;
                unsigned short PER : 1;
                unsigned short DR : 1;
                unsigned short MPB : 1;
                unsigned short RDAT : 9;
            } BIT;
        } FRDR;
    };
    unsigned char MDDR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char DCME : 1;
            unsigned char IDSEL : 1;
            unsigned char : 1;
            unsigned char DFER : 1;
            unsigned char DPER : 1;
            unsigned char : 2;
            unsigned char DCMF : 1;
        } BIT;
    } DCCR;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned char H;
            unsigned char L;
        } BYTE;
        struct
        {
            unsigned char RSTRG : 4;
            unsigned char RTRG : 4;
            unsigned char TTRG : 4;
            unsigned char DRES : 1;
            unsigned char TFRST : 1;
            unsigned char RFRST : 1;
            unsigned char FM : 1;
        } BIT;
    } FCR;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned char H;
            unsigned char L;
        } BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char T : 5;
            unsigned char : 3;
            unsigned char R : 5;
        } BIT;
    } FDR;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned char H;
            unsigned char L;
        } BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char PNUM : 5;
            unsigned char : 1;
            unsigned char FNUM : 5;
            unsigned char : 1;
            unsigned char ORER : 1;
        } BIT;
    } LSR;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned char H;
            unsigned char L;
        } BYTE;
        struct
        {
            unsigned short : 7;
            unsigned short CMPD : 9;
        } BIT;
    } CDR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char SPB2IO : 1;
            unsigned char SPB2DT : 1;
            unsigned char RXDMON : 1;
        } BIT;
    } SPTR;
} st_sci7_t;

typedef struct st_sci12
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CM : 1;
            unsigned char CHR : 1;
            unsigned char PE : 1;
            unsigned char PM : 1;
            unsigned char STOP : 1;
            unsigned char MP : 1;
            unsigned char CKS : 2;
        } BIT;
    } SMR;
    unsigned char BRR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TIE : 1;
            unsigned char RIE : 1;
            unsigned char TE : 1;
            unsigned char RE : 1;
            unsigned char MPIE : 1;
            unsigned char TEIE : 1;
            unsigned char CKE : 2;
        } BIT;
    } SCR;
    unsigned char TDR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TDRE : 1;
            unsigned char RDRF : 1;
            unsigned char ORER : 1;
            unsigned char FER : 1;
            unsigned char PER : 1;
            unsigned char TEND : 1;
            unsigned char MPB : 1;
            unsigned char MPBT : 1;
        } BIT;
    } SSR;
    unsigned char RDR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char BCP2 : 1;
            unsigned char : 2;
            unsigned char CHR1 : 1;
            unsigned char SDIR : 1;
            unsigned char SINV : 1;
            unsigned char : 1;
            unsigned char SMIF : 1;
        } BIT;
    } SCMR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char RXDESEL : 1;
            unsigned char BGDM : 1;
            unsigned char NFEN : 1;
            unsigned char ABCS : 1;
            unsigned char : 1;
            unsigned char BRME : 1;
            unsigned char : 1;
            unsigned char ACS0 : 1;
        } BIT;
    } SEMR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char NFCS : 3;
        } BIT;
    } SNFR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char IICDL : 5;
            unsigned char : 2;
            unsigned char IICM : 1;
        } BIT;
    } SIMR1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char IICACKT : 1;
            unsigned char : 3;
            unsigned char IICCSC : 1;
            unsigned char IICINTM : 1;
        } BIT;
    } SIMR2;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char IICSCLS : 2;
            unsigned char IICSDAS : 2;
            unsigned char IICSTIF : 1;
            unsigned char IICSTPREQ : 1;
            unsigned char IICRSTAREQ : 1;
            unsigned char IICSTAREQ : 1;
        } BIT;
    } SIMR3;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char IICACKR : 1;
        } BIT;
    } SISR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CKPH : 1;
            unsigned char CKPOL : 1;
            unsigned char : 1;
            unsigned char MFF : 1;
            unsigned char : 1;
            unsigned char MSS : 1;
            unsigned char CTSE : 1;
            unsigned char SSE : 1;
        } BIT;
    } SPMR;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned char TDRH;
            unsigned char TDRL;
        } BYTE;
    } TDRHL;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned char RDRH;
            unsigned char RDRL;
        } BYTE;
    } RDRHL;
    unsigned char MDDR;
    char wk0[ 13 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char ESME : 1;
        } BIT;
    } ESMER;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 4;
            unsigned char BRME : 1;
            unsigned char RXDSF : 1;
            unsigned char SFSF : 1;
            unsigned char : 1;
        } BIT;
    } CR0;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PIBS : 3;
            unsigned char PIBE : 1;
            unsigned char CF1DS : 2;
            unsigned char CF0RE : 1;
            unsigned char BFE : 1;
        } BIT;
    } CR1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char RTS : 2;
            unsigned char BCCS : 2;
            unsigned char : 1;
            unsigned char DFCS : 3;
        } BIT;
    } CR2;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char SDST : 1;
        } BIT;
    } CR3;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char SHARPS : 1;
            unsigned char : 2;
            unsigned char RXDXPS : 1;
            unsigned char TXDXPS : 1;
        } BIT;
    } PCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char AEDIE : 1;
            unsigned char BCDIE : 1;
            unsigned char PIBDIE : 1;
            unsigned char CF1MIE : 1;
            unsigned char CF0MIE : 1;
            unsigned char BFDIE : 1;
        } BIT;
    } ICR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char AEDF : 1;
            unsigned char BCDF : 1;
            unsigned char PIBDF : 1;
            unsigned char CF1MF : 1;
            unsigned char CF0MF : 1;
            unsigned char BFDF : 1;
        } BIT;
    } STR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char AEDCL : 1;
            unsigned char BCDCL : 1;
            unsigned char PIBDCL : 1;
            unsigned char CF1MCL : 1;
            unsigned char CF0MCL : 1;
            unsigned char BFDCL : 1;
        } BIT;
    } STCR;
    unsigned char CF0DR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CF0CE7 : 1;
            unsigned char CF0CE6 : 1;
            unsigned char CF0CE5 : 1;
            unsigned char CF0CE4 : 1;
            unsigned char CF0CE3 : 1;
            unsigned char CF0CE2 : 1;
            unsigned char CF0CE1 : 1;
            unsigned char CF0CE0 : 1;
        } BIT;
    } CF0CR;
    unsigned char CF0RR;
    unsigned char PCF1DR;
    unsigned char SCF1DR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CF1CE7 : 1;
            unsigned char CF1CE6 : 1;
            unsigned char CF1CE5 : 1;
            unsigned char CF1CE4 : 1;
            unsigned char CF1CE3 : 1;
            unsigned char CF1CE2 : 1;
            unsigned char CF1CE1 : 1;
            unsigned char CF1CE0 : 1;
        } BIT;
    } CF1CR;
    unsigned char CF1RR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char TCST : 1;
        } BIT;
    } TCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char TCSS : 3;
            unsigned char TWRC : 1;
            unsigned char : 1;
            unsigned char TOMS : 2;
        } BIT;
    } TMR;
    unsigned char TPRE;
    unsigned char TCNT;
} st_sci12_t;

typedef struct st_sdhi
{
    union
    {
        unsigned long LONG;
        #ifdef IODEFINE_H_HISTORY
            struct
            {
                unsigned long : 16;
                unsigned long CMD12AT : 2;
                unsigned long TRSTP : 1;
                unsigned long CMDRW : 1;
                unsigned long CMDTP : 1;
                unsigned long RSPTP : 3;
                unsigned long ACMD : 2;
                unsigned long CMDIDX : 6;
            } BIT;
        #endif /* ifdef IODEFINE_H_HISTORY */
    } SDCMD;
    char wk0[ 4 ];
    unsigned long SDARG;
    char wk1[ 4 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 23;
            unsigned long SDBLKCNTEN : 1;
            unsigned long : 7;
            unsigned long STP : 1;
        } BIT;
    } SDSTOP;
    unsigned long SDBLKCNT;
    unsigned long SDRSP10;
    char wk2[ 4 ];
    unsigned long SDRSP32;
    char wk3[ 4 ];
    unsigned long SDRSP54;
    char wk4[ 4 ];
    unsigned long SDRSP76;
    char wk5[ 4 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 21;
            unsigned long SDD3MON : 1;
            unsigned long SDD3IN : 1;
            unsigned long SDD3RM : 1;
            unsigned long SDWPMON : 1;
            unsigned long : 1;
            unsigned long SDCDMON : 1;
            unsigned long SDCDIN : 1;
            unsigned long SDCDRM : 1;
            unsigned long ACEND : 1;
            unsigned long : 1;
            unsigned long RSPEND : 1;
        } BIT;
    } SDSTS1;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 16;
            unsigned long ILA : 1;
            unsigned long CBSY : 1;
            unsigned long SDCLKCREN : 1;
            unsigned long : 3;
            unsigned long BWE : 1;
            unsigned long BRE : 1;
            unsigned long SDD0MON : 1;
            unsigned long RSPTO : 1;
            unsigned long ILR : 1;
            unsigned long ILW : 1;
            unsigned long DTO : 1;
            unsigned long ENDE : 1;
            unsigned long CRCE : 1;
            unsigned long CMDE : 1;
        } BIT;
    } SDSTS2;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 22;
            unsigned long SDD3INM : 1;
            unsigned long SDD3RMM : 1;
            unsigned long : 3;
            unsigned long SDCDINM : 1;
            unsigned long SDCDRMM : 1;
            unsigned long ACENDM : 1;
            unsigned long : 1;
            unsigned long RSPENDM : 1;
        } BIT;
    } SDIMSK1;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 16;
            unsigned long ILAM : 1;
            unsigned long : 5;
            unsigned long BWEM : 1;
            unsigned long BREM : 1;
            unsigned long : 1;
            unsigned long RSPTOM : 1;
            unsigned long ILRM : 1;
            unsigned long ILWM : 1;
            unsigned long DTTOM : 1;
            unsigned long ENDEM : 1;
            unsigned long CRCEM : 1;
            unsigned long CMDEM : 1;
        } BIT;
    } SDIMSK2;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 22;
            unsigned long CLKCTRLEN : 1;
            unsigned long CLKEN : 1;
            unsigned long CLKSEL : 8;
        } BIT;
    } SDCLKCR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 22;
            unsigned long LEN : 10;
        } BIT;
    } SDSIZE;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 16;
            unsigned long WIDTH : 1;
            unsigned long : 7;
            unsigned long TOP : 4;
            unsigned long CTOP : 4;
        } BIT;
    } SDOPT;
    char wk6[ 4 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 17;
            unsigned long CRCTK : 3;
            unsigned long CRCTKE : 1;
            unsigned long RDCRCE : 1;
            unsigned long RSPCRCE1 : 1;
            unsigned long RSPCRCE0 : 1;
            unsigned long : 2;
            unsigned long CRCLENE : 1;
            unsigned long RDLENE : 1;
            unsigned long RSPLENE1 : 1;
            unsigned long RSPLENE0 : 1;
            unsigned long CMDE1 : 1;
            unsigned long CMDE0 : 1;
        } BIT;
    } SDERSTS1;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 25;
            unsigned long CRCBSYTO : 1;
            unsigned long CRCTO : 1;
            unsigned long RDTO : 1;
            unsigned long BSYTO1 : 1;
            unsigned long BSYTO0 : 1;
            unsigned long RSPTO1 : 1;
            unsigned long RSPTO0 : 1;
        } BIT;
    } SDERSTS2;
    unsigned long SDBUFR;
    char wk7[ 4 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 22;
            unsigned long C52PUB : 1;
            unsigned long IOABT : 1;
            unsigned long : 5;
            unsigned long RWREQ : 1;
            unsigned long : 1;
            unsigned long INTEN : 1;
        } BIT;
    } SDIOMD;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 16;
            unsigned long EXWT : 1;
            unsigned long EXPUB52 : 1;
            unsigned long : 13;
            unsigned long IOIRQ : 1;
        } BIT;
    } SDIOSTS;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 16;
            unsigned long EXWTM : 1;
            unsigned long EXPUB52M : 1;
            unsigned long : 13;
            unsigned long IOIRQM : 1;
        } BIT;
    } SDIOIMSK;
    char wk8[ 316 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 30;
            unsigned long DMAEN : 1;
            unsigned long : 1;
        } BIT;
    } SDDMAEN;
    char wk9[ 12 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 31;
            unsigned long SDRST : 1;
        } BIT;
    } SDRST;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 16;
            unsigned long CPRM : 1;
            unsigned long CLKRAT : 1;
            unsigned long : 2;
            unsigned long IP2 : 4;
            unsigned long IP1 : 8;
        } BIT;
    } SDVER;
    char wk10[ 24 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 24;
            unsigned long BRSWP : 1;
            unsigned long BWSWP : 1;
            unsigned long : 6;
        } BIT;
    } SDSWAP;
} st_sdhi_t;

typedef struct st_smci
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char GM : 1;
            unsigned char BLK : 1;
            unsigned char PE : 1;
            unsigned char PM : 1;
            unsigned char BCP : 2;
            unsigned char CKS : 2;
        } BIT;
    } SMR;
    char wk0[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TIE : 1;
            unsigned char RIE : 1;
            unsigned char TE : 1;
            unsigned char RE : 1;
            unsigned char MPIE : 1;
            unsigned char TEIE : 1;
            unsigned char CKE : 2;
        } BIT;
    } SCR;
    char wk1[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TDRE : 1;
            unsigned char RDRF : 1;
            unsigned char ORER : 1;
            unsigned char ERS : 1;
            unsigned char PER : 1;
            unsigned char TEND : 1;
            unsigned char MPB : 1;
            unsigned char MPBT : 1;
        } BIT;
    } SSR;
    char wk2[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char BCP2 : 1;
            unsigned char : 2;
            unsigned char CHR1 : 1;
            unsigned char SDIR : 1;
            unsigned char SINV : 1;
            unsigned char : 1;
            unsigned char SMIF : 1;
        } BIT;
    } SCMR;
} st_smci_t;

